{"transcript":"# PeopleOps BrainLift Review\n\n## Topics\n\n\n## Transcript\n\n[Dragos Nuta] (2025-10-21T14:32:37.200Z)\nI still see it as a failure. The net result in overly simplifying beyond anything that's a shade of gray, it didn't work. And if it's Bogdan, I know how Bogdan is. Bogdan is like, he's trying to not like it. I don't think that Sherban is the same. I think he wants way more SME involvement. And also, the approach of small, iterative improvements, as opposed to holistic, was this all about, what are we missing?\n\n Or definitely created some of that, or led to some of that. That's my take.\n\n[Kevin Norchi] (2025-10-21T14:33:28.229Z)\nYeah, pretty much.\n\n[Dragos Nuta] (2025-10-21T14:33:29.289Z)\nI don't see it as, I don't like it. It is what it is. We have bigger fish to fry right now, but I don't like it.\n\n[Kevin Norchi] (2025-10-21T14:33:42.772Z)\nYeah.\n\n[Kevin Norchi] (2025-10-21T14:33:44.593Z)\nI don't think he, there's good customers and there's bad customers, right? And I think he, we're the wrong product for him.\n\n[Dragos Nuta] (2025-10-21T14:33:57.616Z)\nThat I don't agree with. It's just a fire that I don't want to spend time on, but I don't agree with that. I mean like now I didn't mean this corny. One day, I think that would be a, yeah, I would not like that to be the case.\n\n[Kevin Norchi] (2025-10-21T14:34:14.569Z)\nYeah, I mean we got good people, we got people he liked, we got people to interview that that he genuinely liked. And we didn't find out till much longer into it that Samy actually wanted technical people. And there was just all sorts of stuff like that.\n\n[Dragos Nuta] (2025-10-21T14:34:35.788Z)\nI think all pipelines go through those challenges. I've seen the BCG, whatever, pipelines going through the same things, like people trying to hire for pedigree or assuming that relying on others to do the filtering I'm just not having a strong point of view. Even the hesitation behind making higher decisions in light of what is not the right decision, which is because you're not really sure what is the right decision and how it looks like, These are recurring.\n\n That's our environment. Let's see. Maybe we can keep The action items from the last time we chatted were interview question generation, daily pipeline diagnostics, and Anirudh is going to expose more APIs, user-level APIs. So an interesting input to enable LLM use with Crossover would be questions. Remember, there's a document called APIs, Crossover APIs. It would be interesting or useful if you guys state their questions that you would like to ask an LLM and let it sort it out and find the right data in.\n\n Because I can see it being done in a lot of ways and not everything will help you. The action items from last time for me were the brain lift for interview questions, the diagnostics, but there is no new API. And I didn't understand this action item. Optimize the interviewer quality feedback section. Enhance the interview pod feedback module beyond fixed rating by incorporating a brain lift and actionable suggestion for manual improvements.\n\n\n\n[Heather Lother] (2025-10-21T14:36:40.795Z)\nI think that is Read AI being super optimistic. My takeaway from that part of the conversation was we could use the interview grading bot to provide interviewer coaching. We don't have buy-in for that. We don't have demand for that. And so I would not have prioritized that. I would have prioritized improving the interview grading bot itself, which Kevin and I are already talking with Honorade about that prompt and being able to switch it over to a brain lift.\n\n And Kevin's got a good brain lift going, but we realized there were two versions floating around out there. So we need to make sure that they have the correct one. So I would say, The underlying core of that is in process. If we want to provide interviewer coaching, we certainly can talk about that. But to me, that does not rise to the level of an urgent priority in the next four weeks. And if we were to do that candidly, I'd roll out something ahead of time that actually provided coaching and guidelines before we started criticizing people live in XO Admin or emailing them coaching tips moving forward.\n\n Like we would need an incredibly strong brand lift on that. But I do agree it should go just not the short term. Number two, the daily pipeline health diagnostic prototype. I left the meeting last week and you guys tell me if I was the only one with this assumption. I know I had to jump quickly. I left the meeting last week thinking that was a TBD after maybe either additional APIs were exposed or there was more consensus on what we needed out of that?\n\n Did I misunderstand that or miss any part of where that conversation ended?\n\n[Dragos Nuta] (2025-10-21T14:39:10.364Z)\nAs I recall, we went back and forth on this idea that there's a practice of using even what you have. And it's not about prompting it and then having it do magic. It's about having a thing that happens to be even, I don't know, maybe it's a BU specific, maybe it's domain-specific, CompTier-specific, or whatever granularity. And using that in conjunction with what you have today would still do some x percent of the value.\n\n And that pairs with my other question, which is, what other things would you want it to be able to take? And I think we can expose it within the next one week. But even in this form, I thought my takeaway was that I can see our playlist. I can do something that says, that's the repeatable thing that it doesn't do everything I wanted because not all the information is there. But here's how I ended up standardizing it.\n\n\n\n[Kevin Norchi] (2025-10-21T14:40:06.309Z)\nSo Tristan's that we looked at last week was pretty good. And we traded some comments on it at the end of last week. I think how it'll probably end up being is we have a base brain lift, and then we add a couple spiky points of view that are like BU or pipeline specific. Cause there's some things in there that I just don't agree with for my pipelines, but all the meat of it are good.\n\n[Dragos Nuta] (2025-10-21T14:40:38.417Z)\nI think everybody's using it. I think most of us are using it in either cloud code or effort.\n\n[Heather Lother] (2025-10-21T14:40:50.531Z)\nRight, oh, that's what we're doing pipeline diagnostic and one of the two I will say is brain lift yet. Oh, see, I okay I'm using I made my own brain list.\n\n[Dragos Nuta] (2025-10-21T14:41:02.136Z)\nUm, because the only pipelines I care about are like 200k and up and I think there's some specific Data point differences when you're talking about high comp pipelines versus High comp low volume pipelines versus you know high volume low comp or low volume low comp it's just a little different um I don't see why we couldn't integrate all of the with branching logic you know I don't think that's the goal to be honest like the goal is that even if you end up having each of you have has two versions and they are like snowflakes they have similar but so different even that's like a big win and if you're like there's the api that's missing I think I got that kind of information from Tristan at some point, but not from nobody else.\n\n Actually, I was reviewing a proposal from Anirudh, but I feel like it's missing things. And I actually would have asked for this question from you guys. What are the types of questions or questions you wanted to answer, right, in order to, in part, in this release or even other things? Because I'd like to unblock that too. So anyway, sorry, I connected two things into one.\n\n[Heather Lother] (2025-10-21T14:42:11.180Z)\nFor me, and this may just limitation of how I've used it. So if you guys are getting better results, just tell me how. I am not seeing it do a very good job at pulling in any context about the job itself. It really just runs like straight data analysis based on a pipeline code. And to make pipeline diagnostic a one-stop shop, it would need to be able to pull in I would say the full R2 tab and probably also the R3 tab just to be able to say like logistically like hey part of the problem is that you're limiting this to a single city.\n\n But the R2 tab would be my number one because But really most of what I see missing is the ability to then go, okay, this is the data. Now my next step, the one that I most often want to run next is a TAM analysis based on the ICP. And I can't do that without having, I want to run like a total addressable market analysis based on the ideal candidate profile. And to be able to say like, okay, but given the candidate profile, pool available for this role, are these numbers good or bad?\n\n How do we fit in comparison? You know, this role fits into this field functionally. How do these numbers compare to norms in that field? And CHAT GPT, CLAWD, all of them have good enough, recent enough data on that to do a pretty decent analysis without me needing to add additional content to the library straight out of the box. It's just that I have to go add information about the job into the chat or into the Ephor library or wherever.\n\n\n\n[Dragos Nuta] (2025-10-21T14:44:12.286Z)\nDoes that make sense?\n\n[Heather Lother] (2025-10-21T14:44:29.139Z)\nThat would be super helpful.\n\n[Tristan Guy] (2025-10-21T14:44:34.923Z)\nI'd say the job description as well, just for any updating of that or position.\n\n[Heather Lother] (2025-10-21T14:44:44.170Z)\nJust to be able to kind of flag like, hey, there's a fundamental mismatch. Because really, if you have the RT and you have the JD, even just straight from the pipeline diagnostic tool, can almost immediately then run a deep dive on BFQ and JD. And that solves...\n\n[Dragos Nuta] (2025-10-21T14:45:04.962Z)\nOn BFQ, I mean, like analytics like you have today, or you're, I mean, like, would this enable already use cases with the existing APIs? Or like, no, what will the BFQs, if I can access all the BFQs that were submitted records? Level of detail matters. And today you have analytical End points.\n\n[Heather Lother] (2025-10-21T14:45:26.863Z)\nWhat I would love to see, and I don't know how feasible this is with the AI matching interview for BFQs, is I'd love to be able to see question-by-question pass rates or criteria-by-criteria pass rates and version control on that. Like, this was version A, this was the pass rate, you changed it to this wording on this date, this is the new pass rate, that would be I don't know how feasible that is.\n\n\n\n[Dragos Nuta] (2025-10-21T14:45:53.469Z)\nNo. As long as the master is in R2, we want to make this relaxed. There is an R2 you commit to there. But you'll have it by week. So as long as you know when you made changes, or you keep a log somewhere, even in the Google Drive, and your LLM can actually list your past changes, I think that's To self-enable the changelog and create a new tab in the R2 tab.\n\n[UNKNOWN_SPEAKER] (2025-10-21T14:46:25.728Z)\nYeah, okay.\n\n[Dragos Nuta] (2025-10-21T14:46:28.471Z)\nI mean, I could still give you, there is no, they have passed the BFQ, not the question. That's what I'm trying to understand. If you can pick one thing, what would that be? And I think I'm hearing, well, R2 and JT, everybody is longing for that. Okay, what's that?\n\n[Andrew Maroun] (2025-10-21T14:46:46.956Z)\nThe next thing I would say that it would be able to, on demand, pull information from a single BFQ interview, on demand. So let's say if it's required, they can just go and look at five candidates who have failed the BFQ and Read the transcript, but not have it by default. So just have it as a...\n\n[Dragos Nuta] (2025-10-21T14:47:07.873Z)\nIt's like a sample check if your use case is, I don't know, go scrutinize five BFQs or you like you're starting from a person hey tell me the how did john do at bfq I would say both I would say both you're doing a lot of sampling on bfqs you all I have been doing them just to understand more the thresholds uh what counts as a weak path what counts as a pass just these type of differences Maybe a corollary to that, Andrew, is would it be more effective or efficient to build out that dry run BFQ grading so that you can see the results there?\n\n You mean like take it? The dry run is like take it.\n\n[Heather Lother] (2025-10-21T14:48:06.840Z)\nYou need a link to Or you're actually, you want to see the actual transcripts and then be able to see, you know, this is the kind of transcript that would score 60. This is the kind of transcript that would score 70. These are the kinds of questions that consistently get ignored from grading. Is it more of that?\n\n[Andrew Maroun] (2025-10-21T14:48:33.602Z)\nI'm trying to think about both use cases and both of these have use cases. Tristan already mentioned a few of them for the first one, such as changing pipelines requirements, or if you want to go back at some point and lower the bar, or if we just want to scout for a different pipeline, but we already have some data on this pipeline, so we don't have to then open a new one. So I am leaning towards the navigation.\n\n\n\n[Dragos Nuta] (2025-10-21T14:49:00.730Z)\nTristan ZUCCHINNI-CLEMENTE I think the targeting use case is very different, right? Something like, oh, let me scout for some Candidates that happen to meet some other random criteria because I'm in a rush. That's a good use case, but it's a very different one. I would not blend them all in one. Maybe you can level up and say, OK, one thing is dig through candidates because you're trying to just find some perfect maturity target, whatever.\n\n The question is how often that is. The other one is diagnosis. The other one is tune thresholds. That's the conversation. I'm not sure. What's the thing that you pay 100 bucks each good day to have by end of next week? And R2 and JT are free.\n\n[Tristan Guy] (2025-10-21T14:49:46.317Z)\nOh, they're free? OK.\n\n[Tristan Guy] (2025-10-21T14:49:51.420Z)\nMaybe it would be diving into a candidate, so having more information in general about a candidate. The candidate that's available to the application, right?\n\n[Dragos Nuta] (2025-10-21T14:50:05.153Z)\nI guess not candidate per se, more like application. It's this type of a candidate on an application. Interviews on that, not everything.\n\n[Tristan Guy] (2025-10-21T14:50:14.036Z)\nOn the application, probably is more important than the candidate level here. But both would be nice.\n\n[Heather Lother] (2025-10-21T14:50:24.260Z)\nLeave super tactical. I pay more than a hundred bucks today to get a dashboard or email digest of pipelines with problems.\n\n[Dragos Nuta] (2025-10-21T14:50:40.502Z)\nWell, that's the whole conversation we started. That's, that's why I was like, cause I've seen that. I've heard that, but I don't know.\n\n[Heather Lother] (2025-10-21T14:50:49.565Z)\nSeems like I just keep coming back to that because I still don't have that. I still have to go. And that's what I mean.\n\n[Dragos Nuta] (2025-10-21T14:50:56.095Z)\nThat's why I'm asking, what's the next thing that enables that? If there's one API, a couple of APIs, a handful of APIs, what's that question that is not answered today and that makes the current version not fully supportive of that use case?\n\n[Heather Lother] (2025-10-21T14:51:11.606Z)\nI would take that today with the current data we have over nothing.\n\n[Dragos Nuta] (2025-10-21T14:51:18.250Z)\nI'll just put my flag there.\n\n[Heather Lother] (2025-10-21T14:51:24.666Z)\nrather ship what we have today into either a dashboard or a digest and then add things as we realize we need them, then wait for a perfect thing that I can only use annually.\n\n[Dragos Nuta] (2025-10-21T14:51:39.690Z)\nIt's missing the brain lift, right?\n\n[Heather Lother] (2025-10-21T14:51:43.712Z)\nWe have three or four brain lifts floating around. We'll, we'll send you all of them. I don't like, do you want one per user or do you want one consolidated one.\n\n[Dragos Nuta] (2025-10-21T14:51:53.764Z)\nTell me what works. What's the need?\n\n[Andrew Maroun] (2025-10-21T14:51:56.305Z)\nI think we go for a v0, which is just one per pipeline.\n\n[Heather Lother] (2025-10-21T14:52:03.209Z)\nOne brain lift per pipeline?\n\n[Andrew Maroun] (2025-10-21T14:52:05.470Z)\nNo, no.\n\n[Heather Lother] (2025-10-21T14:52:06.471Z)\nI don't think that's what you meant, but let me clarify.\n\n[Andrew Maroun] (2025-10-21T14:52:12.434Z)\nYeah, so one brain lift that is common for all pipelines, that we run once per pipeline. Instead of having any user, we leave the user questions one for us. We will ask them. Instead of deciding for each user or for each candidate, it should run. But at least the pipelines are clear. So if there is just one pipeline, you can just run it once.\n\n[Dragos Nuta] (2025-10-21T14:52:36.915Z)\nOK. So we have the R2 and the JT and some current brain lift. With the current APIs, you guys think that it will still be a bit cloudy, but you will start seeing some rays of sunshine.\n\n[Andrew Maroun] (2025-10-21T14:52:49.207Z)\nI will just add one more thing, which is for it to understand a bit what happens after the interviews. So first, I added a tag that says that, for example, there might be two or more interviews in a pipeline. So it's not just that once an interview is passed, that person is hired. How do you know that today? Because that's all the system, right?\n\n[Dragos Nuta] (2025-10-21T14:53:14.654Z)\nThis is all the system today. If you just look at the data model, you have no idea how many interviews will be. And what's the sequence, right? Or am I wrong?\n\n[Andrew Maroun] (2025-10-21T14:53:24.756Z)\nYou can know based on the interviewer's dates. So for example, a candidate passes interview number one. And then they're scheduled with a different interviewer. They can know the general understanding, general feel behind how many interviews.\n\n[Dragos Nuta] (2025-10-21T14:53:36.783Z)\nOK. You can be a voice engineer, but you don't know.\n\n[Andrew Maroun] (2025-10-21T14:53:39.304Z)\nYeah, exactly. But what's missing is that knowing that this candidate actually What happens after the interview, which is the offer and the PC cut and whether they are onboarding or hired? That Intel, we have no idea what server on it now. So it doesn't know that if a candidate was hired or not in this pipeline. That I would want to enhance.\n\n[Tristan Guy] (2025-10-21T14:53:59.607Z)\nThat's just the application information that is missing. That it knows an application has passed an interview, but it doesn't know where that application is now.\n\n[Heather Lother] (2025-10-21T14:54:11.475Z)\nYeah, yeah.\n\n[Heather Lother] (2025-10-21T14:54:13.550Z)\nthat the details.\n\n[Dragos Nuta] (2025-10-21T14:54:39.666Z)\nIt has who it interviewed and what not. Because that was also designed to be more like for a pipeline, it gets all interviews. It doesn't get a specific person interviewed.\n\n[Tristan Guy] (2025-10-21T14:55:01.141Z)\nSo for a manuscript, but then it says go hire this person who's already cancelled or rejected Well, I think that interview endpoint that's currently there should not be misused.\n\n[Dragos Nuta] (2025-10-21T14:55:15.058Z)\nAnd that's not necessarily you, it's probably the LM or M or whatnot, I think. Because that one is just saying, these are the interviews that happen on this pipeline overall. And you can use them to, I don't know, maybe we should retire that and replace it with something else. Maybe that's a better decision. Okay. So on an application, then you will get You're saying that you want to get, I think you want to get applications that are late stage or were late stage recently.\n\n And I think you want are or were late stage. And the other one was that you want to get, I don't know, what's like the interview or interviews. Stage, all interviews, and what are some other things that are, let's say, critical? And again, I can kind of get on the top and evolve from there. But filter, currently stage or Wordlet stage, and return is stage, interview information, and what else?\n\n[Andrew Maroun] (2025-10-21T14:56:23.550Z)\nYeah, I would say just add last opening date for a back plan. But I'm not sure if it was added in the last few weeks. But if it wasn't.\n\n[Dragos Nuta] (2025-10-21T14:56:39.561Z)\nOK. Well, we'll add this. We'll use it as it is today, and then we'll wrap it up in something that runs daily. And you can just find in pipeline admin. OK. But there were some other topics. Was anything done on the other topics, or is that of any interest? I mean, like the interview question generation. If that comes through, we can, at any point in time, throw it into the spot That's a super easy win.\n\n But of course, the questions are good. The previous ones, honestly, they were not. I'm happy with it.\n\n[Tristan Guy] (2025-10-21T14:57:18.917Z)\nWhile ago, I was kind of reviewing that, and I felt that maybe it should not be in the spotlight, but in like a separate kind of interview preparation type.\n\n[Kevin Norchi] (2025-10-21T14:57:35.535Z)\nSection to yeah, or like the the g-chat we were gonna send people What was that Kevin it was like 24 hours before an interview happens the interviewer gets a g-chat with like a little succinct Summary even done or was it not done?\n\n[Andrew Maroun] (2025-10-21T14:57:57.471Z)\nYou know, I think I like it also inside the spotlight which it's because precisely when it kind of isn't it the Review stage. If one of the critical questions would make them non-eligible or ineligible to pass the interview, we should know that. So for example, if it was able to find some inconsistency after reviewing the transcript and the resume, or if it saw that there is some issue inside its course, it should just flag it as an important question to ask, The interviewer should ask it, and we should be asking it ourselves before passing it to interview.\n\n So I would just like to have these questions inside the spotlight.\n\n[Dragos Nuta] (2025-10-21T14:58:42.089Z)\nYeah, I think the problem is I'm a bit torn on what to do with what, because when you open up an interview today, you don't see anything, because it says that the transcript is missing. And there's a link to the 360, and maybe people click on it, and then, I don't know, maybe that screen space that is there empty because there's an interview somewhere. It could be something that prepares you for the interview, but that's already Spotlight, I guess.\n\n So why do you need another thing? I don't know. I don't know what best helps hiring managers. But look, we can throw it into Spotlight pretty fast, and then we can put it into the interview panel. In general, I don't think that on GChat I would send a lot of content. I would still send people to the app. I would minimize that chattiness of, like, I can't find what it said.\n\n[UNKNOWN_SPEAKER] (2025-10-21T14:59:35.791Z)\nOK.\n\n[Dragos Nuta] (2025-10-21T14:59:40.414Z)\nI have a hard stop. Before we close, any particular things I should get out of this call myself? OK. How do you manage to get to some 90% accuracy in that video grading for telling engagement story, engaging story. On a sample set of 15 submissions, not a lot, but I don't know, still representative because they were broadly, I don't know, randomly token taken. He'll expand that and had that I'm counting or I don't know who else, whomever else is involved in this, we need Himanji, is that her name, right?\n\n We need Himanji to look over those, because he He obviously, just like you started, Andrew, he started from your work and enriched a bit, you know, distilled that into more detailed criteria, right, and whatnot. So we'll need the SME saying, you know, there's no correlation between these things. It just happens the way we set it up. It takes the same grade, but it has nothing to do with that. I would never look at this or anything like that.\n\n We will need the SME inputs.\n\n[Kevin Norchi] (2025-10-21T15:00:48.941Z)\nI don't think we need Himanshi. To look at it. I think any one of us can be the SME on this.\n\n[Dragos Nuta] (2025-10-21T15:00:59.416Z)\nDocument is here. I don't have a...\n\n[Heather Lother] (2025-10-21T15:01:04.260Z)\nThe thing Tristan and I talked about just a little bit earlier was actually validating it with Marat and Ben based on taking some historical applications from people who either have or have not been rejected at the interview stage for exactly this skill set, and then being able to run those results. So Tristan, do you want to take? Yeah.\n\n[Dragos Nuta] (2025-10-21T15:01:34.583Z)\nSee how he exploded them into things and made assumptions such as you need to have at least two off yeses, and that can easily become chance. Maybe some were inherited from you, Andrew. I don't know. I don't have a mental to be honest, but I just know that this setup and with chain prompting, not one-off, but their criteria got to some 90% accuracy, and you have the data here showing that. Yeah, okay.\n\n Yeah, I do have a hard stop too, but please push it forward as we still have some inertia here. If you're reviewing it, like in parallel, Ariuth will extend the test suite, the test cases, basically. I asked him to at least double, I don't know, 30 or 50 something assessments. Let's see what the percentage is then. I think Heather has a good catch, because some people might have been rejected exactly for that, and we're going to create some weird things into the data set.\n\n And I don't know. So Tristan, this is on you now? Yes.\n\n[Tristan Guy] (2025-10-21T15:02:42.279Z)\nDefinitely. I'll have a look at this.\n\n[Dragos Nuta] (2025-10-21T15:02:45.520Z)\nOK. Yeah, it's fun. I don't think it was the biggest priority, but I think Ben got me started when he said, I wonder if you guys know how to, or can do that. We're like, okay, we're the retarded people. Okay. I think we can. Okay.\n\n[Dragos Nuta] (2025-10-21T15:03:06.103Z)\nThank you.\n\n[Andrew Maroun] (2025-10-21T15:03:06.783Z)\nBye.\n\n[Andrew Maroun] (2025-10-21T15:03:09.226Z)\nBye. You"}