{"transcript":"# XO Weekly Alignment\n\n## Topics\n\n\n## Transcript\n\n[Anirudh Bhardwaj] (2025-10-28T15:31:08.607Z)\ngone through the code, I don't think it is going to break a lot of things. So we'll probably see it. Hi Heather.\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:31:17.150Z)\nWhat are we breaking?\n\n[Anirudh Bhardwaj] (2025-10-28T15:31:19.030Z)\nNo, no, we are trying not to break anything.\n\n[Heather Lother] (2025-10-28T15:31:20.571Z)\nI came in on the wrong end of that sentence.\n\n[Anirudh Bhardwaj] (2025-10-28T15:31:25.192Z)\nI'm just trying to get along with the engineers and ensure we don't break anything.\n\n[Kevin Norchi] (2025-10-28T15:31:32.935Z)\nAs long as we can see like, yes, this has been Yes, this is past or no, it's not past. Auto reject the ones that failed it, then we're good. Like requirements on my end are pretty simple.\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:31:48.032Z)\nYeah, straightforward.\n\n[Heather Lother] (2025-10-28T15:31:52.675Z)\nIs it the code signal proctoring you're talking about?\n\n[Dragos Nuta] (2025-10-28T15:31:57.679Z)\nLong time coming.\n\n[Anirudh Bhardwaj] (2025-10-28T15:31:59.560Z)\nAlright, there it goes.\n\n[Dragos Nuta] (2025-10-28T15:32:04.032Z)\nIt still works out of the box, right? Am I wrong? Or we're still in the question phase? It does work outside the box, right? Or are we still at the question phase? Or I mean like on the code signal proctoring in terms of integration with the platform.\n\n[Anirudh Bhardwaj] (2025-10-28T15:32:25.907Z)\nYeah, it works out of the box.\n\n[Dragos Nuta] (2025-10-28T15:32:30.879Z)\nAnd you'll see that signal, whether it's proctored or not in the Cogsignal result.\n\n[Anirudh Bhardwaj] (2025-10-28T15:32:36.782Z)\nSo the webhook events are different. But for the stages that are not started or started, so not started, we'll have to cancel and recreate. And started would not be impacted.\n\n[Dragos Nuta] (2025-10-28T15:32:51.831Z)\nBut whether it's proctored or not, you'll see that in the Cogsignal report, not in the platform.\n\n[Anirudh Bhardwaj] (2025-10-28T15:32:57.614Z)\nYeah, in the report. I'll have to check on the platform, but the report for sure.\n\n[Dragos Nuta] (2025-10-28T15:33:06.081Z)\nI'm not sure if Kevin agrees or is confused or what.\n\n[Kevin Norchi] (2025-10-28T15:33:14.105Z)\nLeaving the technical decisions. Not technical, I'm just saying like expectations.\n\n[Dragos Nuta] (2025-10-28T15:33:19.348Z)\nThe cold signal report is the only place where we see whether it's proctored or not.\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:33:22.910Z)\nRight now, yes.\n\n[Dragos Nuta] (2025-10-28T15:33:24.671Z)\nAnd you're fine with that. For something more. I don't think we need more than that.\n\n[Kevin Norchi] (2025-10-28T15:33:29.756Z)\nWell, no, I want to see it in Salesforce.\n\n[Dragos Nuta] (2025-10-28T15:33:38.421Z)\nThere's a time to talk and there's a time to not say anything. This is the time to talk. I'm going to manually go into Salesforce or into CodeSignal every time I have a candidate go to interview and then Your challenge is that you would have had both types of candidates at some point. You would have had some that went to the proctor, some that went to the non-proctor, and you basically want to make it clear when you look at the profile which version they took.\n\n Maybe that's another question. If you took the non-proctor, what happens?\n\n[Kevin Norchi] (2025-10-28T15:34:12.838Z)\nOh, yeah, I guess. I mean, if they have a pass score, yes. I might just cancel them all and have everybody retake who's taken it in the past. But yeah, right now, I mean, I can.\n\n[Dragos Nuta] (2025-10-28T15:34:35.851Z)\nIf you're doing that, then the work becomes retire the badge and create a new one and use the new one. But let's think about the pros and cons. Definitely, if you want to mix and match and keep some, keep them all, then, yeah. That's an important ITD. That's an ITD. It's, um, the con is rework for, um, Tons of rework with more or less the same exact test.\n\n[Kevin Norchi] (2025-10-28T15:35:05.983Z)\nSame exact test. So if they passed it before, they should be able to pass it again. Uh, it's just, it's an extra hour and 10 minutes out of their life. It's just, um, well, we haven't, um, actually administer. I mean, it's not been on the pipeline in months. So maybe a retake isn't such a high ask.\n\n[Dragos Nuta] (2025-10-28T15:35:26.606Z)\nI don't know how it was from point of view. Don't think about it. I'm just saying that there's a big difference. And if we're like, screw the old version, it's so tainted with cheating and whatnot that we don't know what to make out of it, then we do that. The old version, I don't know, even called it or whatever, retire it. It's no longer a patch. And we create a new one and there's no migration per se because just added to pipelines.\n\n\n\n[Kevin Norchi] (2025-10-28T15:35:57.587Z)\nThe alternative is anytime someone with an old score comes to the review queue, I have to manually cancel it, reach out to the candidate, tell them, Hey, you should retake this. And then I have to make a decision. Based on what country they're in. Usually that's the giveaway. I'd rather just automate all this.\n\n[Dragos Nuta] (2025-10-28T15:36:25.015Z)\nAutomate a decision or automate as in my first proposal, which was don't keep any results. Start from scratch.\n\n[Kevin Norchi] (2025-10-28T15:36:33.060Z)\nYeah, first proposal, which would be that they come in and everybody who comes to the review queue, it means that they've been proctored and that they've been or are going to be proctored, uh, or have passed. And I don't know, I don't know if haven't been proctored yet. We'll come to my queue. That's, that's another thing I guess I'm going to find out in real time.\n\n[Dragos Nuta] (2025-10-28T15:36:55.364Z)\nSo because the result didn't come through, no, I think not. Anyway, we'll see.\n\n[Heather Lother] (2025-10-28T15:37:00.488Z)\nSo the other thing you'll want to test is whether CodeSignal will still let them upload an old score. If they've taken it for another company. Because they do allow that. They do allow you to take your old test that you've taken for another hiring process and upload that score for ours. And so you may just want to check in with them and see if they're going to flag that as an unproctored or if they're actually just going to say, hey, you can't do that anymore.\n\n\n\n[Dragos Nuta] (2025-10-28T15:37:33.998Z)\nIf they see it as two distinct tests, so there's nothing to reuse, or if they see it as a test that has both versions and yeah. Yeah, good catch.\n\n[Heather Lother] (2025-10-28T15:37:43.094Z)\nIt doesn't happen often. It's a super edge case, but when it does happen, it comes in really weird. Like it doesn't look like a normal, it looks like a normal test result in Salesforce. But then if you go to open the score report, it doesn't look like our normal ones.\n\n[Dragos Nuta] (2025-10-28T15:37:59.168Z)\nAnd another question will be on the retake. Normally there is a, they also have their own cool off period. I don't know if they'll enforce the cross non-proctored and proctored. I know some people would have taken the non-proctored one two, three months ago, and now they can't take the un-proctored one.\n\n[Heather Lother] (2025-10-28T15:38:22.139Z)\nYeah, I think that our preference would probably be to treat them.\n\n[Dragos Nuta] (2025-10-28T15:38:28.203Z)\nOh, actually, here's the... The context on these questions is the following. You enable proctoring for our test, but what if you disable proctoring for that test? And create another test that has proctoring, and we decide which one we use, which is our preferred option. And in that case, how will the call of period impact and then whatnot? I would prefer that, because then even in personal, you see them in different patches, different segments.\n\n It's cleaner. Let's see. I have one question.\n\n[Anirudh Bhardwaj] (2025-10-28T15:39:07.413Z)\nSo just to be clear, for people who have already cleared the unproctored test, we would want them to go through the proctored test again, or not?\n\n[Dragos Nuta] (2025-10-28T15:39:18.516Z)\nI think that's an ITD that everyone needs to write. I don't have enough data. I don't know. For example, I don't know how often you encounter cheating.\n\n[Kevin Norchi] (2025-10-28T15:39:28.458Z)\nIt's not about data. It's about, well, it's pretty frequent.\n\n[Dragos Nuta] (2025-10-28T15:39:33.079Z)\nFor example, if you're like, 50% of the people that I sent to interview, I got back a hiring manager saying, didn't you see that they've cheated? That's, for example, even if not everybody cheated, the fact that the late stage people that you likely get again at the late stage have done that makes it a good enough reason to do that. There's not data in the sense of, sorry.\n\n[Kevin Norchi] (2025-10-28T15:40:00.126Z)\nI was going to make an argument just and the amount of time it's gonna take me to do manual shit, but that's actually a good point. At the $30 an hour level in the countries where we tend to get candidates, Robert and some of the other SVPs were saying that it's almost 80% of the candidates that we're getting were cheating.\n\n[Heather Lother] (2025-10-28T15:40:22.189Z)\nAnd if they automatically get to cross apply and skip it, then you have, made that an exponential problem rather than a pipeline problem. That becomes a system problem.\n\n[Kevin Norchi] (2025-10-28T15:40:38.382Z)\nSo we should make this a new application step.\n\n[Dragos Nuta] (2025-10-28T15:40:42.605Z)\nAsk them to undo the change on the old test and create another new test from scratch that represents the Proctor version. And then we'll have two IDs. We'll create another application step that points to the new ID. The old ID will be renamed to something like obsolete, do not use, so that things are super clear. From all active pipelines and all things like that, admin work. And then, yeah, the new one will be the one being used across all pipelines.\n\n\n\n[Anirudh Bhardwaj] (2025-10-28T15:41:08.781Z)\nWhat should happen for the... OK, that will anyways be...\n\n[Dragos Nuta] (2025-10-28T15:41:12.822Z)\nThere's no need now to cancel, retake, recreate, because it's a different step, like it doesn't matter. The only problem with people that are in the stage are now in the stage where they should be at least at the test, but they enter the stage before you are at the test, so the test is not going to be there. Because remember that the assessments are created when you enter the stage. If you add something then, it's not there.\n\n And I don't know how often that happens. I assume it's not a problem.\n\n[Anirudh Bhardwaj] (2025-10-28T15:41:40.561Z)\nWe have 514 applications in the started stage, but the data is from 2022.\n\n[Dragos Nuta] (2025-10-28T15:41:45.084Z)\nNo, I'm not talking about the ISR state. I'm saying, can they reach the RWA stage? And that's where co-signals should be administered. If you're adding up to a pipeline, the badge right now, they will not be asked to take the test, because they got to enter the stage of RWA before that was a requirement. And that's not necessarily a problem per se, because maybe they've taken another test to compensate for that.\n\n It's just something to account for if you're removing and adding something, or however it is.\n\n[Heather Lother] (2025-10-28T15:42:16.516Z)\nThe other thing to account for is that we never, well, we should never. This should be codified. Never remove an assessment before we have added the replacement. The new one always gets added before the old one gets taken away. Otherwise, everybody skips over that stage and never sees either assessment.\n\n[Dragos Nuta] (2025-10-28T15:42:38.416Z)\nSo if you remove it, they don't see.\n\n[Heather Lother] (2025-10-28T15:42:43.298Z)\nIf you remove, so if there's one assessment at the SMQ stage and you remove that assessment, everybody Who's at smq automatically advances to frq. It doesn't matter if five minutes later you go add a new smq test So the new one always needs to be added before you take away the deprecated one.\n\n[Dragos Nuta] (2025-10-28T15:43:03.296Z)\nOtherwise You lose candidates in that process and they advance artificially So you're saying that when you add an assessment to a stage people that are already in that stage are going to be added that application step Well, it was something that I thought it's not I'm pretty sure they will it If not, it at least holds it in that stage, and we can check it.\n\n[Heather Lother] (2025-10-28T15:43:24.580Z)\nBut if they advance to FRQ, we lose the oversight. I'm pretty sure it gets added, though.\n\n[Kevin Norchi] (2025-10-28T15:43:34.228Z)\nSo before we move on to important stuff, and this might be important.\n\n[Heather Lother] (2025-10-28T15:43:40.813Z)\nThis is still important.\n\n[Kevin Norchi] (2025-10-28T15:43:42.295Z)\nRegarding the thing that, Jagosh, I forwarded to you, in order to the attachments I needed to download them. Is it strange that when I replied, all the attachments weren't attached?\n\n[Dragos Nuta] (2025-10-28T15:44:02.981Z)\nI think you forwarded, you didn't reply.\n\n[Heather Lother] (2025-10-28T15:44:05.821Z)\nIf you try hitting reply and seeing if they attach, or try forward and try the opposite.\n\n[Dragos Nuta] (2025-10-28T15:44:12.843Z)\nReply removes attachments, always has been the case.\n\n[Kevin Norchi] (2025-10-28T15:44:16.213Z)\nOh, OK. I'm a little nervous that I downloaded them.\n\n[Heather Lother] (2025-10-28T15:44:27.259Z)\nWell, there's, I mean, tools you can run them through if you wanted.\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:44:31.021Z)\nI don't think you should.\n\n[Heather Lother] (2025-10-28T15:44:34.383Z)\nAnd if you download it through Chrome, Chrome checked them already, too.\n\n[Kevin Norchi] (2025-10-28T15:44:37.786Z)\nI did, yeah.\n\n[Dragos Nuta] (2025-10-28T15:44:44.634Z)\nNo, they are images. They are nothing else. Cool, cool. But that sounds like a reverse. It's quite the opposite of what they wanted to make it look like, It does seem like that person is a victim, or it's a victim and a fraudster, and the person raising it is another fraudster.\n\n[Kevin Norchi] (2025-10-28T15:45:06.928Z)\nYeah, I think so. Is this a incident that should be reported to some other more formal channel. I remember we used to do those trainings, but I can't find them.\n\n[Dragos Nuta] (2025-10-28T15:45:18.982Z)\nThere is a security at crossover.com. It will go to Anka, basically. She's still working part-time for us on demand, not fixed hours. Based on work she has, she sends the security at Crossover, it goes to Anka. Normally the question is if we do some due diligence to figure out if we did something bad, which I still don't assume even by the last time something shitty happened I clicked the report because I felt like that was a lot of shit there didn't uncover it but at least we can I covered a lot of holes but this one I think it's it's really highly isolated some people are fighting and we are in the we're in their range okay so do nothing send it to security but I'll not do more than that I personally do not want to spend any time on that to me it's not at all obvious that I don't have any Until that conversation with the guy happens.\n\n I don't I think this is a hoax or uh Some people are telling their scores security at crossover.com I think so. Yes for compliance Hang on.\n\n[Heather Lother] (2025-10-28T15:46:22.681Z)\nI have it in my inbox. Let me go search That's when we had the whole last incident I sent it uh Security is it Crossover or Trilogy?\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:46:36.824Z)\nI don't know.\n\n[Heather Lother] (2025-10-28T15:46:38.946Z)\nI'm sorry, I have a security at Trilogy.\n\n[Kevin Norchi] (2025-10-28T15:46:40.728Z)\nNope, I'll do that one instead.\n\n[Heather Lother] (2025-10-28T15:46:46.295Z)\nLet's see if I have Crossover. I don't see anything for Crossover. Do we need to be aware of, or are we good?\n\n[Dragos Nuta] (2025-10-28T15:47:09.879Z)\nThe short version is that somebody claimed to have been offered PCCat test. But based on the looks of it, it seems like not necessarily. It seems like some people are trying to settle some scores. One being a real fraudster and the other being a fraudster. We'll see. Let Javed talk with him, and then let's have a written document. We'll leave it there. Let's see. I don't know if you guys have this document, which I'll just share with you now.\n\n Heather, Kevin, you all remember the budget plan, took those goals, split them out into initiatives prioritizing to some extent and the way I and others are working on is that we're setting some targets on when certain things should be rolled out production whether we hit them or not that's a different story there's always a plan right the document is now in your chat When did you learn?\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:48:31.555Z)\nSo Q4, 25.\n\n[Dragos Nuta] (2025-10-28T15:48:31.855Z)\nYou remember the bug, right? Where the buttons are in the wrong places in my GPT. Same bug. Can't imagine it. Like, we click on it and then click something else. Can't imagine it. You're there, right?\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:48:47.887Z)\nThere we go.\n\n[Dragos Nuta] (2025-10-28T15:48:49.847Z)\nLots of patience. That's FYI, I don't think when reading it, you'll be very confused about some things. There are some decisions on how to mix and match them and whatnot, but still aiming for the same big goals we discussed previously. This week we'll insert a survey, the application experience. It's a one-question experience. It gets randomly popping out at candidates to ask one single question that will help us understand whether the brand effort is making any dent.\n\n I'm just mentioning that because it's important, because we are doing it now, because we need time to collect data. So I don't want to end the quarter and not have any data. But otherwise, I don't know. That can be reviewed for our sync. But for me, the important topics were AI grading, were video grading for the engaging story, recall AI rollout, and stage swap. And what else? Oh, I don't know. To some extent, although we all discussed, I think the insights that came from running a survey on the people that got the spotlight summaries email, that was also another topic to go through.\n\n\n\n[Kevin Norchi] (2025-10-28T15:50:10.543Z)\nWhat's that all about, AI? What's that all about?\n\n[Dragos Nuta] (2025-10-28T15:50:13.505Z)\nInstead of having Read AI set up locally and set up your own web who can not have Read AI not know how to set it up and whatnot. We have our own bot that joins our calls. You don't have to set it up yourself. It was enabled, and it blew up in flames, right?\n\n[Anirudh Bhardwaj] (2025-10-28T15:50:32.127Z)\nSo one of the configuration missed. It actually got enabled yesterday.\n\n[Dragos Nuta] (2025-10-28T15:50:36.508Z)\nIt blew up in flames, extinguished the fire, and sending the animal back on the front line.\n\n[Anirudh Bhardwaj] (2025-10-28T15:50:45.673Z)\nAnd we've got one completed. I'm waiting for more and ask for a feedback maybe later this week. OK, so it's worth it.\n\n[Dragos Nuta] (2025-10-28T15:50:53.727Z)\nWorth knowing that, and please correct me because I didn't try the experience. I know the requirements. It has a sensible name, like Crossover Interview Assistant. Once you accept it, it sends a G-chat, not a G-chat, sorry, a message on the chat of the meeting saying, hey, I'm your Crossover Assistant. I'm going to record the interview, blah, blah, whatever. I don't know what it says. And it will get the message.\n\n Now, whether people accept it or not, hopefully they do. On the name, whether they keep it or not, hopefully it depends on the message. And that's all. In time, we can go further. We can, at some point, use this to, I don't know. We can, by the way, with recall.ai, we can stream the transcription as it comes. So in some distant future, when this becomes our MIP, we can use that live to do something.\n\n\n\n[Heather Lother] (2025-10-28T15:51:34.426Z)\nWe could do that with Google Meet already. It streams the transcript into a Google Doc live.\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:51:40.410Z)\nIt does.\n\n[Dragos Nuta] (2025-10-28T15:51:41.431Z)\nIt's crappy, but it does it.\n\n[Dragos Nuta] (2025-10-28T15:51:44.500Z)\nI actually like it. Google, I think it's better than many.\n\n[Heather Lother] (2025-10-28T15:51:48.563Z)\nI was going to say, the last time I looked at it, it did a terrible job at like understanding certain words and I had to like do a find and replace in it.\n\n[Dragos Nuta] (2025-10-28T15:51:57.850Z)\nBut yeah, anyway, the problem is different. We need to set, we need, in order to programmatically control Google Meet, we'll have to have admin access on the Google suite, which we'll never get. From IT and whatnot. So that's a simple way that we own and works with anybody. You don't have to be in our domain. I don't care if you're managed by our IT. You just have to accept what we call AI in the meeting, just like any bot.\n\n OK, so it's been rolled out to how many people? I think that, Anirudh, you're trying to do a gradual rollout once it goes.\n\n[Anirudh Bhardwaj] (2025-10-28T15:52:32.328Z)\nAnirudh SIVARAMAKRISHNAN THROUGH INTERPRETER Poor folks, it has been rolled out. One of them completed. One of them had a success full interview assistant entering the meeting. Five are scheduled for the next three days. I'll monitor and I think once I've got feedback from these four over the next...\n\n[Dragos Nuta] (2025-10-28T15:52:48.823Z)\nOnce it works, enable it for all SMEs that had ASRs as interviewers but did not have a transcription. That's like plus number one. Once we like that, I don't know, maybe we even send it instead of every day to all users. There's a choice on a user, whether you use EDI or our assistant. People don't know about it, but yeah, you could change it. So I guess we'll, eventually we'll want to change all of them to that because we just have more control.\n\n\n\n[Heather Lother] (2025-10-28T15:53:18.119Z)\nWill it allow us to, will it include timestamps? Or does it just do a transcript?\n\n[Anirudh Bhardwaj] (2025-10-28T15:53:27.284Z)\nTranscript and summary, both. It gives both. Basically the interview summary pieces The way it was integrated with Read.AI, it is integrated with recall as well. So nothing changes there.\n\n[Heather Lother] (2025-10-28T15:53:41.863Z)\nIf we're going to have streaming interviews at some point, I'd love to collect data on who joins interviews on time and who joins interviews late and by how many minutes.\n\n[Dragos Nuta] (2025-10-28T15:53:54.354Z)\nI can also do that anyway now because you know when they start talking. It seems like you have some scores to settle.\n\n[Heather Lother] (2025-10-28T15:54:05.434Z)\nI do not have scores to settle, but it would make me really happy to be able to give people score cards on their quality as an interviewer and let them know how they are helping or hurting their team meet their hiring goals.\n\n[Kevin Norchi] (2025-10-28T15:54:19.860Z)\nThe score is there.\n\n[Heather Lother] (2025-10-28T15:54:28.171Z)\nsettling is there.\n\n[Heather Lother] (2025-10-28T15:54:32.293Z)\nIt's more about...\n\n[UNKNOWN_SPEAKER] (2025-10-28T15:54:35.574Z)\nI would do it.\n\n[Heather Lother] (2025-10-28T15:54:36.995Z)\nI have a lot of people who are convinced that... I have a lot of people that I have to convince that candidate experience actually matters and that candidates who consistently have a core experience with senior executives in this company form a very poor opinion of this company and the senior executives. And so there's some reputation management to be had, especially when they're hearing from the top, why can't you recruit these kinds of people?\n\n And I have to explain, you've created a reputation that does not attract those kinds of people.\n\n[Dragos Nuta] (2025-10-28T15:55:14.545Z)\nSo- How do you connect the dots to Zoom doing that? Data and candidate feedback and So it's not only Crossover or AlphaSax, now we are at, I don't know, JohnSax, and John is a hiring manager. And it's not only some very few named people you're saying that it went broader. There are a lot of names that are known out there in the world.\n\n[Heather Lother] (2025-10-28T15:55:41.287Z)\nWell, and it's also about, I can help people avoid the negative repercussions by giving them data quickly and early and helping them flag. The other piece is there are some people who think they have great interviewers on their team screening people for them and who don't realize how much those people are actually harming their pipelines. So like the escalation emails help because they're able to see SLA breaches, but there are other pieces of data that harm the candidate experience that they're not able to have visibility into.\n\n And so they don't understand why candidates are frustrated by the time they talk to them, or they don't understand why candidates are like, no, convince me that I want this job. I'm not going to convince you to hire me. You convince me that I want to accept your offer. And they're very taken aback by that. And they don't understand why candidates are approaching a final interview that way. So it's more from that framing.\n\n\n\n[Dragos Nuta] (2025-10-28T15:56:36.259Z)\nA quick question before we move to the next topic. Kevin, when Suchi replied that she had to schedule the interview, why did we send that email, like, is that, are we sending emails even when IT managers or interviewers are asking to reschedule because we are relying on the old data or are they rescheduling in weird ways outside the system?\n\n[Kevin Norchi] (2025-10-28T15:57:01.802Z)\nIt's based on Salesforce data. So she rescheduled wrong. So it's based on Salesforce data. Um, if she reschedules with them via email, uh, then it doesn't show up in our system anyway.\n\n[Heather Lother] (2025-10-28T15:57:14.699Z)\nIf you just click the calendar event and reschedule, it doesn't show up in our system either. You have to go to XO Admin and click the Reschedule button for it to update in our system.\n\n[Kevin Norchi] (2025-10-28T15:57:24.486Z)\nOr I've offered to do it a million times for them as well.\n\n[Dragos Nuta] (2025-10-28T15:57:28.469Z)\nYeah, I handle a lot of it manually.\n\n[Dragos Nuta] (2025-10-28T15:57:29.970Z)\nI think it's a very, very low-priority thing, but when the rescheduling is used, Anirudh, even currently, it should update Salesforce. I'm not going to cut down on that hill. This is by far not the most important thing. Somewhere in 2029.\n\n[Heather Lother] (2025-10-28T15:57:44.581Z)\nNo, like this is, this is like item number something 217 like that.\n\n[Dragos Nuta] (2025-10-28T15:57:49.625Z)\nWe actually don't even want to work on anytime soon. One day, one day when this comes up.\n\n[Heather Lother] (2025-10-28T15:57:53.828Z)\nBut, uh, I will say I am hearing from people that, um, XO admin being even mildly more mobile friendly would help them out a little bit in prepping for interviews, especially if they're running between things, um, because then they could, actually like look at a candidate on their way to their computer.\n\n[Dragos Nuta] (2025-10-28T15:58:14.052Z)\nYeah, that's what's new here is the in-person job to create the notion of commuting in the old days of remote recruiting.\n\n[Heather Lother] (2025-10-28T15:58:24.761Z)\nI know, I know.\n\n[Heather Lother] (2025-10-28T15:58:27.223Z)\nAnd when you don't get paid for work on the mobile, why would we make something mobile friendly? And yet we have teams who are now on the go constantly. And so that one request that I have heard.\n\n[Kevin Norchi] (2025-10-28T15:58:43.766Z)\nWas the spotlight to interview, wait, what is it? Spotlight to inbox with interview reminders, is that shift?\n\n[Heather Lother] (2025-10-28T15:58:55.714Z)\nYeah, I've got an idea on how to fix that. I'm working on. I'm working on.\n\n[Kevin Norchi] (2025-10-28T15:59:02.479Z)\nCan you send me an example just so I can see?\n\n[Heather Lother] (2025-10-28T15:59:05.180Z)\nOf what that looks like, Oh, yeah, absolutely.\n\n[Anirudh Bhardwaj] (2025-10-28T15:59:08.030Z)\nYeah, I think Heather received a couple of them.\n\n[Heather Lother] (2025-10-28T15:59:10.332Z)\nI have like 30 of them. Give me a minute.\n\n[Dragos Nuta] (2025-10-28T15:59:13.414Z)\nI'm trying to remember what it says so I can find one.\n\n[Dragos Nuta] (2025-10-28T15:59:16.276Z)\nInterview tomorrow. I've improved the subject.\n\n[Kevin Norchi] (2025-10-28T15:59:18.598Z)\nI'm writing the the October report and any sort of platform wins we have. I'm just writing.\n\n[Dragos Nuta] (2025-10-28T15:59:42.537Z)\nIt's basically in our class. Let me put some.\n\n[Kevin Norchi] (2025-10-28T15:59:52.500Z)\nIs that a win talking about the recall again? Is recall a win worth talking about or not?\n\n[Dragos Nuta] (2025-10-28T15:59:59.002Z)\nYes, because we have all in education. We have a lot of customers that don't have pre-DI, don't know how to set it up. A lot of content is used, is lost, yeah. Okay, aggregating. What's the thing that Heather, you might have wanted to talk about? My definition of done is done, whatever. My definition of next level of maturity is that there are one or two assessments that use that. And how far are we there?\n\n I think that Anirudh has been working with Tristan, right?\n\n[Anirudh Bhardwaj] (2025-10-28T16:00:35.297Z)\nYeah, so Tristan provided a few feedbacks last week, and especially on the financial deep dive assessment. So there was one finding where, ideally, because the prompts were not given, so we were going through the entire sheet as well. So thanks to that, our team has rolled out certain fixes now for the financial deep dive as well. For Tristan it is working fine as of today. He will be monitoring, he is right now manually grading it for all the assessments that he has under his pipeline and in I think couple of days will be good to go.\n\n But his feedback is positive so far and I discussed with him.\n\n[Dragos Nuta] (2025-10-28T16:01:14.560Z)\nOn financial deep dive?\n\n[Anirudh Bhardwaj] (2025-10-28T16:01:16.421Z)\nYeah, other, other, other pipeline, other assessments he had already migrated. Financial deep dive was a blocker for him because.\n\n[Dragos Nuta] (2025-10-28T16:01:24.543Z)\nWhat was it he migrated?\n\n[Kevin Norchi] (2025-10-28T16:01:27.901Z)\nThere are a few more like ITDs and the system BrainLift that Ben likes for academics.\n\n[Dragos Nuta] (2025-10-28T16:01:38.889Z)\nDo you guys feel like this is a sticky problem?\n\n[Kevin Norchi] (2025-10-28T16:01:46.894Z)\nNo, I don't understand. The detriment is we now have to go in and manually tell the, rewrite the rules. That they allocate points. We didn't used to have to do that. But the improvements aren't clear to us. Maybe there are improvements, but we're just not aware of what they are.\n\n[Heather Lother] (2025-10-28T16:02:07.716Z)\nYeah, I think for me, I understood the problem we were trying to solve. I'm just not clear about why. It feels like we took a that had been working for 80 to of 90 assessments and like decided that was trash started over. I don't think it was trash. I think it actually was working pretty well. So I'm just trying to figure out like from your perspectives like what are the big improvements that we should be looking for?\n\n Why is it worth my time to go open every single grading rule on every single AI graded assessment and tell it how to allocate points as opposed to just leaving it on the legacy mode and letting it score it the way it has been. What do you see as the big question?\n\n[Dragos Nuta] (2025-10-28T16:03:01.431Z)\nI will turn the question and say what are those assessments that you couldn't enable full grading on or even min-bar grading on? How many times you had that problem? That problem should not be there.\n\n[Heather Lother] (2025-10-28T16:03:13.015Z)\nJust the videos.\n\n[Heather Lother] (2025-10-28T16:03:15.136Z)\nYeah, it was primarily, for me, it was primarily the ones... Financial deep dive and strategic progress thinking were not working at all. Yeah, financial deep dive product thinking, the brain lift. Honestly, the brain lift assessment wasn't working at all.\n\n[Dragos Nuta] (2025-10-28T16:03:28.787Z)\nNo, plenty of them. I'm sure about that. I have a coordinator that's a badge.\n\n[Heather Lother] (2025-10-28T16:03:32.809Z)\nThat one I knew I was going to have to switch over. And then vendor categorization, which is a nightmare to grade. And I built a lovable app to do it because it actually needs like an answer key. I don't know if I can actually switch that because that one's a mess.\n\n[Dragos Nuta] (2025-10-28T16:03:47.277Z)\nIt's not LLM. It's more like, I don't know.\n\n[Heather Lother] (2025-10-28T16:03:50.628Z)\nHe's about to switch patterns again, which is kind of why I wanted to hear what the improvements were, because we have a request from Jamie to switch vendor categorization to use cloud code and to have candidates submit some sort of like repo. Let me go see how he framed it. Share a Google Drive that contains the working files from their cloud code project. And obviously, I was like, well, A, I want to know what your evaluation and you look at that, but B, I don't think we have any way of supporting grading that current link.\n\n\n\n[Dragos Nuta] (2025-10-28T16:04:30.077Z)\nNo, probably not. Well, GitHub, not Google Drive. I don't know if that's a problem or not, I guess. Yeah, I mean, I'd rather have GitHub. Because that's an oddball. We can talk about oddballs, but for now, let's talk about this one. Previous mechanism was basically the difference between using a model in one-shot mode versus in thinking mode. I think that's how we should think about the difference.\n\n Now, Artem packaged this instructional behavior in order to allow your rules when you define them to be like, oh, if this happens, send it to manual grading. If this happens, just reject. So there are some action items where you instruct the model what to do with it. Now, if we just want to rename or rename those, I'm sure we can put in the assessments. Am I in a rush to upgrade the old to the new one?\n\n I'll say that not, because I'm not in a rush now, but definitely long-term, we don't want to tolerate two models, two methods, and those who are probably using some old models and whatnot. But the overall thinking is that this is an agent, right? That now we'll think about it, and then we'll pull some more data and say, oh, there's a link. Let me follow the link and see what's there, or let me think about it some more.\n\n And whereas the other one was like, let's package a prompt around it and see what it does. And that's why this should enable grading for much more complicated RWAs that usually were, well, single prompt prone, issue prone.\n\n[Heather Lother] (2025-10-28T16:06:03.033Z)\nIs there any sort of context length limit that we should be aware of here? Because we do get some that are quite lengthy?\n\n[Dragos Nuta] (2025-10-28T16:06:11.732Z)\nThere is, there is. I don't know. I need to figure out the numbers. I'm sure that we use AWS Bedrock. I learned the hard way that Bedrock has lower limits. And we discussed that if the context is bigger than something, we'll just hit plot. I mean, like on topic directly as an API. So we'll be subject to those limits instead or something. I don't know. But I don't know if we implemented that, but that was my...\n\n\n\n[Anirudh Bhardwaj] (2025-10-28T16:06:32.338Z)\nWe have shifted to 4.5 beta on Bedrock.\n\n[Anirudh Bhardwaj] (2025-10-28T16:06:35.178Z)\nIt is 1 million All right, so that's probably better.\n\n[Heather Lother] (2025-10-28T16:06:42.030Z)\nI know that Claude has lower token limits than OpenAI does, generally, but...\n\n[Dragos Nuta] (2025-10-28T16:06:50.474Z)\nOkay, so this is the answer. Now...\n\n[Heather Lother] (2025-10-28T16:06:54.736Z)\nI just want us to get into a situation where we do all the switching and then all of a sudden get a bunch of error records and like clog up your AWS account and all of a sudden we've like broken Yeah, now the question, did you actually have to make it so hard to switch to it?\n\n[Dragos Nuta] (2025-10-28T16:07:12.495Z)\nI don't have a simple answer to that. I don't think so. But it might be a bit too late for that. I would just bite the bullet. There is another question that I wish that we have had a better answer. Instead of writing our agent, could we have just used Cloud Code to grade it? We didn't do it. We wrote our agent. I don't know. Some things you just have to deal with them as they are and then decide if you rewrite or redo or whatnot.\n\n I would keep it as it is. It's not the biggest problem. I would probably, I would say, move them gradually as you have a challenge with moving them to a fully aggregated because of the non-smartness of the old method. And once we're left with a bunch of them that are rarely used, I guess we can do a mass migration and, you know, it's basically rename rules so that they do that. Or whatever the migration is.\n\n You'll know what the migration path is and you can say, well, that's how it should be automated and to be like one time engineering one or something.\n\n[Heather Lother] (2025-10-28T16:08:04.933Z)\nYeah, I have a data pull request just because I don't have a good way to get this field exported on my end. Can we get a list of everything that use the two deprecated AI grading modes, the structured versus unstructured Google Doc, because those are now completely broken.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:08:24.485Z)\nWhy are they broken?\n\n[Heather Lother] (2025-10-28T16:08:26.105Z)\nBecause those are completely deprecated. That mode has to be switched to legacy or SM response. I'm getting errors messages on, I've gotten three RWAs that I've gone and changed in the last 48 hours.\n\n[Dragos Nuta] (2025-10-28T16:08:42.645Z)\nThis is terrible execution, right? So this is a lesson for us. Terrible execution. You can't pull the rug. And the same migration is easy, but we either do it and then, yeah, we do it forcefully or we don't do it and then we offer a migration path. I'm not blaming you because I know you just like inherited that very mess as well. And I'm not blaming the dead man, Artem, who moved to another team either.\n\n It is what it is. That's my fault because I was not deeply involved at the point in time. I think that it's... What's the change? The change is that when you're going on the application step on the grading mode, there's something else. So you can create a view very quickly.\n\n[Heather Lother] (2025-10-28T16:09:20.783Z)\nYeah, it should be ExoGradingMode. There are four options. There's AIGradingV2. That's the new version, legacy survey monkey response. That's what everything else should be. But then there's deprecated unstructured Google Doc and deprecated cable sections, Google Doc. Those were not auto updated to the working legacy SM response. So I just need to know which RWAs use that. We'll obviously prioritize the ones that are live over the ones that are not.\n\n I just cannot get that field to pull into report in my Salesforce. And I wasn't willing to spend more than about 30 minutes trying to figure it out. So, sorry.\n\n[Dragos Nuta] (2025-10-28T16:10:03.113Z)\nIt works with you for sure. And we can do that for you. We don't have to.\n\n[Heather Lother] (2025-10-28T16:10:07.956Z)\nI was like, you guys can probably grab that, that field much better than I can.\n\n[Anirudh Bhardwaj] (2025-10-28T16:10:12.379Z)\nI'll share it. Just give me a sec.\n\n[Heather Lother] (2025-10-28T16:10:16.061Z)\nThank you. I appreciate it. I just also know a lot of those have Crossover no reply as the and so literally no one will get the notices or the reminder emails or anything until we get pipeline throttles. And so I'd like to avoid that because that then makes us look really bad.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:10:33.897Z)\nOkay, this is the view, you should have access to this.\n\n[Heather Lother] (2025-10-28T16:10:40.878Z)\nOkay, great.\n\n[Dragos Nuta] (2025-10-28T16:10:43.499Z)\nSo application step, display name, assessment name I think is correct. Displaying is probably irrelevant. Pipelines is account. Provider shared grading method. Test duration is irrelevant. Grading duration is irrelevant. And I will just add ExoGradingMode here.\n\n[Anirudh Bhardwaj] (2025-10-28T16:11:21.553Z)\nLegacy SM is something which is not broken on Dragos, I think.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:11:24.876Z)\nRight, yeah.\n\n[Anirudh Bhardwaj] (2025-10-28T16:11:26.017Z)\nUnstructured and table doc. 31 rows should be there as per Athena, I think.\n\n[Dragos Nuta] (2025-10-28T16:11:30.821Z)\nYeah, no, this should be like all automatically update. I don't know if it can help with that. Like you can just switch them to whatever is the standard.\n\n[Heather Lother] (2025-10-28T16:11:37.387Z)\nYeah, if they just go to legacy, then they work and we can update them on our own time. But like right marketing content, big deal if that one stops working.\n\n[Dragos Nuta] (2025-10-28T16:11:50.068Z)\nCan you update the database directly?\n\n[Anirudh Bhardwaj] (2025-10-28T16:11:53.669Z)\nI don't have access to update. I'll get it updated.\n\n[Dragos Nuta] (2025-10-28T16:11:57.891Z)\nLet's shut off this call. Let's see. As we are a bit running out of time. I think it's a win in a sense. I mean, like my goal was to try to I would not only think about it as I wanted the new assessments to be unlocked. It seems like we are there and keep the feedback coming, but I'll consider this is like in idle mode. We are cruising, operating on feedback, but it's done.\n\n[Anirudh Bhardwaj] (2025-10-28T16:12:28.712Z)\nOne more thing on the AI grading mode. So one is obviously that we have shifted toward a newer way of grading, but should we also change the way we used to do in the legacy SurveyMonkey mode, basically, should it be more like the grading should be driven by a brain lift? So what I think Heather and Kevin were also confused that they have to write the entire rule set again and do those scoring. So do we require that detailed level of scoring or should it be simpler?\n\n\n\n[Dragos Nuta] (2025-10-28T16:12:57.283Z)\nSo that's another thing that is like it's done. But I do have a point of view on that. I remember talking to Artem about that. I was not in the office, not the best time for me to talk, discussed about him taking if you took the decision, but there are benefits to modeling grading rules. Remember when you guys told me, can I get a report on BFQ matching interviews on field requirements? I was like, you can't.\n\n It's from the R2. I don't know when it changed. Everything is dynamic. The answer is the same. I think that by not using a brainwave and forcing you to write rules, now we have a data model. You can take a single rule. You can see how many people failed tasks. So it gives you that observability, analytics and whatnot. If you just feed a big data and we just operate on the brain lift, so everything will become more opaque.\n\n I don't think that that's the biggest problem. Right now, one, you have the brain lift mechanism because you can put it on application step level, the brain lift, but you'll have to model rules individually. It's a bit of an overkill, I don't know, maybe, but I somehow think that the benefits of then having rules, history, in the data model, you can see there's the same rule. Of course, you may have changed over the time and that's your choice to refine it or improve it, but you can take a rule and That's the improvement.\n\n That's how it varied over time. I think that's a powerful benefit of not having a big single prompt brain lift. So in a way, I would have preferred to have a brain lift, but this also has its own benefits. It was one of the ITD options. It's not fundamentally, it's more like a preference one. I don't necessarily think we made the wrong decision because of these benefits. Make sense?\n\n[Dragos Nuta] (2025-10-28T16:14:30.598Z)\nGot it.\n\n[Dragos Nuta] (2025-10-28T16:14:33.240Z)\nVideo grading for engaging story. We're going a bit in circles here. Is there a freaking SME? It's not helpful when I hear Tristan saying he's not an SME. But then again, I also know that Tristan is not an SME. And when I hear like, oh, education things that they are not correctly graded. If they're not correctly graded, then you don't have a good test data set. You can't tell if what you're automating is good or not.\n\n Path, rent and what I'm suggesting. It's like two paths. First of all, we either consider that Himanshi is decent enough at grading. I don't say pass him 100%, but assume that he's 90% there and we have a path that we are taking on that. Or the other path, no, we actually think it's a bit of a hit and miss. So somebody will now have to grade 50 assessments so we can regrade 50 assessments so we can but we can go to the best bets right at this time.\n\n\n\n[Heather Lother] (2025-10-28T16:15:28.189Z)\nYeah, so I literally just messaged with Tristan about this maybe like an hour ago. I said, look, like fundamentally, I agree the hiring bar is on the hiring team. That's their responsibility. However, he is getting absolutely zero response out of them. They don't seem to have any appetite toward even contributing toward the discussion. And so I told him he needs to become the SME. So that means he needs to go review the videos.\n\n He needs to go look at who gets hired and who doesn't. He needs to go Read the onsite interview and the remote interview feedback and flag where someone should have failed. And he needs to develop a quality bar and become the SME so that he can- Okay, let's reshuffle that ask.\n\n[Dragos Nuta] (2025-10-28T16:16:18.037Z)\nHave him pick 50 submissions that have a good coverage, Basically, they are not one of a single kind. And we grade them all and explain his new rule and explain his new outcome. And we'll now have to test data sets. One is what he much usually did and not only this one. We have a mechanism to run the system and figure out what's the correlation of the grading results and whatnot. And we'll take it from there.\n\n We'll just have to test data sets. That is a viable option too. Now, I do believe that once, by the way, what I asked Arius to focus on is not to create a full grading assessment, but to create a min-bar assessment. And the message for Ben will be, with the amount of level, with the amount of information you have made available for us, we can offload 30% of the grading. 30% is a fictional number, obviously.\n\n If you work with us, hone and improve those ratings, rubrics, then, yeah, it can become 100% or 50% or whatever it is. Today, we only reject what's clearly a bad submission. And that, I think, should be very motivating for him. But it can start with give me inputs and then I'll work on it. It needs to start with the inputs I got. You're like through. Now, it's your goal. Don't block yourself. Not my goal.\n\n I don't mind playing two strategies, like hedging. I'm saying three some does see parallel and we take it from there.\n\n[Heather Lother] (2025-10-28T16:17:48.049Z)\nI think I Agree that's actually almost verbatim what I had told him because I'm not letting Ben off the hook on this But at the same time, I think we have to recognize that There is somewhat an expectation that Crossover should at least be able to identify Reasonably decent submission and only pass those on and should filter out the obviously poor ones.\n\n[Dragos Nuta] (2025-10-28T16:18:19.225Z)\nWe cannot not be able to do minbar, ever, right? Pool grading, I don't know, that's a story. Okay, screening interviews, like on-site interviews and whatnot. The reason I prioritize that, I don't know if you guys know, because it might come through as awkward, is because with Artem leaving and Erezgar taking the official place of engineering lead, I wanted him to get His hands super dirty on something super messy in Salesforce and flows everything else that's there We'll be done by the end of the week So by the end of the week, we'll have this new stage and everything we talked about and offer will be after fraud check and whatnot Give or take maybe it's early next week.\n\n It's a it's a hairy animal for sure Um give or take so that's that's the thing What is the rollout plan for that? It should require The I think it will only require I think we didn't get there it will only require manual work for candidates that are in the fraud check state, because... No, that are in the offer stage. Only that fraud check and offer, because they will have to be manually taken to the...\n\n Yeah, yeah. You're right.\n\n[Heather Lother] (2025-10-28T16:19:28.497Z)\nBut it will be automatically updated for all pipelines regardless of status?\n\n[Dragos Nuta] (2025-10-28T16:19:35.021Z)\nIt's in one single flow for everybody. We must be sure and able to deploy it in one go, not partially.\n\n[Anirudh Bhardwaj] (2025-10-28T16:19:43.578Z)\nYes, that has to be done. Deployment will go in one go. Dragos, but only thing for tech pipelines, final interview step will not be mapped because there is no final assessment.\n\n[Dragos Nuta] (2025-10-28T16:19:55.388Z)\nNo steps will have that. When you roll it out, nothing happens. Then like Heather, Tristan, Andrew will map one, figure out how it works, map the second and whatnot. Yeah, sure.\n\n[Heather Lother] (2025-10-28T16:20:06.480Z)\nBefore it rolls out, I would like to make sure we have a written documentation process of what org builders need to do. And we're going to need to communicate this to hiring managers. Because it does change what happens when they click the Send Offer button. And most of them are used to waiting until they get the, they've passed CCAT, and then they go file an IT onboarding ticket, it's going to change that behavior as well.\n\n They'll need to wait until they get the, hey, they've accepted the offer email to file the IT onboarding ticket. It's a minor change, and I think we obviously present it as an improvement and a streamline in a way that we're meeting customer requests, but I don't want to blindside hiring managers with a change the process after the effort we've put in to educate them on the way the process flows.\n\n[Dragos Nuta] (2025-10-28T16:21:07.360Z)\nI wouldn't have thought about mentioning this, to be honest.\n\n[Heather Lother] (2025-10-28T16:21:10.522Z)\nYeah, we'll also need to get Isabel to update the playbook, the hiring manager playbook as well.\n\n[Dragos Nuta] (2025-10-28T16:21:17.286Z)\nThat long one that nobody reads?\n\n[Heather Lother] (2025-10-28T16:21:19.407Z)\nThe long one that we send to everybody, yes.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:21:22.529Z)\nI wonder if another link can make it shorter.\n\n[Heather Lother] (2025-10-28T16:21:24.871Z)\nYes, it can. And we should be using things like guide to create multimodal versions of it, but I just haven't gotten there yet. Andrew and I talked about it the other day.\n\n[Dragos Nuta] (2025-10-28T16:21:36.805Z)\nLet's see.\n\n[Kevin Norchi] (2025-10-28T16:21:37.945Z)\nUm, what's um, what's org builder audit unless you still want to talk about this?\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:21:45.489Z)\nOrg builder audit.\n\n[Anirudh Bhardwaj] (2025-10-28T16:21:47.609Z)\nThis is the API plus brain lift thing drivers.\n\n[Heather Lother] (2025-10-28T16:21:54.225Z)\nIs that us doing an audit?\n\n[Dragos Nuta] (2025-10-28T16:21:58.727Z)\nToday, you can do your analysis solely based on analytical data. And we talked about being able to get application-level information, so the use cases that you can audit anything. Once you can do it manually, we'll do the runs once per week and send you an email or whatever makes you guys happy in Rich. Now, Anirudh already defined those APIs that will be able to include. I don't know, probably mid-next week.\n\n Did we miss the week already by saying mid-next week? I think we might have, right? Move them accordingly. Or we should discuss and move them accordingly. So this is, for me, very important, because once we do that, it unlocks a lot of use cases. And then you go into the, let's create a hiring manager summary. We can do all of that, because the LLM that you guys control with your own brain lift as I've stored the data.\n\n We'll add a field called pipeline manager notes on a pipeline where you can add your own structured notes on whatever date I changed this, my feedback is, but this is the pipeline where, you know, whatever that always happens, right? Let's see. What else? I think that's all. I think that JD Variation notes, we got your inputs from you. I don't know if you want to share the prompts with Heather and Kevin in that document I shared with you.\n\n So that's JD Variations that make you guys mad.\n\n[Anirudh Bhardwaj] (2025-10-28T16:23:32.749Z)\nAnd the current one I have, I haven't improved them, Dragos. I'll do that tomorrow. I've kept it for tomorrow.\n\n[Dragos Nuta] (2025-10-28T16:23:40.073Z)\nYeah, I don't know. I think that's all. Some things shift because, for example, the on-site interview thing was way harder than initially assumed by engineering. So some things will slip. I'll update the Weekly plan. I actually want that Weekly plan to reflect our best at the Weekly plan for priorities one through three. I didn't get to four and five. That's kind of useless work until. And we'll have to also, this is living.\n\n Maybe some goals require other actions, as we understand them. But as I'm thinking about through the actions and the impact, numbering them and pulling them below. Nothing else from me, I think, but I would like to hear your other big issues, items.\n\n[Heather Lother] (2025-10-28T16:24:29.599Z)\nI have a fix in mind that I am working on for candidate spotlight, but will also obviously impact the emails based on the feedback we've gotten. I just want to confirm that spotlight in 360 and the email being sent are both functioning off the same base brain lift before I go making any changes?\n\n[Kevin Norchi] (2025-10-28T16:24:51.420Z)\nYeah, what change are you thinking?\n\n[Heather Lother] (2025-10-28T16:24:54.262Z)\nWell, one, shorten it. Two, you know, sort of the structure that I've been using with DR and Joe and a couple of others that seems to be getting good feedback is, like a 60 second candidate summary, followed by a couple of bullet points on why you should be excited to talk to this candidate, and a couple of bullet points on what you still need to pressure test them on. And my question that I have is, one, does Candidate Spotlight have access to the interview notes from a first or second round interview if we're sending it to a third round interviewer?\n\n\n\n[Dragos Nuta] (2025-10-28T16:25:42.139Z)\nLook in the document. I'm highlighting a bullet. That one needs to be moved to the proper place. Today's spotlight is also behaving just like the old grading rubric in the single shot mode. We'll have to make it agent and give it a bit more information in order to apply that change. Now, I'm not sure if you want to wait or create a version that doesn't include that.\n\n[Heather Lother] (2025-10-28T16:26:03.905Z)\nNo, I'll create a version that doesn't include that. Yeah, I'll create a midpoint, but I'll also work on a final. That way, we're not blocked on anything, and we'll get better emails out next week.\n\n[Dragos Nuta] (2025-10-28T16:26:15.377Z)\nAnd I don't know whether they import the priority of getting Spotlight to include this interview summary. Interviews, basically, it's something like a week to November, or we should aim for it earlier.\n\n[Heather Lother] (2025-10-28T16:26:28.179Z)\nI'd love to have it in November before Thanksgiving. It doesn't have to be a next week thing. Love to see it in the next three. And here's what I would do with that, just so that you know. When you send someone to a second or third round interview, they should get a what you don't have to cover summary that outlines what the previous interviewer already talked about. The number of interviews I see waste 10 minutes out of a 30 minute interview covering the same logistics the same company structure, the same reporting structure that's already been covered three times is insane because people don't know that it's already been talked about.\n\n Now, you can argue that's a communication issue, but I think we just solved it systemically on our end. And then the second piece is, it obviously is gonna dynamically update that what do you still need to test piece for the next interviewer. So it's gonna have that context and that knowledge pair back against the, right now it's using the JD, not the BFQs, which I think is good.\n\n[Dragos Nuta] (2025-10-28T16:27:41.451Z)\nYou know what I think, Arius, that we can do an interim version that has summaries and uses the big context and to the agent one week later and improve quality, because that's what happens when you have the agent, the quality improves. So I think maybe we should do that. Like basically next week, there's a simple win in moving to a better LLM with more context. We interview someone, we revise what we fit.\n\n By the way, Heather, there's also this context of what context goes in. There's the active application context and there's the ambiental context, because you've taken other things as well, so there are other signals as well, and that's modeled in the prompt. I think you should know what is in the prompt, I mean, what context is provided. Let's unearth it, Anirudh.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:28:23.871Z)\nYeah, that would be really helpful.\n\n[Dragos Nuta] (2025-10-28T16:28:25.953Z)\nBut there are some concepts. For example, as I said, I don't know if was basically application context versus a broader context. That's important because you'll want your brain to talk about the two distinctly and say, well, I don't know.\n\n[Heather Lother] (2025-10-28T16:28:40.238Z)\nIt would also be helpful for me to know if it is actually looking at the submissions. Does it look at the doc or whatever that's being submitted or is it purely looking at the scores?\n\n[Heather Lother] (2025-10-28T16:28:52.501Z)\nOf course.\n\n[Dragos Nuta] (2025-10-28T16:28:56.494Z)\nGrading does grading. Maybe that's a unique opportunity to have grading return.\n\n[Heather Lother] (2025-10-28T16:29:02.518Z)\nBecause if we're going to use the AI grading, we actually get really good granular comments on each of the criteria.\n\n[Dragos Nuta] (2025-10-28T16:29:09.223Z)\nWe already get them unlocked, I don't remember.\n\n[Heather Lother] (2025-10-28T16:29:11.645Z)\nYeah, they're logged in the AI grading. Like if you go look at something that's been graded by AI, even the old version, and you click in on a single rule, you get not only that feedback, but remember it was, we put it hey, give feedback to the candidate about the quality of this and what they could have done to improve it, to fully meet the grading criteria. We never showed that to candidates, obviously, but...\n\n\n\n[Dragos Nuta] (2025-10-28T16:29:36.278Z)\nYeah. Let's put that into the context. Let me put here some plus grading details, not just scores. I'm reluctant to pull their submissions and GDocs. It will be a huge mess. It gets huge.\n\n[Heather Lother] (2025-10-28T16:29:53.273Z)\nYeah, no, from doing this with ops, it gets huge. But if we can pull the grading comments, that's a pretty lightweight addition.\n\n[Dragos Nuta] (2025-10-28T16:30:03.842Z)\nGrading comments, or if you're using manual grading, these are the comments you've added yourself, at least in the actual comments. That also will be a good incentive for whomever wants to do it manually, to put details, because they'll get good details, good samples. I like that. I like this reordering. Intuitively, that's the plan, probably. And we are packed up until week three of November and have plenty of capacity, probably.\n\n That's my hope, at least.\n\n[Anirudh Bhardwaj] (2025-10-28T16:30:34.844Z)\nRight now, we provide job description, candidate background, job application context. I'll have to check what it is. But we don't provide the grading notes and everything. Yeah, I guess it is because of the token limitation with you.\n\n[Dragos Nuta] (2025-10-28T16:30:51.665Z)\nYeah, it gets big fast.\n\n[Dragos Nuta] (2025-10-28T16:30:53.606Z)\nWe can use the other model. Let's have a conversation, the two of us on what should be included. Let's revisit the initial task. From that, we share with the team.\n\n[Heather Lother] (2025-10-28T16:31:03.410Z)\nAnd if you guys want to sit and talk through what I'm doing for Ops, because I'm having to do it kind of off platform because of the size of the context and the complexity, we can talk through that because that might give you some ideas for like, what and I'm trying to write all that down into the the candidate spotlight piece because honestly that's ultimately what I'm creating but um some of it doesn't fit super neatly into that context so um I'm always happy to kind of talk through what I'm doing and and why but I really am trying to get all that in writing so we don't have to have a conversation yeah we can discuss yeah I mean I like you guys but like nobody needs more meetings And it all has to be written down eventually anyway, right?\n\n\n\n[Dragos Nuta] (2025-10-28T16:31:48.563Z)\nYeah, as you wish. I'm fine. As you guys wish. I'm not going to attend, but...\n\n[Anirudh Bhardwaj] (2025-10-28T16:31:53.004Z)\nYeah, I'll let you. Dragos, one more thing. And guys, since we're talking about the spotlight profiles, a couple of feedback said it should be crisp, small. I don't know what the hiring manager wants.\n\n[Heather Lother] (2025-10-28T16:32:06.510Z)\nYeah, I'm working on that. Don't worry about it. I know what they mean.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:32:12.092Z)\nGot it.\n\n[Heather Lother] (2025-10-28T16:32:13.249Z)\nI know what they mean. It's a wall of text.\n\n[Dragos Nuta] (2025-10-28T16:32:19.772Z)\nWe'll also have to, that's going to be the engineering job, to segment the outputs. Because for example, the requirements mapping is useful for many roles, but today it's in the wall of text. So maybe if we do it in a different way visually, it won't feel so overwhelming. I mean, like the summary can be shortened, but then again, the requirements mapping is the requirements mapping. You need to Read it.\n\n Or if it's not well-designed, if it's just part of the HTML that's output, then it might not be good. But let's take that. That's a second.\n\n[Heather Lother] (2025-10-28T16:32:48.993Z)\nYeah, I have some thoughts about that that I'll put down, too, that you can use or not. I don't care. I'm not attached to that.\n\n[Dragos Nuta] (2025-10-28T16:32:57.699Z)\nWell, I think the important question is, what's the output that you need to send to a hiring manager? I think it's like an executive summary. I think it's the requirements mapping. I think it's, to your point, things covered in previous interviews and summaries of each interview. Like, John interview that then said yes, no, I don't know, Mary interview and said whatever. And maybe interview questions.\n\n But these are the five big things that should come out of a spotlight. Who uses them? I don't know. We need to figure out how to handle them.\n\n[Heather Lother] (2025-10-28T16:33:28.684Z)\nYeah, to me, visually, it should be almost like expandable sections that you can dig into if you care about that, and you can skip if you don't, other than the 60-second summary. Because we have some interviewers who want interview questions and a lot who don't so yeah Compress it for those who don't care.\n\n[Dragos Nuta] (2025-10-28T16:33:46.223Z)\nThat's that's Here is keeping them collapsed but sorting them in the sorting in the browser. What was their last preference? You don't have to do it in the product email cookies. It's a lot sure take you from scratch. I don't give a shit I don't want to add the complex, but starting the browser as long as you keep using the same browser, it will always have the same layout That could be a good take.\n\n\n\n[Heather Lother] (2025-10-28T16:34:08.565Z)\nMaybe ignore the first email because you know they're going to expand everything the first time because people are naturally curious.\n\n[Dragos Nuta] (2025-10-28T16:34:15.089Z)\nBecause they'll collapse it then. Then it'll stick to the new setup. So it essentially sticks to the latest setup and some things cannot be removed such as...\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:34:22.673Z)\nThat's even better.\n\n[Dragos Nuta] (2025-10-28T16:34:25.075Z)\nI'm a bit late for another call.\n\n[Heather Lother] (2025-10-28T16:34:28.937Z)\nAll right. We've run over.\n\n[Dragos Nuta] (2025-10-28T16:34:32.179Z)\nIt was a good one. Thank you.\n\n[Dragos Nuta] (2025-10-28T16:34:33.640Z)\nThank you."}