{"transcript":"# Spredfast->K1 Q4 goals\n\n## Topics\n- Migration strategy from Spredfast to K1 platform.\n- Importance of customer alignment in project execution.\n- Customer feedback and requirements for analytics features.\n- Performance evaluation of existing widgets on the K1 Publisher.\n\n## Transcript\n\n[Pablo Fernandez] (2025-10-29T12:31:17.214Z)\nWell, first, nice to meet you. We have a full house on such a short notice. Thanks a lot. So maybe before we start, because I haven't really spoken to any of you guys, it would be good that we maybe introduce ourselves. I can start with me. She's not very polite, but I'll do it. So, I'm Pablo, the TPM on course on the central side. So, I was leading the import process that finished last month. And, yeah, we have been working in the past with Thibault and with Velanki, basically, on the scope for Q4, on the best trying that we have across products on that scope.\n\n And yeah, I'm focusing still on the entire project, but also working more specifically on the K1 products, meaning Care, Spredfast, and the transition from Spredfast and Flow AI, and Brand Messenger, and all the things that are not communities, basically. And yeah, the specific topic for today they see in that scope, so this is why we're discussing. So maybe, I don't know, Vargos or the other one on the central side, we can go next and then we'll go to the guys.\n\n\n\n[Dragos Nuta] (2025-10-29T12:32:53.539Z)\nYeah, hi guys. Also in TPM, getting the function, right? It's not as deep as Pablo or you guys, but definitely want to make sure we drive on the right things. All efforts or investment from the BU side.\n\n[Pablo Fernandez] (2025-10-29T12:33:12.065Z)\nWho's next?\n\n[Douglas Ho] (2025-10-29T12:33:16.949Z)\nIt's the fifth person. It's always the fifth person. Hi, I'm Douglas. I'm the VP of AI. So I'm looking at now at some of the chorus works in them specifically on the We have a product called Iris just focused on providing X connection to the customer as a prototype. And on top of that, I'm working on Eloquence AI as well as the main AI applications. So those are the two key focus that I'm working on.\n\n\n\n[Seshi Paturi] (2025-10-29T12:34:00.150Z)\nI'll go next. So I'm based in Dubai. I was actually with Trilogy for the last 1.5 years, recently moved to Ignite Tech. At Trilogy, I was working on the 2R learning initiative, like doing a lot of apps, learning apps for alpha school ecosystem. And now I'm working with Douglas on the K1 side as my first project. Hey, this is Seshi. So I joined Ignite Tech around three months ago. I used to work with Thibault, now with Stuart.\n\n So last 25 years, I've been in IT industry. So I'm involved in major digital transformation projects across globe. I'm good at troubleshooting, tuning, POCs, innovation, and emerging technologies. So I'm here as a super builder. They brought me, especially in AI. And so that is from my side. Yeah, I'm a hands-on guy.\n\n[Pablo Fernandez] (2025-10-29T12:35:10.683Z)\nSo Seshi, you work now with Douglas as a super builder. Shivam and Douglas, you guys are basically working with Josephine or on the engineering side or what's the... I don't understand what...\n\n[Seshi Paturi] (2025-10-29T12:35:26.239Z)\nOkay, just a clarification. So I used to work with Thibault in the past. Now I'm looking after the enterprise architecture, especially in the AI side, adopting AI for some of the projects. So initially I started focusing on the Khoros Care, the AI Care expert for Khoros. So we built a, I built a quick POC, demonstrated it. And that was like in the last two months, I've been focusing on that. So I report to Stuart actually.\n\n\n\n[Douglas Ho] (2025-10-29T12:36:06.101Z)\nSo for myself and Shem, so basically, as you know, we had X discontinuation. So our first initiative that we have was to make sure that we have a kind of a parallel, just a mini app that can run on X and try to mimic as much as possible what we have in Care and spread across our SMM or publisher, right? So that's what we did. That rolled into, what happened is, you know, as we get into meetings, customer says, can you have this?\n\n Can you have that? Et cetera, et cetera. So right now we're focusing on just building it as much as possible with X connection so that, you know, customer could be at least able to be open to use it as a parallel app to Khoros K and as a parallel app to whatever we have in Khoros in regards to X, right? In that sense.\n\n[Dragos Nuta] (2025-10-29T12:36:58.175Z)\nSo if you want some data to us, because otherwise you'd be in the same problem, in the same situation. It's not like on-prem or a customer using it.\n\n[Douglas Ho] (2025-10-29T12:37:06.281Z)\nYeah, so we just built it on Vercel, but of course we have it as a, it can be a docker, it can be an app, it can be a desktop or we also deploy version AWS just to cover all the situation the customer might want to use it. And at this moment we're just thinking in okay you want this, you want analytics, we just bring it in because it's a very lightweight app and we're just doing that at the moment with regards to Iris as a mini app for X.\n\n\n\n[Pablo Fernandez] (2025-10-29T12:37:33.516Z)\nI think it makes a lot of sense by the way to have a mini app and then you know basically have this run on customers I think we briefly discussed this in the document we created. There should be integration with existing infrastructure, avoiding all the Twitter IDs and stuff.\n\n[Douglas Ho] (2025-10-29T12:37:53.239Z)\nAnd then even going now, can you integrate with Flow? Can we integrate that? So we're looking at those. We're looking at Flow APIs. OK, fine. Let's just build it for the sake of building it for now and just see how far we can push it with just a modern stack. So that's one half of my And Shivam is one of our AI engineers helping us on driving those.\n\n[Pablo Fernandez] (2025-10-29T12:38:19.380Z)\nThanks for the context. Now diving into today's topic. So maybe first, thanks for getting into the document and the feedback. I think I saw a lot of things that make sense. Let's have a way to basically reach a situation where we understand how we get to a scope for the work of this quadrant, right? I can explain what we've done so far, but I need to understand who's going to basically be responsible to set up that scope, and then we can just start to execute.\n\n 29th of October, so we really need that very badly at this stage. So the situation we're in is that in the past, basically Thibault gave us broad strokes, saying we need to do Spredfast to K1 migration, not talking about analytics, right? K1 to Spredfast migration, get rid of Spredfast. And the way to do that is the K1 publisher. And we have one customer that is kind of an ambassador to K1 and has been using it, which is General Motors.\n\n Let's make them happy this quarter so that we can use that with other customers to basically tell them that GM is happy, other customers can be. So those are the broad strokes. He gave us a few examples and guidance on what needs to happen, including analytics for K1 Publisher and other things like Opal integration, and then a list of one-liners of a few things that basically likely GM mentioned in a call.\n\n I'm not even 100% sure, but we have a list of other So the situation is the following. Analytics is too broad to basically start saying, hey, we're going to build analytics. So this is the document that you have. And another thing that we've been doing is that part of those one-liners that were in that list, well, we started working on this in Q4 because we didn't have enough scope and commitment and agreement basically on the goals to basically start working on analytics.\n\n So we've been doing you know, like what I call low hanging fruits, like better Instagram publishing, supporting other image ratios, links in bio, which is a feature that is spread fast and that GM mentioned. So we are doing all those things while we wait for an actual scope for analytics migration. So at some point, the team is going to stop working on LinkedIn bio because they'll finish. So we badly need to get the scope for analytics to be decided.\n\n In order to do that, there are many ways to do this, and there is the right way. And I think we, from the document that I Read that you guys did also, we all agree that the way to basically do the right thing is to talk to the customer, or at least understand what is important to the customer. And from there, basically build a roadmap and start executing it. I don't have access to the customer myself, so what I did is take their existing dashboards in Spredfast, their account in K1, the code, and what I think may be important for a customer with that profile, and came with a proposal that is the document that you've seen there.\n\n You've seen that in the last couple of days, I guess, and provided some feedback. Now, I need to understand if your reply is a request of a scope, like this is what you guys want, or if it's a proposal, or how do we reach the state where I can ask the engineers in Central saying, hey, this is the goal for Q4, and we need to do that, that, and that, and this is going to be Q1, but we need to have this situation.\n\n So who is going to do that?\n\n[Douglas Ho] (2025-10-29T12:42:23.198Z)\nI will discuss with Tim on this one. To collect it as a requirement rather than giving you different opinions on this. So I will be responsible to collect input from Shivam, Seshi, and myself to be collapsed as one requirement. But I think in the meantime, I have an opinion, and maybe you can feedback on that. If I see the analytics to the final version that we have, I think we all would agree that we don't want a thick widget solution.\n\n We just build widgets.\n\n[Pablo Fernandez] (2025-10-29T12:42:53.663Z)\nThat's already the case, right? But what I did in the scope there, there is a framework to basically create widget in a generic way.\n\n[UNKNOWN_SPEAKER] (2025-10-29T12:43:02.530Z)\nI completely agree.\n\n[Pablo Fernandez] (2025-10-29T12:43:03.731Z)\nBut the scope that I put there is saying, OK, if we take this framework and we extend it, those are the three widgets that would be useful to our customer. It can be any other. We're not going to program widgets. There is already a system in K1 Analytics v2 to basically I generate new widgets by different dimensions like time or regroup stuff. So this framework exists, but those were three, I would say, results of using this framework that could add value to a customer.\n\n Indeed, we're not going to build individual widgets.\n\n[Dragos Nuta] (2025-10-29T12:43:40.121Z)\nI would not focus on that as being the implementation. Even the conversation of do you do a connector first or implement the features, I don't know if anybody because GM is not using the animal. How do you even entice them to use something if it's not doing that? This is a conversation of chicken versus chicken. So I think the important part is that we understand somehow, we figure out with BU, and usually, by the way, as some background, in general, the best way to get results with Central, actually, the best way to get results in any project to do it with customer alignment.\n\n Customer alignment doesn't really work because, I don't know why, I think that BOS usually finds it a bit hard to connect us for whatever reason. So either we create an alignment or somebody else takes over and creates that alignment and then we work on the scope. I'm not trying to rule out one or the other. I think that the axioms are we all want to make sure we're working The hypothesis that came from 3Bolt was that that something is one is K1 and two is GM.\n\n\n\n[Douglas Ho] (2025-10-29T12:44:53.344Z)\nYep, definitely. K1 and GM is definitely the key priorities. What I'm alluding to is I know if we have the widget in place then I'm going to go to a thing that while waiting what is going on the background is do we already have a means? Just like what Sharon said, we should be doing migration first. When we migrate, it's not about migrating the DD, right? But do we have a means, say for example, we have, okay, suddenly I come back with this is the 10 matrix that the customer wants, or 10 counters, right?\n\n Can we have in place, if today I give you 10 and tomorrow I give you 20, it's not about recoding, it's already you have a migration path, as in these are 10 matrix today, tomorrow I integrate another 20 matrix, you already have a path that today 10, tomorrow 20, just a plug and play, and just key in, and then we know that these are the matrix we will create. I know that Seshi highlighted there's 200, I don't want to jump to 200 because we don't want to import things that's not working, incur unnecessary load on K1 just to calculate those matrix that we don't need.\n\n Because any in-matrix event that's adding loading because you have pre-calculation and pre-aggregation on that part. That's my assumption, right? The more matrix you add, there's more things you put on the background to run to pre-calculate the...\n\n[Dragos Nuta] (2025-10-29T12:46:02.528Z)\nWe don't even know if they use them or if they are set up inertially or I don't know.\n\n[Pablo Fernandez] (2025-10-29T12:46:09.172Z)\nI'm a bit concerned that we talk about migration scripts without even having validated that the product is of use for anybody. So I would first start on the value before, because they could even start, you know, from scratch. The value of a post in analytics is probably a couple of weeks, right? I don't think people look at six months back. I totally agree.\n\n[Douglas Ho] (2025-10-29T12:46:31.718Z)\nI think, okay, so we're looking at publishing matrix. Let's just say, talk about publishing matrix, not the chem matrix. I totally agree. I think in one of the research that we have, like you said, people would like to only look at the matrix on the last one month, and then you don't really need to look at something that's far beyond that. I totally agree. That's why you're saying that we don't need really a migration path on that.\n\n\n\n[Pablo Fernandez] (2025-10-29T12:46:56.213Z)\nI don't know. This is a hypothesis.\n\n[Douglas Ho] (2025-10-29T12:46:59.554Z)\nBut having said that, there's still matrix that people want. How many posts over the last, that the company has done over the last year or so, right? How many agent posts? Posted all the things. Not so much on the post values itself, but also the trend of the internal one, how many posts they created, which agent created how much, what's the effort, etc. Those are the ones, again, these are hypotheses.\n\n So metrics actually split into two. The application metrics, which is the works flows that go through the application, which is creating posts is easy, and the social channel metrics themselves. So there's actually two, right? I totally agree on that. So I totally agree, we need to look at, validation with the customer. But my thought is, do we know that if we say that this is the time matrix, I mean, this is more of an understanding of the code itself, right?\n\n If you say this is a time matrix, you're going to say, OK, this is very straightforward. It's just shipping it, and just creating the tables, and just duplicating the code, and that's it, right? Or there's more to that. I think that's more on a thought that's on the back of my head. If we say time matrix today, by the last one, another 20 matrix, Is it easy to create those metrics and aggregate them as a trial rank?\n\n It's more on that.\n\n[Dragos Nuta] (2025-10-29T12:48:10.160Z)\nSo you're thinking that the long pole of adoption might have to do with the metrics that are missing. That's your hypothesis. Which might be true, might be not. We don't know. I don't know. I don't think I have. Actually, I'd like to emphasize that it seems like in reality, as much as it sucks, none of us has customer impact.\n\n[Douglas Ho] (2025-10-29T12:48:29.810Z)\nAnd I just want us to face reality because I think reality right okay I I can't say for publisher because I have not okay this is my own interaction with customers right my interaction with customer is uh has been always on the Care side right not publisher this is my notice this is my but they always come and the thing they always ask is iris is do you have analytics that's always the one question every meeting they come in do you have analytics number two can you only can I access the analytics through the api because they are then their premise is I want to connect to your APIs to explore out so I can create management reports or executive reports.\n\n That is the common name.\n\n[Dragos Nuta] (2025-10-29T12:49:06.169Z)\nSo basically their theme is please aggregate data from social networks because I want to play with them in my own ways.\n\n[Douglas Ho] (2025-10-29T12:49:13.112Z)\nThis is for Care. I haven't reached anything because we always talk about, we always showcase, uh, the Iris part of Care. They took a look at marketing, the SNM publisher part of it, but they're not so focused on that. They're always been focused. How do my agent take Care of, because that's a primary They have no option, right? Publisher, they can still go and I go and create a post and EZT, I cannot see, I can still go to that post and see the matrix manually, right?\n\n But for replying, they can't go and share the connection to everyone and say, you know, agent, please reply to this DM, reply to social DM and post and mention things like that. So that's why my hypothesis is why they are so focused on Care is because that is the immediate need. But having heard that immediate need, they always say, I want to look at analytics. How is your analytics? Have you fulfilled the analytics that we had in Corescale?\n\n That's always a question. So if I believe that it's true, they will also want the analytics in Publisher as well. But what? I don't know. What's the smart approach here?\n\n[Dragos Nuta] (2025-10-29T12:50:13.677Z)\nGo to GM or, I don't know, probe with more customers? What will help the business? I'm trying to see what happens tonight. Maybe not even GM. They don't want to help Ignite.\n\n[UNKNOWN_SPEAKER] (2025-10-29T12:50:23.991Z)\nYeah, yeah.\n\n[Seshi Paturi] (2025-10-29T12:50:26.093Z)\nYeah, Pablo and Dragos. So we have the existing analytics, right? The Spredfast, which is like, you know, proven, I think in 2018, 19, they even modified it, like, you know, made it like, you know, more of a, you know, with the modern technologies, right? And also they're using GraphQL, connects with your Elastic, DynamoDB. It is a standard, you know, the pattern they've been following it like Kibana kind of stuff, right?\n\n And today, I think one customer, Jim, is asking about this one, right? We do have, I think, like, you know, we can go back to our system and see, like, you know, how many queries they fired. Like, you know, we have given all the dashboards to them. So each dashboard, it has multiple widgets. How many of them are active out of 63, right? We can go back and trace the number of calls that we know we are receiving from that particular customer.\n\n So in that way, like, you know, if you look at the last one month pattern, we'll come to know, know what is the utilization so out of 244 parameters how many of them are using day-to-day right that pattern that we can even do like internally because we have access to our system correct that is number one if those metrics are computed means that they use them or it just means that they are computed okay I mean like if they have a long time user then yeah you open a screen with 20 graphs and you have 20 calls but actually they look at one so without We're not asking them.\n\n\n\n[Pablo Fernandez] (2025-10-29T12:51:50.873Z)\nWe're not understanding what is the value that they're looking for. It's difficult. I mean, it's an information and there will be some correlation.\n\n[Douglas Ho] (2025-10-29T12:52:00.037Z)\nJust to give context, I am already asking our CSM, our chief of the customer success, sorry, I'm having a mind blocking, to actually engage GM on this one. That's already happening. So it's not like I'm talking to you happening I'm already okay can we get this information from gm what as the one but again I always realize when you ask them which analytics they want they'll they'll just say I don't think that's the question that's not the question you need to ask is which part of the analytics yeah and it is coming to form yeah and it's coming to form it's actually asking do they want the api access or do they want the rigid access actually that's the one one fault and but even with that then it's like which is the API they're calling on, even if they ask for the API access.\n\n\n\n[Pablo Fernandez] (2025-10-29T12:52:52.982Z)\nI think that we're looking at this wrong, to be honest with you guys. So first, there are too many middle men or women here. Somebody that creates the scope for this quarter needs to actually get this information first. The second thing is, I don't think the objective is asking if they want API calls or not API calls, or if they want it green or blue. What we need to understand is what prevents them to basically go from Spredfast to K1 in general, not even analytics, saying, okay, we want you to use K1 and be happy there.\n\n And what are the two things that if we do this quarter, you're going to do this? Or I'm not saying that...\n\n[Dragos Nuta] (2025-10-29T12:53:34.573Z)\nMove some amount of work, move a user, move something, move half of a department. I think I would propose a point segment their use cases and move some use cases to K1.\n\n[Pablo Fernandez] (2025-10-29T12:53:46.955Z)\nAnd it looks like analytics is there, right? As one thing, but analytics is so broad that we cannot say that we're going to take analytics from Spredfast and move it there. So this is where we are right now. But it's part of a bigger context saying, okay, we want you guys to basically go and use K1 Publisher, the K1 platform in general, instead of just like, we want you to stop using Spredfast. What is the thing that we need to do now?\n\n And they did a list, right? Like, this is the list, the Opal, the Kaggle, the Analytics, the LinkedIn bio, blah, blah, blah. But now, when we started drilling down, we go to Analytics, and this is where we are. But I don't think going and telling them which API do you use is actually the right thing. So this is what we need to agree, but this is not because it's already And I still don't understand how we're going to reach this goal.\n\n Like, how are we going to reach a situation where I have a document with, where I can put metrics and say, okay, Q1, we are at 50% or at X%. I don't understand who's going to get this information to the engineer. It can be me, it can be you guys, it can be, I don't Care. I can do this. But if you guys want us to do it, need to do it, we need to do it fast and agree that this is Like you said, we need to talk to the customer and that has been initiated.\n\n\n\n[Douglas Ho] (2025-10-29T12:55:14.839Z)\nLet me try to push that even faster to see how fast we can get the information from the customers. Definitely we'll just zoom in on analytics because that's the biggest chunk. And let's see how it can be framed, what kind of analytics. Can you help us to at least build those bigger building blocks as in what kind of metrics are we looking at? Do you have a notion of, you know, we can present A, B, and C in a bigger time than today and say, you know, these are the three things.\n\n Is this what you're looking for? Instead of us, you know, going to them, you know, what are you looking at? Can you help us to frame? No, no, no.\n\n[Pablo Fernandez] (2025-10-29T12:55:49.821Z)\nI think that was my, my document was a bit down and this is why it mixed a few things. He's saying, okay, this is what we're working on. Those are, this is the roadmap. Now we're doing LinkedIn bio. We're doing, you know, Instagram formatting and we starting to work on a analytics and analytics in Q4, we're doing that, Q1 that, Q1 that. And this is what you need to come, well, I would say, this is what I would go with the customer, because you're showing your plan, right?\n\n Saying, hey, this is the plan that we have, so to make you happy. Now, this is what's happening. If you look at this roadmap, if you had to put your finger on one thing that would help you migrate faster, which one would it be? And maybe they pick something for Q4, right? Or maybe they pick something that we hadn't even thought about. And this is what we need to work on right now. And if they don't say anything, or if they say, oh, yeah, what you're working on right now is the most important thing for me, well, that's customer validation.\n\n Well, we'll see if they lose it in a quarter from now. But at least we know that we have some kind of data point that we're doing the right thing. Right now, we're blind. We're doing things.\n\n[Seshi Paturi] (2025-10-29T12:56:55.524Z)\nYeah, I think the way that you put the document, the way that is going in the right direction because you are bringing it from the old system to new system and also merging into one system, right? We have already metrics for Care and you are bringing it from marketing and make it like, you know, using it as a one system to the customer. And coming to the technology, you already covered three of them, which you were able to successfully connect to the API and both the systems.\n\n The good thing about this particular migration or zero migration we're talking about it, data is same. Your elastic is same. Your DynamoDB is saying that in both the cases. All we are doing is switching it here and enabling the API. And you already did it for three. And five of them, I looked at it. I think your team already commented out. And all of them, 90% of the calls are elastic only. So you can, instead of three, in this quarter, if you put the right engineer who understands the elastic queries, this can be done.\n\n You can speed up all of them. You can bring most of them. I mean, technically I'm saying, like, you know, the second question is how many of them are relevant or not relevant is something that we can add only connect to the customer and then see from them. But in a modern world, analytics is something we have to give it to them. Like, you know, whether they use it or not, it's more of a drag and drop your parameters and create your buckets, aggregation, and all the stuff like Kibana, like Tableau, right?\n\n This is how we do it. We will not ask them, yeah, I'll give you only five. Do you want more? Let them choose big. And then this is the technology that we are offering.\n\n[Douglas Ho] (2025-10-29T12:58:29.810Z)\nI think what we need is an action plan. I think we can debate all technology here, which is not going to give us any solution. I think based on Pablo, let's do this because we have different ways to do things. My suggestion is this Pablo, we use what you have given to us specific on the analytics part. We asked our chief of the customer success to engage with GM and just show that portion to them, right?\n\n This is what we're planning on analytics. What do you think? They might come, I mean, we know on the back end, we might do things different, migration first, etc. That doesn't matter, right? Like I said, we just want to at least show them this is the plan. What do you think they, like, say, if they pin their finger, no, I want migration first, I want this, I want that, I want this, I want...\n\n[Dragos Nuta] (2025-10-29T12:59:13.799Z)\nYou're doing an interesting thing. So help me understand. So how are you guys doing this usually? Do you rely on your customer success team to take requirements, product management work with customers or like product managers?\n\n[Douglas Ho] (2025-10-29T12:59:27.731Z)\nSometimes not really, but this is a HBA. This is one of the biggest ones. So it would be handled a bit directly with the CSR, with the chief of the CSM directly a bit rather than us handling it. Like, you know, going to them and hey, I'm the product guy, you know, what do you want and et cetera. So we kind of asked them to help us to link the bridge, but maybe previously Thibault was directly linked as well, but we don't have that person now.\n\n We do have Stuart, but he's not, he's still, know going around so probably what I think would be best is get the the person who's been talking to them directly always and holding them.\n\n[Dragos Nuta] (2025-10-29T12:59:59.445Z)\nNo that's fine, I'm not saying who has to be in the call, I'm saying who processes that information live, who probes them and like who has the prognosis on conversation like do you usually rely on CSM? I mean like I thought that some of the PM on your team or you know Pablo they would join the call, I'm not saying Nobody's asking for a one-on-one. I'm genuinely trying to maximize the outcome of your investment.\n\n I don't want to get to a new quarter where we spend the money, we build something, nobody wants it, but it's a success. That's what I hope this is. It's not like we stop doing work if we don't know what to do. Because it's low value. It doesn't make sense. We should do something else if not. So that's what I'm picking on. Let's conclude with Nangieh.\n\n[Douglas Ho] (2025-10-29T13:00:48.086Z)\nSorry, it's my time, right? Not that I'm rushing, so I know everyone's time is valuable. So if we do get a call, who would need to be in the call with GM if we need to bring in?\n\n[Dragos Nuta] (2025-10-29T13:01:00.553Z)\nThere are two statements.\n\n[Dragos Nuta] (2025-10-29T13:01:05.016Z)\nYou as a customer, Resignite, you need to be super happy with the outcome.\n\n[Douglas Ho] (2025-10-29T13:01:10.779Z)\nSo I also know that at the same time, you, after people left, you are also all over the place and not don't have full the full expertise so definitely public can join but whenever we draw the line I'd like it to be a true statement that ignite and gm and tpm are like yeah we've talked about this and these are three things that you know will not bring the sun back but will definitely make things much better right something like that I think yeah the reason for this is because like like what we don't want to build things that you know we assume that is that is true if we can get information from the system I would love to get it from the system like what are they using exactly on a day-to-day basis if we cannot get that then we need to talk to customer about it and the one way that I totally agree that plan of course we can always shuffle the plan around but it is a plan at least that's been drawn and we can show the customer it's not non-technical like you know migration method etc they don't really Care about that you know generic chance they don't really Care but that's on our side okay so they will know the agenda and you guys can ask them to bring the people that can talk about that agenda so that we don't have some acquisitions, purchasing, adjoining, and whatnot.\n\n\n\n[Dragos Nuta] (2025-10-29T13:02:17.732Z)\nQuestion number two. Can we have an internal call with whoever is talking to GM more often ahead of that?\n\n[UNKNOWN_SPEAKER] (2025-10-29T13:02:27.554Z)\nCan you arrange that call with Pablo and that person?\n\n[Dragos Nuta] (2025-10-29T13:02:31.354Z)\nOf course, whoever. We're all trying to put pieces together. I'm not trying to limit anybody. I think that would make a lot of sense. If the call would be tomorrow, I know people would have an agenda. Would it be the same agenda as yours or Seshi's? I don't know. I don't think that's even the question. The question is if by then we are prepared with what we think are the most important things to make the decisions on what to invest this money in, right?\n\n\n\n[Seshi Paturi] (2025-10-29T13:02:57.364Z)\nTotally agree.\n\n[Seshi Paturi] (2025-10-29T13:02:58.385Z)\nOne last question from my side. We activated three widgets on the K1 Publisher. So how is it performing? Second is all working good. Any feedback on those three widgets?\n\n[Pablo Fernandez] (2025-10-29T13:03:14.022Z)\nSorry, I'm not sure I understand the question.\n\n[Seshi Paturi] (2025-10-29T13:03:16.983Z)\nOkay, there are three of them already activated, like three widgets.\n\n[Pablo Fernandez] (2025-10-29T13:03:21.345Z)\nAnd there are five behind flags, which I still don't know.\n\n[Dragos Nuta] (2025-10-29T13:03:26.647Z)\nGave us feedback? Or what?\n\n[UNKNOWN_SPEAKER] (2025-10-29T13:03:28.227Z)\nYeah, yeah.\n\n[Dragos Nuta] (2025-10-29T13:03:35.067Z)\nThe topic is that we don't know.\n\n[Dragos Nuta] (2025-10-29T13:03:37.188Z)\nWe are not playing the game. We are in our own silos. The game should be there. I wouldn't know. They are all crickets and they would not make assumptions because whatever they are using might not be their core use case. Whatever they may have tried on K1 might be just things they tried, not things that they like, It's dangerous to make assumptions. I feel bad for your investment in making bad assumptions and then throwing the line and saying, oh, Ignite paid us to do this, and then couldn't get...\n\n\n\n[Pablo Fernandez] (2025-10-29T13:04:07.426Z)\nAnd actually, we want to get rid of Spredfast. We want them and the rest of the customers, and there is of 17 AR sitting on Spredfast. So we need to migrate all those people, and we want to migrate them on the other side, but we're really not progressing.\n\n[Dragos Nuta] (2025-10-29T13:04:22.198Z)\nBut of course, if Ignite kills Spredfast, your margin will increase tremendously. You probably know that. Spredfast is really costly.\n\n[Pablo Fernandez] (2025-10-29T13:04:30.284Z)\nIt's extremely expensive.\n\n[Douglas Ho] (2025-10-29T13:04:33.945Z)\nUm, just, um, I mean, this is more of an engineering question. We can address it. No, because just now when, uh, when she was pointing out high trust and recharge, I noticed high trust has a license and then why, I mean, can we move away from that or not? But that's another problem for another thing.\n\n[Pablo Fernandez] (2025-10-29T13:04:52.433Z)\nLet's address the strategic things first. And, uh, as soon as we have a plan, we can go on the execution. Okay, so next steps, Douglas, you basically talk to Seshi or I don't know who it is.\n\n[Douglas Ho] (2025-10-29T13:05:07.290Z)\nI talk to Seshi, yeah, to really get answers validated, you know, what exactly is analytics that to be focused on. We'll use what you have given as a hypothesis, you know, it's not perfect, but we're flying like it.\n\n[Pablo Fernandez] (2025-10-29T13:05:24.002Z)\nI can iterate a bit and I will incorporate a of your comments and make sure that I clarify a few of your questions. But I mean, that's the basis. I mean, it's not a good plan, but it's better than no plan, I guess.\n\n[Douglas Ho] (2025-10-29T13:05:36.706Z)\nYeah, better than ask what do you want in analytics. I totally agree.\n\n[Dragos Nuta] (2025-10-29T13:05:41.128Z)\nWe're also thinking, I think it's also thinking of kind of creating, consolidating a bit what we've learned from multiple sources, like what Pablo believes based on his knowledge and expertise of our quarter on the product, what we've heard from GM, what What was the other thing? I think there are a few sources that you can put them like in a crosstalk. You'll get to gauge a bit what might be of most interest.\n\n Oh, it was another one, what they are currently using in Spredfast and is not in K1, which again, it's not definitive, right? We're not trying to build a one-on-one copy, definitely.\n\n[Pablo Fernandez] (2025-10-29T13:06:18.810Z)\nAnd that's one of the questions we should ask them, by the way, what are they using Spredfast for and what are they using One for and maybe we'll get already quite a bit of context as to you know, yep How seriously they take one in the other?\n\n[Douglas Ho] (2025-10-29T13:06:34.438Z)\nHaving this conversation I think As I said nobody wants to waste so ignite investment to work on things are low value and does the pressure and the we'll get it sorted out and then we'll feedback and then we'll feedback if there's gonna be anything or they will just email us or whatever but we'll definitely get a feedback for everyone and then I'll consolidate it from everyone just to make sure it's signed off and everything before we proceed and it works on the analytics part at least right"}