{"transcript":"# Noumaan / Dragos - XO & TPM topics\n\n## Topics\n\n\n## Transcript\n\n[Dragos Nuta] (2025-10-28T16:34:55.423Z)\nwhatever, me playing weird.\n\n[Noumaan Shah] (2025-10-28T16:34:59.625Z)\nAnother day, good things and bad things. It is what it is. Why don't we start with your stuff first, and then?\n\n[Dragos Nuta] (2025-10-28T16:35:17.894Z)\nI'd start by wearing the customer If there's anything new.\n\n[Noumaan Shah] (2025-10-28T16:35:29.080Z)\nSo let me, so what we've basically, what I basically have got is for, let's start with TPM and then we can go into the others. So for TPM, I've boiled it down to, oh, why don't I just share my screen? I've messed it up a little bit, so I'll send you the results later. Basically, I've identified one, two, these are the work units that we've identified so far. Architecture review, cost optimization analysis, creating a feature spec, creating a strategy spec, creating a technical teardown spec, incident response, process improvement, Quality checking in RCA, reviewing a milestone deliverable, triaging an issue, and working on a brain lift.\n\n I've created a separate one for overhead, just because I want you to track it. Maybe you are in line with that or not, but this is, for example, I noticed some people were having VPN authentication issues, blah, blah, right? I mean, these aren't really related work, but this is just, for example, me asking for a request for a team room access or whatever, right? I mean, anything, anytime where there's like not cognitive work isn't happening.\n\n\n\n[Dragos Nuta] (2025-10-28T16:37:03.217Z)\nIt's an interesting insight. I don't think about capturing it as a work and it should be a default, I guess. If we could do that as a default and say anything else is overhead would be good, but it's for sure better to state it. So I like the idea of starting with as an overhead because you acknowledge what's overhead and you take it from there. And refine. I don't think an MLM will have a super easy way of saying, oh, that's overhead, unless you can tell it specifically.\n\n\n\n[Noumaan Shah] (2025-10-28T16:37:27.331Z)\nThat's what I'm telling you. That's what I'm telling it, right? I hear you. There are other ones which are not work units that have basically said, going to LinkedIn isn't a work unit. Going to Crossover isn't a work unit, right? And then being in a meeting isn't actually a work unit. But when you're in a meeting, you're doing something else that is related to that meeting, then that's, that is what you want to capture as a work unit.\n\n And then similarly, if you're doing coding, coding itself, isn't a work unit. You're doing coding because of something else. So what is it that you're doing? So that's a work unit.\n\n[Dragos Nuta] (2025-10-28T16:38:04.424Z)\nUm, can be tuned, can be changed with some awesome stuff.\n\n[Noumaan Shah] (2025-10-28T16:38:07.746Z)\nNo, no, of course it's going to be changed. Uh, I started with like a team description for TPM and I'm assuming everyone will have their own, right. So these are the assists. Let me know if you're aligned with this or not.\n\n[Dragos Nuta] (2025-10-28T16:38:23.400Z)\nI should be able to listen to you.\n\n[Noumaan Shah] (2025-10-28T16:38:28.022Z)\nThat's the framework that I'm going with?\n\n[Dragos Nuta] (2025-10-28T16:38:30.503Z)\nYeah, we discussed about team description, and then we'll have our individual goals of some sort.\n\n[Noumaan Shah] (2025-10-28T16:38:35.125Z)\nSo each work unit has it for goals. So I was thinking about doing something like with the para framework. So you've got the projects, unless you want to go with a different approach?\n\n[Dragos Nuta] (2025-10-28T16:38:47.099Z)\nI think I would not add goals just now. I would see what happens if you just don't do anything. For example, what is a hypothesis? What if you just list the project goals that the team is working on? You don't have to talk about individual projects they are working on, as long as it recognizes that, oh, that's a project. If we would be buying Google Drive would be a project. But until then, it's just a tool.\n\n So I would apply the less is more here. Rather than creating a more complete control sheet, I would say this for sure changes how you look at data, the team structure. Work units also change how you look at data, goals. That's the thing where I would be like, can't AI do it? And that's why I would defer until we see that it sucks. If we go too much into data structure and modeling and whatnot, then people are like, isn't this like AI?\n\n Should do it. But some things are super obvious. And the team goals and whatnot, those are super, super.\n\n[Noumaan Shah] (2025-10-28T16:39:51.461Z)\nI didn't start with this text to begin with, just so you know. It wasn't like I started writing this by myself. I looked at it with different analysis.\n\n[Dragos Nuta] (2025-10-28T16:40:05.204Z)\nNo, I hear you. But you pick some things, you remove some other. Bullshit, that's not that. Definitely, I'm sure. Actually, I'm quite curious, because I'm curious about the accuracy of the information and all that, or your feedback on that. For example, a super simple feature would be, can we send a new AI summary that's based on this data to teams that have it enabled? But that should be like a panel, four hours of work, and it should make everybody excited, or at least a team.\n\n No, no, no, no. Because this feature is not implemented. I mean, just with the current data, what do we think about you? Here's how you use the AI. Here's what your challenges were. Here's whatever you already found that AI is good at with the current ontology, in terms of depth, accuracy, based on your experience. It's really a one-off. We don't have to do it. But if you're like, there are five things that are usually quite well captured, it would be a good one to sell to everybody quickly.\n\n\n\n[Noumaan Shah] (2025-10-28T16:41:06.788Z)\nSome things were actually very interesting, like when I started with the user stories here. These were the user story. I don't know if I shared this with you or not. Yeah, you did.\n\n[Dragos Nuta] (2025-10-28T16:41:16.492Z)\nAt least in chat, not in a file, but yeah, I remember that.\n\n[Noumaan Shah] (2025-10-28T16:41:20.033Z)\nThese ones? So I started doing like, okay, what is my coverage for each of these, right? So for user story one. Oh, geez. Where is it? So like, for capturing the decisions, right? What are the query patterns? What are my requirements? And then what can we actually do right now? So this is the coverage by running the, I ran it, my data was pretty old, but I still ran it on my old data. At least so we can, I've got some information here.\n\n And then figuring out like, does it handle this? Does the existing MCP endpoint, can I get the answers to these questions? Can I filter blah, blah? So I can look at the test results and see what, which of these- Do you only test with you and Claudia or do you test with- For this one, yeah. For this one, I only tested. But the other ones, like all the work units, I actually ran the work units on everybody that has data.\n\n\n\n[Dragos Nuta] (2025-10-28T16:42:31.201Z)\nWho's missing data? We know there's missing data, now that I think about it.\n\n[Noumaan Shah] (2025-10-28T16:42:35.425Z)\nWell, he has data. Who is missing? Kamlesh is not there. Yeah, I don't see anything from Kamlesh. I can go to the raw data.\n\n[Dragos Nuta] (2025-10-28T16:42:48.797Z)\nBen doesn't have data, you know why?\n\n[Noumaan Shah] (2025-10-28T16:42:50.899Z)\nI know Ben doesn't have data, I know that. Where is it?\n\n[Dragos Nuta] (2025-10-28T16:42:54.482Z)\nAnd your data is still missing? Do you manage to sort it out?\n\n[Noumaan Shah] (2025-10-28T16:42:57.600Z)\nUh, I started with my apple silicon one. So I hope it will capture stuff. You haven't turned it off, right? I know there was something. So I know that yesterday I was working on the laptop without my monitor and I know that was capturing the video. I want to know today I installed the, the apple silicon one or maybe yesterday. I don't remember when. I want to know whether it's capturing the video or not.\n\n We should actually see it right now. Let's see. Let me go to my WorkSmart.\n\n[Dragos Nuta] (2025-10-28T16:43:37.805Z)\nSo overall, I don't know, quality, depth of information of the people you went through. I don't know. For example, is it a good time to share this with everybody and ask them grade, completeness, and accuracy, so that we figure out if...\n\n[Noumaan Shah] (2025-10-28T16:43:57.910Z)\nNot yet. Give me at least 44 to 48 hours.\n\n[Dragos Nuta] (2025-10-28T16:44:00.693Z)\nI mean, that's a good framework to get some information on whether we have a data accuracy and completion issue, or we have a good foundation to build on. Now, the good thing is that I think that by now you're equally in agreement with that. As well. But the fixes will be prone fixes. Of course, at some point, it becomes unbearable unless you become a calculated test suite, because you're like, oh, I changed that.\n\n I'm going to fix that now. I blew everything up. But the beauty of it is it's just so LLM-ish. That's all.\n\n[Noumaan Shah] (2025-10-28T16:44:38.210Z)\nI talked to Robert about that. So he's aligned. And I understand his problem. He's not able to hire fast enough. That's why we're suffering on this I don't mind. So anyways, yeah.\n\n[Dragos Nuta] (2025-10-28T16:44:56.386Z)\nI think they changed something. Somebody changed something.\n\n[Noumaan Shah] (2025-10-28T16:45:00.868Z)\nI'm there, but I don't see my.\n\n[Dragos Nuta] (2025-10-28T16:45:07.192Z)\nOne second. I cannot see your screen. I only see you only share the cursor. Stay there here for a second. They changed something. So if you notice off, I'm not recording fine. Microphone recording is fine. Disable block. I don't even know what this is. Whatever, I don't know what this is. But this is off here. And somehow it's still working.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:45:38.181Z)\nSo very weird. Did you change it? No, no, no. I just entered.\n\n[Dragos Nuta] (2025-10-28T16:45:42.385Z)\nNo, they just opened the UI. It used to be like a toggle. Oh, I think that what happened is that probably Robert is tidying things up. I told you, he has a hobby. And probably there are way more boxes here, and I collapsed them under a dropdown. So he only has two developers, and he's doing things that are of no meaning to me as the person paying. It's funny.\n\n[Noumaan Shah] (2025-10-28T16:46:14.538Z)\nIs, is there, I'll check why my videos aren't going through because I noticed that my videos aren't going through. You haven't turned on for me, right? I just showed it. So it's always, huh? That's bizarre.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:46:36.416Z)\nYep, OK.\n\n[Noumaan Shah] (2025-10-28T16:46:39.217Z)\nYeah, because I set it up so that it should show you the video. There's no max resolution or something like that. Sorry, I don't want to take your time on this. I'll check with Robert on why. OK, where were we?\n\n[Dragos Nuta] (2025-10-28T16:46:56.124Z)\nDid you get access to the code? Do you know where the repo is?\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:47:00.566Z)\nFor a Crossover?\n\n[Dragos Nuta] (2025-10-28T16:47:02.726Z)\nNot for a Crossover like the ExoManagePlayer, for this AI Vision pipeline?\n\n[Noumaan Shah] (2025-10-28T16:47:07.957Z)\nFor the AI Vision pipeline, yeah.\n\n[Dragos Nuta] (2025-10-28T16:47:12.138Z)\nWhich other reports? Sounds like a weird question, but remember, it didn't start in Central. And honestly, I'm not very sure how much Central got up to speed with it. So I know they did some things, but I also know some people left.\n\n[Noumaan Shah] (2025-10-28T16:47:22.801Z)\nSo there's Crossover, AI Vision. The funny thing is that there are prompts, but the prompts are like, initially, they were supposed to be in, what's that website? Or where you can, where you can use from Yeah, so they were supposed to be LangFuse, then they got copied over into the spec. Then they got copied over from the spec into the repo itself.\n\n[Dragos Nuta] (2025-10-28T16:47:45.705Z)\nUsing LangFuse would be good. You have audit, you have all these things.\n\n[Noumaan Shah] (2025-10-28T16:47:49.227Z)\nYeah, but I think now they're in, some of them are in the repo itself. I don't have LangFuse access though.\n\n[Dragos Nuta] (2025-10-28T16:47:58.053Z)\nYou can sort that out. So overall, there are two developers. Are both starting on this tomorrow or only one? Only one. Only one is tomorrow. Do you think that's a good setup? I'm asking you. I'm asking Siri. I'm asking for your opinion.\n\n[Noumaan Shah] (2025-10-28T16:48:20.556Z)\nMy opinion? No, it's not a good setup. I want more than one person, but I don't have the luxury. Two no I mean of the two I mean of the yeah but I would like both of them to be on it this is like 50 not even 50 this is one-third the capacity so you ask me my opinion that's my opinion uh they don't have the the way I found out I was thinking that the sc7 is a is a shared pool but apparently the sc7 is pool per bu and so like jigtree would have it across all the products, yours is not shared with anybody I think?\n\n Because it's not in a separate BU in a way? So it's the same developers. You basically are at zero SC7 in a way, right? Think about it this way.\n\n[Dragos Nuta] (2025-10-28T16:49:10.465Z)\nThat explains it, motherfuckers.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:49:13.946Z)\nThink about it this way, right? There's nobody else in that BU.\n\n[Dragos Nuta] (2025-10-28T16:49:16.308Z)\nI've always seen Kanban people doing bugs. So if I stop Kanban investment, what will they do? I guess that's when they'll be like, Okay, let's get yours You know, they're like Remember, they're like, do you know the Crossover pays for three sevens?\n\n[Noumaan Shah] (2025-10-28T16:49:31.752Z)\nUnderstand that I'm just trying to explain to you. The situation on ground is different. Okay Okay, I was under the impression that the se7 is a shared pool of resources across I knew it was bu but I never can like went through the thought process of saying what happens uh If uh, yeah, okay Okay, so it's the same people doing bugs as well as this and there are bugs as well. So for example, robert was talking about uh accounting issues and a couple other higher priority items that are coming in like I don't understand why these same developers are also working on Like I guess they get involved in case the payroll doesn't go out or other things?\n\n\n\n[Dragos Nuta] (2025-10-28T16:50:22.273Z)\nI think we should stop because my blood pressure raises to a level where I feel like yelling and sweating. I would rather go do that directly with Robert. I'm at the point where I'm like, that's why CEOs need to be difficult with us. Because the moment they look away, we may optimize things. And I'm not doing that I will work with me enough to not I'm really trying hard to not do that even when we do that we Can I make it clear like okay?\n\n Let's do only this because enough only have that I'm not optimizing anything at the expense of This is not optimizing this is like they're trying to Fix it is optimizing. It's optimizing because whenever I'm paying three sevens And there should be three people and I have zero it means that they are using that money to do something on Coros and whatnot. If I'm wearing my Pew's hat, sorry, that's what it is.\n\n Let's not pollute this conversation. Thanks for the context. There's nothing I need to do on that.\n\n[Noumaan Shah] (2025-10-28T16:51:33.081Z)\nAnd they're short by developer because that developer just ended up quitting.\n\n[Dragos Nuta] (2025-10-28T16:51:38.926Z)\nThat's different. But when we start with three AC7s in the Kanban and you only have two people instead of the six or seven, or whatever, like, however you add, it should be at least four, even five.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:51:50.701Z)\nOh, okay. Well, then, yeah.\n\n[Dragos Nuta] (2025-10-28T16:51:53.902Z)\nThat's where my blood pressure increases, right? Because the H7s should have some kappa. Okay, let's not do that.\n\n[Noumaan Shah] (2025-10-28T16:51:59.284Z)\nThat's a separate discussion. I think you and Jozsef need to talk about that. This isn't about...\n\n[Dragos Nuta] (2025-10-28T16:52:04.666Z)\nYes, yes, yes, yes.\n\n[Noumaan Shah] (2025-10-28T16:52:10.488Z)\nAll right. All right The other issue that happened on are you aware of the issue that happened on work smart on the mysql upgrade? Over the weekend. We had to stop that update This will increase this increase my blood pressure, so I don't know if you Okay So, right now we don't have a DBMS expert in a way. The only DB expert...\n\n[Dragos Nuta] (2025-10-28T16:52:49.850Z)\nWe can't export it or what? No, no, no, no. Kill the database if we export it or what?\n\n[Noumaan Shah] (2025-10-28T16:52:54.392Z)\nNo, no, no, no. Wait, it's not big. Come on. It's not relative. It's not big. We did a bigger database migration from Heroku. To AWS and CloudSense. Here is the problem. You know who the database expert was in the company? He wasn't great. He was good.\n\n[Dragos Nuta] (2025-10-28T16:53:18.845Z)\nI remember the name Shravan at some point.\n\n[Noumaan Shah] (2025-10-28T16:53:22.347Z)\nNeil, right? Neil used to do this.\n\n[Dragos Nuta] (2025-10-28T16:53:25.189Z)\nNeil left as well or what? Was left. He passed away. Oh, that Neil, poor guy.\n\n[Noumaan Shah] (2025-10-28T16:53:33.175Z)\nSo now the person who's doing this is Eric.\n\n[Dragos Nuta] (2025-10-28T16:53:35.425Z)\nHow old was he? Do you happen to know? I'm just curious. I never met him face-to-face. He was our age.\n\n[Noumaan Shah] (2025-10-28T16:53:40.946Z)\nI never met him face-to-face. I just did a video call with him. I've met you face-to-face, but do you know how typically we do video calls? Anyways, the main problem is that Eric's now taken that work, and Eric doesn't have DMS expertise. He has to build all of that expertise.\n\n[Dragos Nuta] (2025-10-28T16:54:06.297Z)\nWe are not in a rush. We can do it. Yeah, I hear you.\n\n[Noumaan Shah] (2025-10-28T16:54:14.602Z)\nLet me, let me take a step back. It's got nothing to do with WorkSmart. We are in the process. We are in the business of buying companies. Joe, we don't know how to move the database from on-prem to cloud. Or from one cloud provider to another cloud provider. Even in my SQL database.\n\n[Dragos Nuta] (2025-10-28T16:54:35.667Z)\nYou should tell Kavina that. You should ask her how she feels about... What the hell did I do? You should ask her how she feels about that.\n\n[Noumaan Shah] (2025-10-28T16:54:42.993Z)\nBut she hasn't dealt with Joe, so I don't know if I give her this example, she would correlate to what I'm doing.\n\n[Dragos Nuta] (2025-10-28T16:54:49.318Z)\nNot Joe. I would say, how do you feel if I'm telling you that we don't have database managed DBMS expertise and we don't know how to...\n\n[Noumaan Shah] (2025-10-28T16:54:58.106Z)\nThis has got nothing to do... Again, my blood pressure isn't rising because of WorkSmart.\n\n[Dragos Nuta] (2025-10-28T16:55:03.011Z)\nThat's one.\n\n[Dragos Nuta] (2025-10-28T16:55:03.972Z)\nYes, I understand. That's what I'm saying. Look, the fact that Eric started it and got stuck, it is what it is. The fact that Eric could not complete with AI, it's what it is. But the fact that there's no better out solution other than waiting for Eric to learn, well, that is what it is if the person leading this group basically says, of course that's normal. And I'm curious to know what she thinks about this and how she solves this problem.\n\n\n\n[Noumaan Shah] (2025-10-28T16:55:34.468Z)\nEspecially given that this isn't an obscure database. We're talking about MySQL. And we're in the business. This is our core business. This is our.\n\n[Dragos Nuta] (2025-10-28T16:55:50.381Z)\nYou don't have to repeat a million times. Like I should be doing it, be able to do it myself if necessary. But seems to probably, probably it's not quite straightforward, but this cannot be a problem in this company, or it cannot be a problem for more than, I don't know, maybe the first iteration we hit a snag, something blows up, find some nails, next time it's done. Everybody has hiccups.\n\n[Noumaan Shah] (2025-10-28T16:56:15.440Z)\nWe should have fucking playbooks because we did, we've done this so many times. Last time we did the database migration, I was screaming and yelling, because we forgot to copy the indexes on Postgres. All right. Gee, we just did a table dump and table copy and forgot that indices need to be recreated as well. That sucks. That's not the way you want to validate a database migration. Has issues. This isn't about fixing DMS.\n\n This is about how do you use DMS and then bring the expertise in. And if we don't have the right people, then we go hire the right people. This is nothing against Eric.\n\n[Dragos Nuta] (2025-10-28T16:56:58.250Z)\nThis is the service, not people, service. I have no problem that Eric got stuck or anybody got stuck. Even I can get stuck. That's not the problem. The problem was one, it was not unstuck within a maintenance window, which I assume by itself for a trivial task is a bit weird. And then we are still talking about as an unsolved problem it is still an unsolved problem exactly that makes it brain right basically mind-blowing right right okay no I have nothing with any back whatever like we are all competent or incompetent in some ways like it's not about that it's about problems going away faster than they came if you're working and then and then not learning from our mistakes and losing that knowledge yeah so we need to we also, uh, I haven't heard anything from Kevin.\n\n\n\n[Noumaan Shah] (2025-10-28T16:57:52.572Z)\nIt's been crickets. She's around, right? Cause I've seen in this company when people get hired and then within a week or two weeks they're off. And so she's been so quiet that I don't even know.\n\n[Dragos Nuta] (2025-10-28T16:58:03.641Z)\nIt's a good question. I don't know. I think that I lost her. I lost her from her last week at some point last Wednesday. I hear. I don't know. And to be honest, that was weird, because today, now that you're asking, because Colin today asked me if there's anything I want to yell at him, sus-wise. I should have, it felt weird, but I said, you know, like, I don't know, whatever that means. But maybe I should clarify, why ask you?\n\n Because last time he said, ask Kevin, I'm out. I know he had personal issues as well.\n\n[Noumaan Shah] (2025-10-28T16:58:39.510Z)\nYeah, I know, there was a brief, but he's back this week, I think.\n\n[UNKNOWN_SPEAKER] (2025-10-28T16:58:44.302Z)\nYeah, he's back, yes.\n\n[Noumaan Shah] (2025-10-28T16:58:46.304Z)\nThis year has been pretty bad for a lot of people, unfortunately. Anyways, I've got to Read on this. So let's go to... What else are we doing on works on this?\n\n[Dragos Nuta] (2025-10-28T16:58:59.595Z)\nNothing on works. So, you know, ideally an engineer picks up the task tomorrow and the information from context will be used for processing the video and the work units will be used to create, I guess, another artifact.\n\n[Noumaan Shah] (2025-10-28T16:59:18.798Z)\nAnd I want them to actually do it on their own engineering work. And then we roll this out on Friday to everybody else, maybe. They can backfill.\n\n[Dragos Nuta] (2025-10-28T16:59:31.565Z)\nAny data can be backfilled.\n\n[Noumaan Shah] (2025-10-28T16:59:39.083Z)\nthe right data was captured, yes.\n\n[Dragos Nuta] (2025-10-28T16:59:41.965Z)\nNo, no, no. What do you mean? If video was there.\n\n[Noumaan Shah] (2025-10-28T16:59:46.069Z)\nOh, we keep the video. OK, I thought maybe we destroy the video.\n\n[Dragos Nuta] (2025-10-28T16:59:50.351Z)\nNo, no. That's a big part of the S3 build that I'm looking at. OK, I thought maybe we were right. But anyway, no, no. We can backfill the data. We can backfill the data. And maybe the engineer can be confused, and then Dennis can help him out. Is to get them unstuck if they are unfamiliar. I don't think that should be the case anymore if it's done, but...\n\n[Noumaan Shah] (2025-10-28T17:00:13.799Z)\nOkay. Okay, I didn't... I thought for some reason that we're destroying the old data because of storage costs or something like that.\n\n[Dragos Nuta] (2025-10-28T17:00:22.645Z)\nCome on, storage is cheap. Because of EA cost. You should destroy the EA data because of EA cost. What are you talking about? I told you this is an interesting day for me. I have a lot of weird comments to make.\n\n[Noumaan Shah] (2025-10-28T17:00:35.314Z)\nI have the comment with all I had like, well, I now also have a personal, uh, I want to figure it out. Let me take a step back. So my AI usage is pretty down last week and the week before that. And you know why? Because I'm using VS code. Cloud code runs either in terminal IDE. Or an ID and the ID that I want to use.\n\n[Dragos Nuta] (2025-10-28T17:01:07.878Z)\nCode is usually just being captured.\n\n[Noumaan Shah] (2025-10-28T17:01:12.579Z)\nNo, because the because the window is VS code, so it's not AI.\n\n[Dragos Nuta] (2025-10-28T17:01:18.883Z)\nI know that, but sometimes you will see if you get a glimpse. If they if you get a glimpse of cloud code, will it capture this? Yeah, I know. I know, and that's why that's why I'm saying that the feature that would roll out an email to everybody explains they are using, what tools for what purpose, would be huge. Because yes, moving work to agents means that you can do something else. Your time is not there sitting and looking at an AI spinning, or being an ID with some plugin on the right showing only some prompts.\n\n You don't have to tell me that. This always came back to, can we just send an email with the current data so people see that we're sitting on something way more important than and it's more useful than this.\n\n[Noumaan Shah] (2025-10-28T17:02:06.079Z)\nI don't have to convince you. All right.\n\n[Dragos Nuta] (2025-10-28T17:02:09.601Z)\nNo, I Read that email, but we need an alternative. Otherwise, that email will rule the world.\n\n[Noumaan Shah] (2025-10-28T17:02:15.864Z)\nAnd then there's some... I think I've also tasked Robert with doing an analysis of the API calls to figure out what's going on and the initial numbers are like in are you wouldn't be surprised the initial benchmark he did was ridiculous so I mean the time it's taking or how ridiculous last Friday I waited let me show I waited like 10 minutes I don't know what it was, but it was the API gated because we use API gated.\n\n\n\n[Dragos Nuta] (2025-10-28T17:03:01.542Z)\nI'm sure it wasn't the default timeout. I think we probably maxed it out anyway. But I waited for it. I was there with the developer tools and waiting for one request to show all team rooms. And I was like, you know what? I'll not close it. I'll wait. And eventually it came through.\n\n[Noumaan Shah] (2025-10-28T17:03:20.676Z)\nLook at this. Just look at the medians. 37 The most used the most used and point 37 seconds the media I'm not kidding you. Yep Okay, look at the max here 500 588 seconds You know how long that is How it's just as long as I waited on Friday to load all the people see a science. I don't Again, I don't need to convince you.\n\n[Dragos Nuta] (2025-10-28T17:03:53.229Z)\nYeah, and I would not spend a lot of time fixing that but it's so bad that Just laser focus only one or two the critical ones and get those done. Maybe we should do that conversation We started on Friday or if people check the notes and just optimize a few features Stop the nice change team room and work diary. We've got even work diaries It's not like what it is is a cause that goes to everyone Why do people go there?\n\n Sure, there's a manager use case, but I will not hold my breath on that. It's more like I need to go there to check my idle time. If you ask me, that's my bet. You'll see that the most common query is that of idle time or something like that.\n\n[Noumaan Shah] (2025-10-28T17:04:35.209Z)\nSo yeah, it can be a bit nice. Idle time should also be like, you know, it's only on a week. So it should just be, here is your idle time summary.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:04:44.016Z)\nYeah, I understand. I understand. Not ghosting.\n\n[Noumaan Shah] (2025-10-28T17:04:46.887Z)\nMost of the time people are doing idle time. It's in a meeting, right? We should be able to know whether you're in a meeting or not.\n\n[Dragos Nuta] (2025-10-28T17:04:52.811Z)\nYeah, we have AI. It's a Google Meet there. It's a whatever. It's a Google Meet window. So if I see a screening thing, yeah, I hear you. Once upon a time. So again, I think that if we're trying to buy our way out of this, I would say the tools that the best, highest paid people are using sometimes to move the shit around, if we optimize that, we are good enough. All the entire crowd looking for the time cards, it's more like a priority number two, I guess.\n\n But if we make the teams work...\n\n[Noumaan Shah] (2025-10-28T17:05:23.220Z)\nYeah, yeah. Manage with the teams. Yeah, yeah. That's the bigger goal. Yeah, I know.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:05:33.029Z)\nBut I want to know what is going on. It can be a Christmas present.\n\n[Noumaan Shah] (2025-10-28T17:05:39.875Z)\nWhile they're working on the prompts and testing them out and they're just spinning their thumbs, I want them to be working on other things as well. I don't want the big nose is the expression I like but yes, I Would rather have them work on these things instead of trying to figure out whatever the heck is going on the payroll and stuff I don't know how that is an increasing value to the product Okay I need to check with Leo on where we are with Kayako on the Frewala stuff.\n\n And I know Cathy is not going to be very excited about it, but at least we want to get that goal done to 100%. We call it good. So we're done with that product. Messenger, we're running into a few issues. I need to check with... What's the name of the guy? I'm having a brain freeze. Oh, come on. The guy who lives in Italy.\n\n[Dragos Nuta] (2025-10-28T17:07:06.699Z)\nHe lives in Italy? Good way to retire. Not Venice. I wouldn't like Venice, but Italy is a good place to retire.\n\n[Noumaan Shah] (2025-10-28T17:07:16.147Z)\nHe was on vacation last week, so I need to sync up with him. That would be weird. I'm sure he went somewhere else. I'm sure. I don't know. It depends on people. Anyways, this is about the messenger stuff. I want to figure out what's going on. I got an EC2 instance, tried to set it up, and wasn't able to run the latest version. So I have to go back to a previous version and run that, which also seems bizarre.\n\n Like, why are we releasing a version that's taking time? The other thing I wanted. Yeah, one thing that Kathy actually brought up last week was we need a mechanism in TPM, especially when we buy these companies. To have an offboarding or data cleaning. Because he sees this as a massive cost bill for be used for all of these products when existing data isn't cleaned up?\n\n[Dragos Nuta] (2025-10-28T17:08:33.502Z)\nI don't know if I'm so crazy about this hypothesis. It depends. I remember when Eric was like, oh, if we're deleting all the Twitter data, how many hundreds of thousands of dollars will we save? Like, 10k, maybe? It's plurage. Unless it has a big computing impact, it's...\n\n[Noumaan Shah] (2025-10-28T17:08:55.662Z)\nI'll tell you, for example, Exasol, that was like 130k cost a year. Let's round it, 100k. The cost 80% is by one customer BMW, which isn't even the biggest customer. So when they went and did the renewal, they didn't ask for a bigger price because it's also related to cost per customer.\n\n[Dragos Nuta] (2025-10-28T17:09:19.112Z)\nNo, I hear you. I think that there should be an import step in the process that does exactly I know it sounds boring.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:09:26.883Z)\nCustomer, right?\n\n[Dragos Nuta] (2025-10-28T17:09:28.544Z)\nIt's like it's I don't know what's the name for it, but basically you know that you establish the process that removes customer data that the You know how to on board, how to set up a new customer. You know all those things you know how to audit the cost of running a customer and maybe there are some gamers there. We're not going to. I don't compute. It's it's not we're not designing. We don't need to use it.\n\n We're just mapping storage.\n\n[Noumaan Shah] (2025-10-28T17:09:54.257Z)\nWe ran into this issue some time ago. So I remember from Influitive, when we acquired Influitive, I did a special, I started paying more attention to this and we started doing like onboarding, offboarding. I actually wrote the offboarding playbook for Advocate Hub. But I didn't write one for PostBeyond. I don't remember why I didn't do it for PostBeyond. That was like three years ago. I don't know why I didn't write one for that.\n\n Know that I wrote one for Africa. But even that doesn't capture whatever dashboards are written by professional services, for example.\n\n[Dragos Nuta] (2025-10-28T17:10:32.277Z)\nI don't want to capture that. I think that PS should capture that. I'm sorry. We should capture that there is something linked to an artifact.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:10:40.682Z)\nHow do we even know? How do we even know that there is something?\n\n[Dragos Nuta] (2025-10-28T17:10:44.244Z)\nIf you're doing import, you still have people around who can still ask some questions. I'm saying that's all like whatever to some extent but I know money in the grand scheme of things They tell you that I'm no longer. I I'm no longer a fan of offense being done by central. I know I'm kinda like taking a tangent I Remember I was saying we should not do offense in central and I was like, you know, you're the boss sure we'll do it as your way But I actually don't really think that and like half of me was like torn.\n\n We should not do offense in central Not because we suck at it, not that we are great at it either, but because BUs are so incapable of creating or whatever, maybe they are capable.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:11:29.370Z)\nI'm not adding a new feature.\n\n[Dragos Nuta] (2025-10-28T17:11:31.890Z)\nI know. I'm landing there. The process that puts us in contact with customers, that create a customer feedback loop is so broken with central VLBU and the customer, that we have zero chances, even if we would be awesome at building AI features or offense features in general. It's so broken that we have zero chances. The same goes with PS. The likelihood of that process working in us doing something on PS to help them out is so low that I would just say, cut my lessons.\n\n That's where the boundary stops. I'm not doing that. But I will make a function call to tell you that you need to give me this process, procedure. Is responsible because they are doing the PS stuff.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:12:11.090Z)\nWhy even make a function call?\n\n[Dragos Nuta] (2025-10-28T17:12:15.242Z)\nWhat is ability? What is ability? That's all I got. But the split for cleanup should say like, this is the...\n\n[Noumaan Shah] (2025-10-28T17:12:20.746Z)\nNo, because that might change as time goes on. Can have, it's like a bunch of cowboys, right?\n\n[Dragos Nuta] (2025-10-28T17:12:27.251Z)\nNo, sure. I mean, like, I would point to a document that's empty. I would define that that is a function call. It's a non-blocking function call. Capture things here. We'll reference them, but we're only doing central. For clarity, you'll actually be able to trace through but I don't know more than that or not even that and I'm not going to have I can do a stub and then but I'm not responsible for making sure that data is correct or valid or anything like that it's a I don't know right it's a UDP call I don't know what's happening there I broadcasted the message hope it works I'll tell you a UDP story one of these days All right.\n\n But then again, I think that this thing with the data coming up and whatnot, sometimes it is a problem. Sometimes it's not a problem. I didn't buy that. Probably run it with others eventually. Knowledge that, yes, that's all like 10K. You save money by not paying Twitter, but not by saving 10K in storage.\n\n[Noumaan Shah] (2025-10-28T17:13:36.915Z)\nSo then do you want to, do you want to, what about customer, uh, customer costs or cost per customer? I should say, should we do that?\n\n[Dragos Nuta] (2025-10-28T17:13:46.662Z)\nI think so because it forces us to understand who are the active customers or at least I didn't get somewhere as the active source. I think so. Decisions on how my, how you map price to compute or something like that. I mean, like it'd be good to have some simplifying frameworks.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:14:04.817Z)\nOf course.\n\n[Dragos Nuta] (2025-10-28T17:14:05.237Z)\nGuiding as you go.\n\n[Noumaan Shah] (2025-10-28T17:14:07.158Z)\nBut this is something that we should then feed into CPM for S2 and for Bogdan, right? I mean, no?\n\n[Dragos Nuta] (2025-10-28T17:14:12.079Z)\nThe CPM to be used for renewal, to your point, it's good material. Some views will be like, that's amazing. Some views will be, I don't care. Like, it's amazing how Eric is actually operating so differently than Kathy. And Kathy is operating significantly different than DR is also. Like, more aligned, right, due to the reporting line, but still there are gaps. There are differences, right, in how All TPM work differently.\n\n\n\n[Noumaan Shah] (2025-10-28T17:14:36.621Z)\nSo I mean, I'm not surprised that CEOs work different.\n\n[Dragos Nuta] (2025-10-28T17:14:42.385Z)\nThe first version of this should not be somebody works on this for one week. It's more like we know how to map the storage cost, and maybe we know how to identify the biggest compute. We are spending the time to map the biggest compute cost. Something like that. Whatever simplification you think is most, it's as bang for the buck. But that's not a spade that you want to spend more than one day on plus some allocation to DevOps, right?\n\n\n\n[Noumaan Shah] (2025-10-28T17:15:10.692Z)\nSo therein lies the challenge. It's less of a finding. You can look at the compute cost and say, okay, you can even make a simplification. All compute cost is the same across all my customers. Just divide it. And you can say for the database, let's just divide it based on the storage per tenant. Very simple decisions. That's less than a day's work. That's not the important part. Where it gets complicated is when you have like 10 different vendors, and then you're trying to figure out each vendor's access and how it gets divvied up.\n\n So for example, for Tivian, there's one vendor for SMS, another vendor for email, another vendor for...\n\n[Dragos Nuta] (2025-10-28T17:15:54.832Z)\nI think you're picking up that SMSs were free for all, or they were anyway charged by volume, or how was it on Tivion? What's the distinction here? When you buy a company, sometimes they are pricing per unit, per debt unit. So they have naturally the mindset to measure per customer usage.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:16:14.514Z)\nNo, not always. No, some resources.\n\n[Dragos Nuta] (2025-10-28T17:16:17.196Z)\nI mean, some resources. And some others, they are blindly. They are saying, we just enable that feature, hope it all turns out.\n\n[Noumaan Shah] (2025-10-28T17:16:22.000Z)\nNo, it's even worse. So for example, for CloudSense, they had in the contract, will charge certain customers per API usage. So let's say you get 100,000 API calls per year on a particular component in Cloud Sense. They didn't even measure the usage, so they didn't know how to bill their customers, even though it was in the contract. So when we bought the company, we added a measurement dashboard after that, and then we gave that tool to Todd and Mark so they can actually see the usage, not use a file This is like an internal dashboard and then they could use that to go and build the customers, you know, so not always Yeah, I don't know.\n\n\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:17:02.980Z)\nI don't know what your take on this is.\n\n[Noumaan Shah] (2025-10-28T17:17:04.662Z)\nMaybe you want to take the biggest vendors All I'm saying is that I just want to make sure you're aware that this is not a one day two day activity Actual work times probably a week Warren time might be a lot longer to get authentication access controls and all that the stuff in place.\n\n[Dragos Nuta] (2025-10-28T17:17:26.122Z)\nIt sounds like an expensive thing that I'm not sure if it's paying off. I don't know. If you start working on it, maybe you can find the simplification thing. I don't know what to say.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:17:35.608Z)\nFor AWS compute, I already told you, it's very easy.\n\n[Dragos Nuta] (2025-10-28T17:17:38.529Z)\nNo, I hear you. I hear you. Maybe for vendors, it's just like start with the vendors that are above some threshold or something like that.\n\n[Noumaan Shah] (2025-10-28T17:17:52.487Z)\nWhat else? Did you see Kayako release process spec? I don't know if I should...\n\n[Dragos Nuta] (2025-10-28T17:18:00.989Z)\nDefinitely the release process spec, you know, the import process is lacking all the time. It was added in Vivian, then in Cloud Sense, then in... Coros even has it as well, but not the import. That's another thing. Where's my notes?\n\n[Noumaan Shah] (2025-10-28T17:18:23.503Z)\nThis is an action item out of an RCA, but I wanted to... Every product should have a release process.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:18:41.275Z)\nWhere am I looking?\n\n[Dragos Nuta] (2025-10-28T17:18:44.498Z)\nLet me share my screen. OK, I'm there.\n\n[Noumaan Shah] (2025-10-28T17:18:46.639Z)\nI'm there.\n\n[Dragos Nuta] (2025-10-28T17:18:47.440Z)\nSorry, I even got to open.\n\n[Noumaan Shah] (2025-10-28T17:18:49.342Z)\nNo problem. It's OK. It's OK. Don't worry. All right. So two things that I'm a little concerned with. One, I wrote critical issues, right? If no critical issues are logged, the release is automatically promoted. So what's interesting to me is from the SAS, again, Just a general comment, nothing about Andrei. I want to make sure we have a prompt so that we understand what a SEV1 is. But again, his point is SAS has different things, CS uses a different thing.\n\n\n\n[Dragos Nuta] (2025-10-28T17:19:28.574Z)\nI don't really care. It has to do with customer impact, not with internal team benchmarks. I would ask Kevina and Collie if they have a good description because it seems like there should be a prompt. Even Khoros, Khoros SLA, Service Level Agreement, and if you go to Khoros SLA, they have a good start with that. It's not a bad one, to be honest.\n\n[UNKNOWN_SPEAKER] (2025-10-28T17:20:00.129Z)\nThe prompt?\n\n[Dragos Nuta] (2025-10-28T17:20:01.410Z)\nNot the prompt, I mean the description. With those descriptions, there you have the severities. Those are different. Sorry, those are decent.\n\n[Noumaan Shah] (2025-10-28T17:20:11.237Z)\nSure, send it to me. I'll take a look. But central should have something that defines whatever their classification is. Could be overridden by product, but there should be something that classifies it. And then there was this comment to implement And and he's saying that there are no devops Kanban orders for kayako in q4 There are no devops Kanban for kayako in q4, okay? So then we So then we don't do automated promotion they do this manually If that's what they want to do it, they don't want to write an automation.\n\n Sure I'm not gonna change the rollback process and I'm not gonna change the process, whatever it is.\n\n[Dragos Nuta] (2025-10-28T17:21:01.955Z)\nThat's the deployment process. You get the DevOps to automate, but you get to ask them to do the work manually. So yes, if that's what fancies them, go have it your way.\n\n[Noumaan Shah] (2025-10-28T17:21:14.438Z)\nAll right. I'm sorry.\n\n[Dragos Nuta] (2025-10-28T17:21:18.220Z)\nThis is really, I just think that this is the plastic problem with the BUs trying to be cheap and optimize a lot of cost.\n\n[Noumaan Shah] (2025-10-28T17:21:26.322Z)\nI understand why they are doing that it's a it's a crude reality no but then it's also weird things no but we should have like a central devops we should have a central person for devops work why don't we have why I understand the views have to have that but why don't we have a concept of a central devops we have so devops is organized in two ways there's an AI devops that's like No, no, no, ignore the name.\n\n\n\n[Dragos Nuta] (2025-10-28T17:21:58.065Z)\nI'm telling you what includes the AI DevOps. It's basically shared DevOps, or I would call it the uptime service. In this AI DevOps, what you get is a pool of DevOps people that know your product to different levels, of course, and they can jump in on the more complicated issues and make sure deployments are done, all releases, all deployments. Because it's a shared pool, And you only get a small slice of that, right?\n\n They are limited in what they can do. They can do some work, but ask them to do be busy for three weeks. And they'll be like, fuck you. I can't do it three days in a row, but they can do minor improvements. They can. How is that price? I don't remember something like 20 K per quarter per product.\n\n[Noumaan Shah] (2025-10-28T17:22:41.699Z)\nI think we have 25% overhead on top of any AWS. That is what it's supposed to cover. That is the 25%. I hear you.\n\n[Dragos Nuta] (2025-10-28T17:22:51.614Z)\nI hear you. I think I want to go there. I'll tell you in a sec. I discussed that with Colin. I told this to David Harper as well. Colin insists that that money goes away on taxes, which I'm not buying because taxes are separate and they will compensate with other taxes and whatnot. And they go away on support shares and whatnot. I don't think so. But then again, what What should I do? Go audit their records?\n\n In a sense, I'm seeing it just as I'm seeing. I'm going to give you an example, and then you can tell me what you think. Now that will change my mind. Crossover, you know what's the biggest cost, vendor cost, or service cost in the Crossover view? Central support. I'm paying $2 million for central support in Crossover. Do you really think that Crossover and then, like, okay, 50,000 candidates per week with AI, and sure, the few contractors, like 3,000, would warrant a cost of $2 million.\n\n So I've had that battle for two quarters. Eventually I realized that this is just Joe's money moving from left to right in ways that only finance and the CF, the core function owner, have agreed or disagreed or whatever to do.\n\n[Noumaan Shah] (2025-10-28T17:24:12.005Z)\nThat might be fine, but then we say, okay, then that 25% charges for something else.\n\n[Dragos Nuta] (2025-10-28T17:24:20.099Z)\nYeah, I think it's worth clarifying what that includes. Yes, that's definitely the case. Like, maybe it includes nothing. It's like a penalty. It's like Joe's pocket money. Sure, sure. But to your point, some clarity on what that includes would be good. Yeah, okay. Let's make that a side goal of this quarter that will close the goal with a clearer definition. Because I understand the AI DevOps terminology.\n\n I would have called it up time as I told you and the other type of those services where you rent bodies, right?\n\n[Noumaan Shah] (2025-10-28T17:24:50.922Z)\nAnd for that I'm kind of surprised that they are saying it's an AI DevOps and if it is so it's for uptime Why can't this work be done by that person?\n\n[Dragos Nuta] (2025-10-28T17:24:59.428Z)\nand Because you rarely people rarely order those like chorus ordered some Jigsaw didn't order any Because people don't order them It's almost the same as TPM and CDO service confusion, right? So you're expecting that to be absolutely everything. And I was like, no, look, there are some things that have to do with the company. It was my attempt. I don't know whether it worked or not. But that was my try, my attempt to create clarity.\n\n Sometimes you just need TPM time. It's not infinitely scalable. That's why you're saying I need somebody to look up, offer this product, help me out and whatnot. Sometimes they order it, sometimes they don't. What will you do?\n\n[Noumaan Shah] (2025-10-28T17:25:53.173Z)\nI don't know. Maybe we should say that if there's an active Kanban order, a DevOps must always be aligned or basically...\n\n[Dragos Nuta] (2025-10-28T17:26:00.820Z)\nYou as a TPM work with the BU and coach them to order. For example, DR did order some at some point. You did have Cathy order one for the...\n\n[Noumaan Shah] (2025-10-28T17:26:11.230Z)\nRight. Yeah, because I told Colin the amount of work and he understood that it's... Yeah. Actually, that reminds me, there is still going to be an export work here. So why the fuck are they saying they don't have a Kanban order?\n\n[Dragos Nuta] (2025-10-28T17:26:27.318Z)\nI don't know. Want me to check? Q4, do you have the file? Keep that super transparent. Q4, 25... And burn to 425, okay? So there is a Jive Ops orders. Only Jive and Khoros order that, nobody else.\n\n[Noumaan Shah] (2025-10-28T17:27:01.132Z)\nHow did the BU miss it? Oh, I missed it then. There's no password or a month or anything like that. I need a person for one week.\n\n[Dragos Nuta] (2025-10-28T17:27:18.082Z)\nI think they'll do it, but just I'll call in slash Kavina and they'll make their own choice.\n\n[Noumaan Shah] (2025-10-28T17:27:28.389Z)\nThere's an export for Unipart coming. You know this, right? I wanted one week for engineering time. That's what I got for her to buy. I want to make sure we have a DevOps person. And maybe we do that once the contract gets signed. It's not signed yet.\n\n[Dragos Nuta] (2025-10-28T17:27:51.492Z)\nBy the way, that's another weird thing that when I'm putting myself into Colin's shoes or Davina's shoes, it's another weird thing of our company. You charge for the AWS cost. Well based on the forecast. And if they spend more than SAS, we eat that cost.\n\n[Noumaan Shah] (2025-10-28T17:28:06.121Z)\nYeah, but if you spend less, you make money.\n\n[Dragos Nuta] (2025-10-28T17:28:08.922Z)\nYeah, but I don't think that that's the value of the part with the spend less. I don't know. Anyway, we need to pick our petals, choose fire to start.\n\n[Noumaan Shah] (2025-10-28T17:28:22.966Z)\nNo problem. But you understand my concern there now.\n\n[Dragos Nuta] (2025-10-28T17:28:27.367Z)\nNo, I definitely understand it. We just have to figure out if they're willing to do it. And if not, we'll take it from there.\n\n[Dragos Nuta] (2025-10-28T17:28:34.578Z)\nAll right.\n\n[Noumaan Shah] (2025-10-28T17:28:38.860Z)\nOther burning issues. Sorry, I've taken up almost all of your hour.\n\n[Dragos Nuta] (2025-10-28T17:28:44.083Z)\nNo, and I do have a hard stop in two minutes. Just want to understand how's, you know, other initiatives, insights.\n\n[Noumaan Shah] (2025-10-28T17:28:52.566Z)\nSorry, there's TPM spec writer. I need to check with a lot how he's using it or not and see if he's happy with it or not or if there are any issues. I don't, when it's quiet, I don't like it either. And check with Pablo and see how he's, because I want them to start using it. I'll send you the link to the repo. I thought I saved, but I probably didn't.\n\n[Dragos Nuta] (2025-10-28T17:29:21.058Z)\nYou know, I think you said you want to give it a bit more time and then I don't know, I don't remember why, but you said that it's...\n\n[Noumaan Shah] (2025-10-28T17:29:27.591Z)\nYeah, it's fine. There's never a good... You never... I'm not going to look for perfection. This is the current state. There will be improvements coming.\n\n[Dragos Nuta] (2025-10-28T17:29:38.299Z)\nYeah, I think I had some more topics, but let's take a rain check and do it later this week once I can wrap my head around that.\n\n[Noumaan Shah] (2025-10-28T17:29:48.848Z)\nSent you the file so you can play with it. So yeah, you start the plugins and Yeah, it's a plug-in and Use whatever you are you want to use set up a for them should be hive What what's the SP hard for? To connect to effort. Okay at first where you you throw yourself, right? Yeah, and any other knowledge base And then the code is in your local repo. I was thinking I could do a github mcp connector as well.\n\n\n\n[Dragos Nuta] (2025-10-28T17:30:24.463Z)\nIt doesn't really matter No, I think that mcp. I don't know my my theory. I'm not the expert here is that Local access to those resources will enable Cloud call to make better decisions than giving it an mcp to not always know what function calls to make and whether it's good enough or retry or what else is there No, it's not too bad.\n\n[Noumaan Shah] (2025-10-28T17:30:48.816Z)\nThe problem with MCP is the overhead and the connection time and the amount of tokens and all the rest of the stuff that happens. You can't do an analysis ahead of time. So for example, if you use cloud code and you use regular cloud code or a cursor, you're doing like a find rep, right? If you use a plugin, you can use a plugin to build like reflects an AST tree and then do a search using an AST.\n\n So stuff like that, you can do locally where as with an MCP, you wouldn't, unless you have an MCP and you have your own MCP that runs on top of GitHub that does the AST for you, then you're quitting that. If you're not doing it, you're going to be looking at the wrong symbols, for example.\n\n[Dragos Nuta] (2025-10-28T17:31:36.780Z)\nIt's going to take you a lot longer. So what's this thing with available models in effort? Tell effort what LLM to use for the search. How does that work?\n\n[Noumaan Shah] (2025-10-28T17:31:48.753Z)\nBecause it's a parameter that you pass right enough for you. You can select whatever models you want, right? You've enough for you say you want GPT 5 then there's also super response that comes in where it combines the responses from multiple LLM I'm super excited to give it a go."}