{"transcript":"# David/Dragos CO Khoros\n\n## Topics\n\n\n## Transcript\n\n[Dragos Nuta] (2025-10-24T12:30:59.796Z)\nYeah, how do we speed things up?\n\n[David Schwartz] (2025-10-24T12:31:02.498Z)\nDo you have a monitor on your left?\n\n[David Schwartz] (2025-10-24T12:31:04.539Z)\nNo, I have three monitors. I have, uh, no, I put like chat, the chat is in the front of my face and it's like I have the ADD, so it just keeps on distracting me. And then I have two cloud code windows here. This is my browser in front. Um, you know, having a chat with, uh, Chris, um, two separate things. How could we unblock things? And I think, so here's how I see it. So here's just another example.\n\n We're just looking at this big, they have these big, looking at the communities and there are these big disks and the title is migration. And basically these are being used like these pen drives. Okay, I see. What they're doing. It's kind of like a, a place to like, like a storage place to hand things over between teams. And, um, besides being inefficient, if it goes down, you lose all your data and then you have to do the export again, whatever.\n\n So I don't yet have a mechanism. Like this, the savings of doing this quarter are savings where we have to change the way people do things.\n\n[Dragos Nuta] (2025-10-24T12:32:18.843Z)\nAnd I don't yet have, I picked up that smell.\n\n[Dragos Nuta] (2025-10-24T12:32:22.346Z)\nThat's why I want to talk to you about that, because I think that we'll have to work on a solution and leverage more function leads and get the business, create better connections with the business. I picked up on that. So that's the whole conversation.\n\n[David Schwartz] (2025-10-24T12:32:40.640Z)\nHere's a classic example of something that Clodi could do, just as an example.\n\n[Dragos Nuta] (2025-10-24T12:32:45.004Z)\nIgnore Clodi. This is not Clodi. Point number one is approving changes, speed up execution. CloudSense is a very different topic.\n\n[David Schwartz] (2025-10-24T12:32:51.696Z)\nYeah, yeah. To speed up executions...\n\n[Dragos Nuta] (2025-10-24T12:32:59.718Z)\nI mean, like, what's the problem? Which function is slowest?\n\n[David Schwartz] (2025-10-24T12:33:04.380Z)\nOr which pattern is slowest? Once we detect... So there's a whole bunch of, like, a wide net of people, myself included, a wide net of people who are going out there and looking for things, looking for potential. Then you find an area that you want to investigate, and then I write the initial spec, and then Chris fills in some details, and then the CO team, the nine guys, start going and investigating.\n\n And by investigating, that means everything. You have to go, et cetera. Once they come up with, yeah, this is a good idea to do, that's when they start writing the ticket. There's a lot of work then about creating the change request, because basically you have to get it to the point where Dimitri can execute. I mean, he has to write the run book, but he can execute that. He doesn't have the manpower to do all that work.\n\n Um, that's what's been taking the most amount of time.\n\n[Dragos Nuta] (2025-10-24T12:33:54.784Z)\nIt's three DevOps people.\n\n[David Schwartz] (2025-10-24T12:34:00.287Z)\nOh, Dimitri, does he have three DevOps people? Here's an example. I'll give you a classic example.\n\n[UNKNOWN_SPEAKER] (2025-10-24T12:34:04.148Z)\nI'm asking, does he have like three DevOps people?\n\n[David Schwartz] (2025-10-24T12:34:06.009Z)\nHe has three DevOps people. Here's an example of where do you draw that line? Uh, just, just as an example, the, The Cassandra single AZ. So we had the ticket ready. This is $250,000. We had the ticket ready last week. Sorry, early this week, Monday. And Chris wanted me to approve it. And I said, I'll tell you what the problem is. A, you know, how about rollback? How about backup? We have to back up the data.\n\n The ticket's fine. Money's real. The opportunity's real. But there's some details that need to be flushed out. So it was given back to the CO team. You know, could the line be at that point that we've done the research, we've come up with the savings, the low-level details of how you're going to do backup. I still think that that's something that the CEO team should do, because they have better expertise for that.\n\n And then you give that whole thing to Dmitry. Now he creates the runbook and actually goes ahead and takes all the money off the table. Because there's a lot of work to do. That's the actual work. I don't have an exact case-by-case way that line is going. I don't think that's been a delay. The delay's been not kinds of things. The delay's been that worksheet is an example. Here's another issue, the IP addresses, where we had a couple hundred thousand IP addresses.\n\n Here's another one that's going to come up. I'll give you a precursor for next week. So it turns out that there are, I just found this today, there are tons and tons of cases where it's similar to the to the Google worksheet with the demo environments. There are tons of cases where I'd like to turn things off. I don't believe these customers are alive. Is that the TPM? Who does that work? Who gives me the sign-off on that?\n\n\n\n[Dragos Nuta] (2025-10-24T12:35:58.467Z)\nYou're bundling very many things. Can we step back for a second? I think that If you take away execution, validation, identification, validation, execution, I think that your problem tends to be with a sign-off. Let's call it a sign-off review, whatever name you have for that. Here, I can imagine, if you start to slice this problem down, I can imagine looking at this from a function perspective. What function is slowest?\n\n I can imagine it's from what function to even ask for a review because if you ask three people and actually only one has the competency, the three people will be like... The demo environment was only BU, for example. You were barking at three other people for no good reason as far as I can understand.\n\n[David Schwartz] (2025-10-24T12:36:50.046Z)\nI'm agreeing with you, but here's an example. CloudWatch cost is still way too high, way too high, especially And we're going to be looking at every freaking alarm. We're going to have an automation that's literally every single metric that comes out of the system we're going to look at. Now, let's say I want to change the frequency from one second to five seconds, or I want to get rid of an alarm, or I want somebody to go through every freaking alarm.\n\n I'll give you a list. I'll give you a worksheet. What, like 1,000? I want somebody to say, we need this one. We don't need this one. I don't know what they need from the product. And it's OK for you to come back and say, I need all 1,000 of these. But if I can get rid of 200, or I Again, $300,000, because of the metrics, because of everything, because $400,000, of the size and scope and scale. $250,000.\n\n Who's going to, who does that take, who does that worksheet go to? I don't have the answer. It's another error. This, this, but $250,000 want to take off from CloudWatch. These are real numbers. To do that, we're going through their GMDs. There's three things. There was network bytes, there was frequency, there was frequency of custom metrics. Who makes that call whether I need to be taking the metrics every one second, every seconds, maybe 50 seconds.\n\n It's definitely not a compliance thing. That's probably SAS. This one's probably SAS. So I'm saying, but who, who do I give it to, Rahul?\n\n[Dragos Nuta] (2025-10-24T12:38:06.505Z)\nI'm saying, so that, that was probably- By the way, Usman is the DRI on Khoros. I think it was officially, and I didn't see an official announcement, but- He's a good guy. I like Usman. He's a good guy. That he's asking him to do it instead of Rahul and protecting Rahul.\n\n[David Schwartz] (2025-10-24T12:38:23.919Z)\nHe's very responsive. This one's great. I like this one.\n\n[Dragos Nuta] (2025-10-24T12:38:27.202Z)\nUm, I don't know how, how come he's so responsive. Poor guy is responsive on any fucking time zone for years. It's not like, Oh, this year.\n\n[David Schwartz] (2025-10-24T12:38:38.811Z)\nDon't know. So I'm saying it's finding the DRI and maybe the answer is to just send it to the DRI and have them find.\n\n[Dragos Nuta] (2025-10-24T12:38:47.098Z)\nMy view is like, I don't know, but this is my, what is the special case? But if I start segmenting the problem, I can think about who's the DRI, and then what's the expectation, what's the escalation path, or how do you position it? How do you ask? One problem. The other problem is, how do you explain it? And the third problem is, is it production or not production? And I'm sorry, but on that environment spreadsheet, if I would give you a grade, it would be like a five out of You're not even explaining what the fuck you want from people.\n\n I'm not saying that my method worked better. I hope I was right. But after I wrote that email and I messaged Jozsef, he was like, oh, OK, on it. I don't know what it will take. But I think that all of these need to be improved, like selecting who to go to, expectations or escalations, the words that. I don't know. Maybe how we explain the problem is like a change of proof. Why is this important? You're saving so much money.\n\n It means that decision you need to make seems to be along the lines of that. And the other one is like production or non-production because actually it's production, non-production, not even product cost, like kind of PS and whatnot. So I think these segmentations need to be done. Once you have that, I think that there should be a one per week, 15 minute mandatory presence with each function.\n\n[UNKNOWN_SPEAKER] (2025-10-24T12:40:15.337Z)\nYeah, HDRI.\n\n[Dragos Nuta] (2025-10-24T12:40:18.340Z)\nNow, the only reason for waiting for that call to not bash them, and I'm happy to go bash them in that call, is if you actually have a lot of questions and they are not answered. It's a shitty job, so that's why you can't approve it. Otherwise, you should approve it meanwhile. But OK, we're also putting like a 15-minute everything, twice per week. Twice per week, because like once per week is like two.\n\n It's not good enough. Twice per week with HDRI, only 15 minutes, it's not to approve per se. It's like to discuss why they didn't approve in the first place.\n\n[David Schwartz] (2025-10-24T12:40:49.133Z)\nI like that. I like the, um, I like that.\n\n[Dragos Nuta] (2025-10-24T12:40:52.334Z)\nAll of these need to be defined. Like, for example, I'm not, I don't understand the change request process right now. Does everybody need to approve? Do you need a mechanism to get approval to the change request?\n\n[David Schwartz] (2025-10-24T12:41:04.719Z)\nOr are you currently like, uh, currently the change request has three approvals, you know, SAS engineering and, um, non-engineering, uh, BU, TPA.\n\n[Dragos Nuta] (2025-10-24T12:41:14.192Z)\nAnd- Here's a proposal.\n\n[Dragos Nuta] (2025-10-24T12:41:15.693Z)\nLet me throw an idea at you. For example, this thing with the demo environment. The decision maker is the BU, but the change needs to still be approved by three people. This is an example where whomever you propose the business case to is not the same as the change request approvers, and the change request approvers will happily approve it if they understand what the problem is, even if the owner actually signed off.\n\n Same goes on your IP. The approver from the... I don't know how to call it. I think it's an approver, right?\n\n[David Schwartz] (2025-10-24T12:41:53.977Z)\nIt's a decision owner, whatever.\n\n[Dragos Nuta] (2025-10-24T12:42:00.519Z)\nDecision owner. The decision owner is SaaS on CloudWatch, but you still have three people approving the change. But when it hits them, it should come as already reviewed by a decision owner, DevOps, yeah, you'll have another box to check or even maybe it's checked automatically, so TPM will be approving more streamlined because, oh, that's not something I worry, I don't see any, it doesn't feel to me that, I don't know, David or the team or the decision owner has any, I know, blind spots, so I don't need to spend more time, I also think that it looks good, so I know, sign off.\n\n Because otherwise, be another reason why you're seeing delays. Maybe each of these people actually thinks that they need to approve the full change as opposed to knowing the decision maker has approved. I'm just like the safety net, just in case anybody missed something.\n\n[David Schwartz] (2025-10-24T12:42:49.690Z)\nYeah, that's another good point. I'm just looking to see.\n\n[Dragos Nuta] (2025-10-24T12:42:59.235Z)\nNow, I don't know if a super old school thing, such as a spreadsheet that has a business description, a decision owner, and a list of tickets, if you want to go look at the evidence and whatnot, because sometimes there's more than one ticket, I assume. We think we need to model it from a... Not from a ticket, but the tickets are way too tactical.\n\n[David Schwartz] (2025-10-24T12:43:24.419Z)\nYeah, I'm agreeing with you. I'm just showing here, this is the high-level snapshot. So this is the most troubling to me. This is also- What are you showing? You don't see my screen?\n\n[Dragos Nuta] (2025-10-24T12:43:38.999Z)\nI see, but it's a chat with Chris. Is this what I need to see?\n\n[David Schwartz] (2025-10-24T12:43:42.001Z)\nOh, no, not that one. It's the wrong one. That's fine. I'm not having that thing to hide. This is wrong. It's not what I wanted to show you. I wanted to show you this window. Maybe this window. So there's two things on this board that trouble me. I look at three things. This is done. I look at how big this is getting, and this has to get bigger by $250,000 or more every week. So far, that's been okay.\n\n This troubles me. I'm gonna do a deep dive here. This means that this money's blocked, and this money means This is money that Dimitri is working on. This is money that has been approved. This and this should be here like now, right? And then this over here is, this is a pretty good ratio, 14,000 rejected out of like a million. It's pretty good. But why is this pending approval? So then I have to go to this one over here, right?\n\n So then I go to the pending approval. Let's go into, This one. This is an example. And I can see here who needs to approve it. Let's see the CR. Oh, there's no CR yet.\n\n[Dragos Nuta] (2025-10-24T12:45:03.119Z)\nThen who needs to approve it if there's no CR?\n\n[David Schwartz] (2025-10-24T12:45:08.042Z)\nOh, did he change the... Let me see my... Oh, so he changed... That's why it's in here. Okay, he just changed it. This just means this is being worked... No. No, if it has a number, then it's on the board. I need to dig with Chris. I think he changed my, I had a review and credit rule. This money should be in this bucket over here, right? Approved means there's nothing blocking it. So it was approved.\n\n Yeah, MSK, Kafka. So this has been approved. And this ticket, oh, here, so here's the, Okay, so here's the change request, that's what I wanted to show you. So if I come into the change request, you'll see in the change request, it's assigned to Dimitri, but then down here, you'll have, oh, so three approved, okay. That other money wasn't approved by Mohamed, Pablo, the TPM, and Compliance, those are the three.\n\n And once these three are approved, then it now do it, right? So, Dimitri now has, if I go back to this board over here, so if I go back to what I was trying to say, this money should have, this is being worked on, this money hasn't been been picked up. There's $200,000 here that just should go away. How do I unblock this? I don't know. This is Dimitri and his three guys. And I maybe should go back to having dailies with Dimitri to see why this is being blocked.\n\n\n\n[Dragos Nuta] (2025-10-24T12:46:55.893Z)\nOh, definitely don't drop the dailies. Why would you drop the dailies?\n\n[David Schwartz] (2025-10-24T12:46:59.755Z)\nWell, the first two weeks we didn't have enough tickets. Now we have enough tickets to have the dailies. We don't have tickets in the back. I'll sign up again on Monday. This pending approval is more concerning to me. So let's take one of these tickets. I'm trying to figure out like who this is 350k and if I want to figure out It's also low. Oh, here's a ticket. Okay, so here's where TPM approval unassigned.\n\n What the flip? Okay, this is probably just felt through. I don't know why this is not. Was this CARE communities? Was this Milad? Who's in communities? Or is that Pablo? That was probably automation. Okay, so there may be some automation, I think, Some of this is process. A lot of this is automated. So you see the process. It goes, you get the approvals, and then it moves in, and then it moves to Dimitri.\n\n So it's beginning to flow well. I think we may have just a bug. I think that's maybe just been an automation bug, because there's no reason that it shouldn't be assigned somebody.\n\n[Dragos Nuta] (2025-10-24T12:48:34.457Z)\nAll I see is that the last quarter was amazing, and now you're limping badly. And that's why I'm not happy yet ending this call, no idea what will change anything. It doesn't seem to me that the root cause is clear. I understand some actions like doing dailies and having every two times per week a check-in with the DRI, and that you can cancel if there's nothing that they need to do. Sure, free up their schedule.\n\n Why not? Those are good, but I'm not sure that this will solve anything?\n\n[David Schwartz] (2025-10-24T12:49:14.279Z)\nThe only answer I have is that there just wasn't enough ticket flow until now. Only three weeks into the quarter. Now we have tickets flow. Now we have a lot of tickets flow.\n\n[Dragos Nuta] (2025-10-24T12:49:22.962Z)\nI remember when in the last few weeks of the last quarter, we didn't execute much because you said you want to prepare a backlog.\n\n[David Schwartz] (2025-10-24T12:49:29.703Z)\nNo, but then all those people were taking off. Remember we had a fire sale where we had to change the numbers and get more numbers for Q4, Q3. Those guys, they didn't start preparing. And the combines weren't. We had to do the dash for the CO combine for the 600K over there. But also we didn't have the combine staffed. We didn't have the nine people. We only got the nine people staffed week number two of Q4.\n\n So everybody was fully staffed the week number two. Then it took them a week to come up to speak. And then they started with the specs have been written. I'm just saying now we're in a good cadence. I think that we have one more week end of the first quarter, first month, I think we'll have a much better story by next Thursday. Like a much better story, because it's been, the pipeline's been flowing.\n\n There's little hiccups, like you saw there, that there was somebody unassigned and that was holding up that ticket, but that's it. I'm going to ping Mila now, and I'm going to get him to approve that, and that's more money that goes into the, into Dimitri's bucket. And then why Dimitri's not taking off the board, that's a different conversation. I think it's just been we haven't had enough ticket flow.\n\n The tickets are much more complex. The tickets this quarter are really going deep.\n\n[Dragos Nuta] (2025-10-24T12:50:47.606Z)\nAnd it will just get worse. Next quarter will be even worse.\n\n[David Schwartz] (2025-10-24T12:50:53.391Z)\nWe're going where we have to dig deep. Look at the complexity of every one of the tickets that we're generating this quarter. Look at the specs. They look so much more complex than the specs we had in the first quarter.\n\n[Dragos Nuta] (2025-10-24T12:51:05.867Z)\nFirst quarter was... Give me the board or whatever it is. I don't know where to look for the specs.\n\n[David Schwartz] (2025-10-24T12:51:12.848Z)\nIt's just in GitHub. They're all in GitHub. I'll show you the boards that we have. We have a bunch of boards. We have a spec board. I'll send you a link to the spec board.\n\n[Dragos Nuta] (2025-10-24T12:51:23.773Z)\nSo what's your... Do you have your... Do you know what's your input or your port? Report this week for the Jamie and the Erics of this world? I guess it was the weekly TPM. My report is that, um, I believe we will, we're halfway through in terms of, in terms of metrics, like it was 600 something K right this week. Uh, something. So that's 60%.\n\n[David Schwartz] (2025-10-24T12:51:57.861Z)\nYeah, a little bit over a million, but that was going up to 750 already.\n\n[Dragos Nuta] (2025-10-24T12:52:02.244Z)\nWe should have been at, well, we should have been like 750 and we are 60, right?\n\n[David Schwartz] (2025-10-24T12:52:06.807Z)\nBecause we're more ready. Hold on a second. We're ready more than we were. I have to do my math again.\n\n[Dragos Nuta] (2025-10-24T12:52:13.291Z)\nThis is, this is week three, isn't it? November was on. No, no.\n\n[David Schwartz] (2025-10-24T12:52:22.576Z)\nI'm saying, but yesterday's report was like Thursday and I'm saying, by the end of the week, or Friday, between yesterday and today is another $100,000 on the board, is what I'm trying to say. So I'm saying- Well, we'll spend a few minutes to update that as we close.\n\n[Dragos Nuta] (2025-10-24T12:52:38.461Z)\nBut I think this is week number three, so you're supposed to be at $750,000, or are you counting that week that only had two days or three days too?\n\n[David Schwartz] (2025-10-24T12:52:46.967Z)\nNo, I didn't count the first week. Also, we didn't get people up to speed.\n\n[Dragos Nuta] (2025-10-24T12:52:50.650Z)\nOkay, let's count week number three, $750,000. I think Oh, you have 12 weeks. So you need 12, then you have 3 million divided by 12, right? So you need, you should have been like 750 and you're like 650.\n\n[David Schwartz] (2025-10-24T12:53:17.179Z)\nI think we're closer to 750. Hold on a second. I'm serious. I need to find my. Turn exactly with the numbers in a minute. Tali, can I call you in five minutes? OK, bye-bye.\n\n[Dragos Nuta] (2025-10-24T12:54:03.293Z)\nI was not expecting to answer in English.\n\n[David Schwartz] (2025-10-24T12:54:06.314Z)\nOh, I talk to all my kids in English. They speak color, whatever. They're all American.\n\n[UNKNOWN_SPEAKER] (2025-10-24T12:54:12.996Z)\nYou mean like they are in the US? They live in the US or what?\n\n[David Schwartz] (2025-10-24T12:54:14.937Z)\nNo, no, most of them were born in the US. Hold on, wait a second. Yeah, it's probably this one. Okay, here we go. Okay, hang on a minute, the numbers are...\n\n[Dragos Nuta] (2025-10-24T12:54:51.744Z)\nI need to drop, just to update it weekly.\n\n[David Schwartz] (2025-10-24T12:54:55.406Z)\nGive me 10 seconds, give me like 20 seconds. It just takes time for it to run through all the scripts. Okay, so we're not terribly off track, but we are off track. I put off track, I didn't sugarcoat that, but we're not like way off track. We're like, and we're going to, I believe we're We'll catch up by the end of next week. So the next week will be over a million.\n\n[Dragos Nuta] (2025-10-24T12:55:19.686Z)\nAnd are you applying those changes? Like, do you think it's worth doing a DIA call? There are three takeaways. There's no reason why the daily should not come back. I think that you should have more articulate explanations when you escalate. Not generic, not feels like they need to do 30% of the work to figure out what they want from them. And then, I don't know. Per week, twice per week, depends on how often you're blocked on the call.\n\n The purpose of the call is to review anything that's blocking or review why there are blocks or delays, and the call is being cancelled if there's no agenda. I'll start implementing.\n\n[David Schwartz] (2025-10-24T12:55:57.475Z)\nI'll invite you to vote. If you want to come, you can come optional. I believe we'll be back on track by next week.\n\n[Dragos Nuta] (2025-10-24T12:56:10.432Z)\nchanges being harder, that is a problem, and you'll face more of that.\n\n[David Schwartz] (2025-10-24T12:56:16.677Z)\nAh, 700. We're at 700. We're at 701.\n\n[Dragos Nuta] (2025-10-24T12:56:25.683Z)\nAnd you need to articulate the cost increase.\n\n[Dragos Nuta] (2025-10-24T12:56:28.505Z)\nYes, and that is something that...\n\n[Dragos Nuta] (2025-10-24T12:56:30.286Z)\nFor this weekly, so the weekly should basically say, we saved 700, but guess what? Cost has increased by X. Roughly, I don't know some number pop due to that some number due to that and some number is on this type of service But it's unclear due to whom and no I'm not expected to have answer on anything, but You know, I'm gonna have an answer on that.\n\n[David Schwartz] (2025-10-24T12:56:52.716Z)\nBut anyway 700 with the document you have an in front of you Hold on quickly TPM something Yeah Yes, so the number is 701 currently.\n\n[Dragos Nuta] (2025-10-24T12:57:22.080Z)\nAnd the increase? Can you list the increase here?\n\n[David Schwartz] (2025-10-24T12:57:25.263Z)\nI don't have the full report. Next week I'll give a full report for the month and for Can you broad strokes estimate that?\n\n[Dragos Nuta] (2025-10-24T12:57:37.979Z)\nLike, but some 2, 3, 400, what's that? Even if it doesn't have a cost, it's just there's a number.\n\n[David Schwartz] (2025-10-24T12:57:49.349Z)\nI know that.\n\n[Dragos Nuta] (2025-10-24T12:57:52.612Z)\nI guess you can just look at the cost of the start of the quarter, minus 700. And that's just a number. There's no cost. But cost has increased by x. And next week, we'll figure out what are the cause drivers. But let's put the numbers. I don't want a misleading statement that says we say 700. But for some reason, actually, net is zero.\n\n[David Schwartz] (2025-10-24T12:58:18.379Z)\nSo the active pipeline went up.\n\n[Dragos Nuta] (2025-10-24T12:58:29.501Z)\nOkay, so you're right here, how the cost increased? With what amount?\n\n[David Schwartz] (2025-10-24T12:58:36.246Z)\nThe problem is that I was bad to log off. Can this be done on tomorrow?\n\n[Dragos Nuta] (2025-10-24T12:58:41.069Z)\nOkay, sure, sure, sure. I'm not saying now, but for Monday, can we do this? Yeah, yeah, yeah. Just add it and leave a comment, just to me and Pablo. Hey, I did this detail. It doesn't burn anything right now. Okay, thank you. Okay, bye-bye.\n\n[David Schwartz] (2025-10-24T12:58:58.813Z)\nto them. Thank you. Okay, how was how was the\n\n[David Schwartz] (2025-10-24T12:59:52.623Z)\nSo spicy."}