{"transcript":"# Dragos / Anirudh\n\n## Topics\n\n\n## Transcript\n\n[Dragos Nuta] (2025-10-27T08:17:46.436Z)\nThank you. It's, uh, it's, it's simpler, way simpler. And that's awesome. I don't know if that's a problem with me or not, but I feel the need for a data structure that I can Read, you know, like actually on ERD. Color coding them or like putting them in small rectangles saying this is the end point that returns this thing, this thing. The surface area is increasing and we need to look at that and say, Oh my God, I can't wait to build an API that does everything that we don't model.\n\n You just put the entity there. So I think that Lucid, you have, you have currently, you have Lucid access, right?\n\n[Anirudh Bhardwaj] (2025-10-27T08:19:55.379Z)\nYeah, I have access. Yeah, I can still do it.\n\n[Dragos Nuta] (2025-10-27T08:20:02.409Z)\nAlso for higher recruitment pipeline. This diagram, because it also has a lot of other things that... Does it or does it not? Well, it has the interview workflow, which is correct. Where's the data structure, the actual diagram? No, that's not it. No, that's not that. Excel higher data model. This one yeah okay this is what I'm looking for um Okay, you're not here. I'm sure you have access because it's through some groups or something like that, but you're not with the actual invite list, that's all.\n\n Oh, you didn't have a Trilogy account. I guess you have. I guess you have. You can check.\n\n[Anirudh Bhardwaj] (2025-10-27T08:22:30.426Z)\nIt is showing me. No, I didn't have a team access. I probably didn't go to the team.\n\n[Dragos Nuta] (2025-10-27T08:22:39.964Z)\nDiagram, for good or for worse, has, I think, I think, if you look here, it's all campaign analytics and whatnot. I think it has most, if not all, the data model. Ah, fuck. I just put it there, at least it's closer than those. I have a new mouse, and the new mouse is better in some ways, but more annoying in others. I got one of those, I don't know if you know them, very, very weird shape.\n\n[Anirudh Bhardwaj] (2025-10-27T08:23:27.173Z)\nThey play games. Gaming mouse. This is mostly for gaming. People use it a lot.\n\n[Dragos Nuta] (2025-10-27T08:23:39.240Z)\nIt's just for my wrist and for my carpal tunnel, to be honest. So it's important because you have the CMS data model, even if it was at some point in time, the batch data model. You have a lot of things here that are in general correct. Recommended jobs, assessment mentor, the diagram of how vendors communicate. There are API or API. There is an API here. It's very old for sure. Probably outdated.\n\n Probably just an attempt. I don't know. But, uh, We can start from there.\n\n[Anirudh Bhardwaj] (2025-10-27T08:24:23.642Z)\nYeah, we can extend this.\n\n[Dragos Nuta] (2025-10-27T08:24:30.905Z)\nSo what do we need? Let me add a comment box. Sticking out. We need to know, one, objects full versus references. That conversation we've had on the user to have an idea of the name. And I'm sure that that's not the only example, right? Source, Salesforce versus Athena. And three, API endpoint. Well, it's API endpoint technically, but from the purpose of this exercise. I think that this should be clear.\n\n We should figure out a way to encode this. Color coding, rectangles, whatever, like shapes, something. OK, so now we have a pipeline object. I don't know if it's missing any of this. You know the data model better.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:25:33.345Z)\nWe added, I think. Just give me a second.\n\n[Dragos Nuta] (2025-10-27T08:25:37.226Z)\nI know we added the other stuff, but I'm seeing if anything is missing. You have something like last open date.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:25:45.661Z)\nClose date.\n\n[Dragos Nuta] (2025-10-27T08:25:48.102Z)\nLast close date. Close date. You definitely have. Oh, maybe we should just define the shim objects. I said here that objects full versus references. But I think that What should happen instead is that for each large object, we should have, for each large object that can be referenced and you wanted to return, we should have a narrow, right? A shim. And use that. So for example, yeah, you will have a user entity somewhere at some point, but for now we have user reference so that we know it's a reference.\n\n It's whenever it's referred. And then what do you want to include? Like what do you, you only have like, I think you have We have ITD, email.\n\n[Anirudh Bhardwaj] (2025-10-27T08:26:46.554Z)\nEmail I haven't kept for now. I haven't kept for now, but that's my thing. Should we now?\n\n[Dragos Nuta] (2025-10-27T08:26:57.520Z)\nI don't know. It was just an instinct. I don't know. I'm not at the modeling stage. I'm more like, how do we set up the problem surface so we solve it, right? So we definitely have then. Here p.m.\n\n[Anirudh Bhardwaj] (2025-10-27T08:27:19.323Z)\nand p.h.m. Yeah I would use full names because LLMs will not really understand our acronyms unless you teach them that's another rule so I probably would yeah I've used the name in the APIs I've tried using the names which LLM can semantically understand, not.\n\n[Dragos Nuta] (2025-10-27T08:27:43.630Z)\nOkay, so we have this. So arguably, this one returns a thing, sorry, the other way around. So this one is, reference of this, or, oh, I think, let's do that, ref, at least for now. We know that we'll include the reference when we return it. Okay, what other objects are there?\n\n[Anirudh Bhardwaj] (2025-10-27T08:28:25.651Z)\nThere will be, so the applications within the pipeline.\n\n[Dragos Nuta] (2025-10-27T08:28:32.072Z)\nOkay, so we need to model the application itself. So this is application, not job application. So we'll have a candidate, definitely. Probably we start with candidate reference. But at least when you return the application, there's no reason to return the full candidate, right? What else did you add? Let me just get your document on another tab.\n\n[Anirudh Bhardwaj] (2025-10-27T08:29:22.720Z)\nYeah, we had, I think, It should have been an object. So I've put candidate name, candidate ITD, and candidate profile link as three denormalized pointers. But that could have been an object. Current stage of the application is what we need.\n\n[Dragos Nuta] (2025-10-27T08:29:41.510Z)\nProfile, if you're saying?\n\n[Anirudh Bhardwaj] (2025-10-27T08:29:42.911Z)\nYeah, profile.\n\n[Anirudh Bhardwaj] (2025-10-27T08:29:44.793Z)\nI don't think which I should have talked to. I don't think we email ITD. We should profile 360. Will it make sense? Because this was the candidate profile link. I think LinkedIn link in between two, I will always add the profile.\n\n[Dragos Nuta] (2025-10-27T08:30:16.776Z)\n360 link. Think about as you're telling something to the LLM and, oh, let's see them. Let's see the candidate. Oh, you're right. This is not, this is the, you're right. You're right. This is on the application. You're right. It's like, it's a, it's not that it's a bad idea, but it's the, it's the wrong place. Um, yeah, I don't know what to say about that. I have mixed feelings because we don't really have a lot of LinkedIn IP, uh, LinkedIn URLs anymore.\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T08:30:42.894Z)\nYeah, no, I think I'm, I shouldn't have included that as well. I agree.\n\n[Dragos Nuta] (2025-10-27T08:30:47.364Z)\nWe can always add stuff. It's harder to remove because you don't know who's using what. Let people complain. Let people say, I'm going to die for that attribute. Explain me. And then you understand. You're like, oh, I understand your problem, but I would like to do a different solution. Or I like also the solution. Or I'm not doing it at all. And here's why. So I'm a big fan of not just taking everything and just posting it there.\n\n Because it's very hard to remove. It's always hard to remove anything.\n\n[Anirudh Bhardwaj] (2025-10-27T08:31:13.928Z)\nIt doesn't make sense.\n\n[Dragos Nuta] (2025-10-27T08:31:19.990Z)\nTrying to find where do you have that. Oh, right. So you also have the pipeline requirements somewhere here. Which is a combination of I think the pipeline R2 is really a key value there, mapped of all sections.\n\n[Anirudh Bhardwaj] (2025-10-27T08:31:46.997Z)\nThere is one field known as isScreenable in the R2. I skimmed through the code. Basically, I skimmed through the code, and it told me there's a field known as isScreenable within R2 requirements.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:32:05.495Z)\nDo you ever open an R2?\n\n[Anirudh Bhardwaj] (2025-10-27T08:32:08.236Z)\nI had a template which is not live. I had a test template.\n\n[Dragos Nuta] (2025-10-27T08:32:12.017Z)\nThere is a folder where all R2s are. Here's an example R2. Example R2. Look through them. It's a key value pair. And they are technically looking for the R3 tab, probably, at least because it has the, I don't know. I don't know if they need the R3 tab. As long as you have the hourly rate somewhere. You have the title, you have the domain. I don't think they need R3, because R3 is most that is in Salesforce.\n\n But you need the R2 tab.\n\n[Anirudh Bhardwaj] (2025-10-27T08:32:45.423Z)\nYeah, yeah.\n\n[Dragos Nuta] (2025-10-27T08:32:50.385Z)\nAnd I don't think we should do anything more than just build a key value pair of columns B and C, or even B and C and D.\n\n[Anirudh Bhardwaj] (2025-10-27T08:32:58.628Z)\nB, C, D, I think we should.\n\n[Dragos Nuta] (2025-10-27T08:33:01.077Z)\nSo what I'm saying is that don't try to model the rows, because the terminology is clear enough. If you turn LLM, these are the question, what it is, what it is not, you'll understand. You don't have to create attributes. It will understand enough if you say, oh, section title, what it is, what it is not.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:33:24.573Z)\nGot it.\n\n[Dragos Nuta] (2025-10-27T08:33:26.074Z)\nI don't think we need that. So then it's more like a R2, which is a section, what it is.\n\n[Anirudh Bhardwaj] (2025-10-27T08:33:59.249Z)\nIt doesn't show.\n\n[Dragos Nuta] (2025-10-27T08:34:01.872Z)\nIt's not. And this is then, I don't know, like a one-to-many relationship. And I understand why you also have the pipeline JD. And then you can just leave the sections here.\n\n[Anirudh Bhardwaj] (2025-10-27T08:34:29.723Z)\nYeah, I'll do that.\n\n[Dragos Nuta] (2025-10-27T08:34:32.424Z)\nBut this is a one to one.\n\n[Anirudh Bhardwaj] (2025-10-27T08:34:38.787Z)\nNow, this was one thing which I observed and I had a question that I was trying to create a pipeline. Um, why don't, and because I haven't gone through the data, so pardon my naivety, but why don't we have something like copy JD from one role to another, if we want to do that.\n\n[Dragos Nuta] (2025-10-27T08:34:59.460Z)\nBecause JDs are, are, are the JD is just a marketing copy.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:35:07.162Z)\nGot it.\n\n[Dragos Nuta] (2025-10-27T08:35:08.202Z)\nIt's what the important part is the R2. In the R2, you're designing, you're architecting the role. It's not a JD. Is a simple manifestation. You can have a million JDs for the same job. What matters is what you want to hire. I mean, I can definitely create a million JDs out of an R2. And that's how org builders are working today. They have their own. You've seen those prompts that create JDs out of R2s.\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T08:35:33.977Z)\nBut right now, also, they have to put it in the admin one by one in each of the section, right? The various sections of JD, what do they do? What do they don't do? Environment mapping and all.\n\n[Dragos Nuta] (2025-10-27T08:35:47.492Z)\nYour question is, why don't we have like a generate with a button there or something? Oh, OK. It makes a lot of sense. We didn't have the RS2 up until two months ago. So I can imagine how you could now. This is not our blocker. We open 10 pipelines per month. This is not how you save anybody's time or per quarter, right? But I can imagine if you have a button called generate JD and has the R2 and everything else and maybe ask you a few questions and I don't know, whatever.\n\n I can imagine that. It's not our biggest problem by far. It won't solve any blocker.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:36:22.517Z)\nI was thinking from the consistency point of view.\n\n[Dragos Nuta] (2025-10-27T08:36:25.339Z)\nI hear you. It was not possible before because the R2 was not in the system. So you didn't have the root element to generate from We added the R2 because we added the BFQ bot to Read from with the R2. So now we have a reference with the R2, so now we could have done that. What do we have on the application otherwise?\n\n[Anirudh Bhardwaj] (2025-10-27T08:36:44.823Z)\nApplication, just give me a second. We have the application stage for sure. The current The application is in last active stage, applied it. Last activity is something which we can. That would be required for analytics. Last activity date.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:37:26.602Z)\nWould it?\n\n[Anirudh Bhardwaj] (2025-10-27T08:37:28.642Z)\nIf I have to check all active applications in the last 30 days. Last active stage.\n\n[Dragos Nuta] (2025-10-27T08:37:37.644Z)\nIs it based on activity or is on something else like the date when the last when the stage change last time like what's activity when the user click the button and the user go beyond what the words that instinctively come to mind like is it even relevant when the user just lasted an action if you're grading or whatnot this isn't it like the last maybe the date when the change stage the dates that the state change or isn't if is it even important I don't know.\n\n I would honestly add here date of last stage change. And I think we have that in the data model. Like if we don't, then let's not do it.\n\n[Anirudh Bhardwaj] (2025-10-27T08:38:28.362Z)\nAnyways, this came through all the entities that we are not adding anything new. I've got that feedback. So that I'll ensure. Not adding anything new and then if the person candidate is rejected then the rejection date and loss reason we should keep it here only or it's a reference if it's rejected that the stage is rejected you need the loss reason maybe I don't know I think it was.\n\n[Dragos Nuta] (2025-10-27T08:39:07.980Z)\nNow what else do you need? Do you, you definitely need to model, sorry. You definitely need to model, uh, basic interviews, right? Or something like that. And you have two of them. You have the new one that if you open a new BFQ, you'll see a lot has a lot of structures there. I don't know how many of those are useful. Do you know what I'm talking about?\n\n[Anirudh Bhardwaj] (2025-10-27T08:39:37.257Z)\nNo, no idea.\n\n[Dragos Nuta] (2025-10-27T08:40:37.435Z)\nOK, this is a link of a hiring interview. The new version is actually outputting. It's splitting the requirements and whether it was their status.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:40:50.468Z)\nGot it.\n\n[Dragos Nuta] (2025-10-27T08:40:50.989Z)\nAnd the evidence. This one is clearly worth noting. I don't know what to think about these other sections, probabilities, experience, skills gaps, uncertainties, concerns. I would basically ask hiring managers, I mean, like hiring managers or builders, if we were to not add it, how that will affect your work. And if they're like, oh, I don't know. Critical would be to that to your work right that's the question because I just don't know if this is good or not I have no idea maybe it is maybe it's duplicated maybe it's but based on this right you notice how I got to it right you could go and model the I know basic fit questions and answers q and I think Yeah, I think you have here basic requirements, because you have something like requirement, match, status, and probably reasoning.\n\n So this would be an object that is fully encapsulated when it comes through, if it is there, right? And then you definitely would have the transcript.\n\n[Anirudh Bhardwaj] (2025-10-27T08:42:45.420Z)\nInterview transcript.\n\n[Dragos Nuta] (2025-10-27T08:42:48.280Z)\nProbably on demand. I'm not sure if you always want to include, because it's huge, right? Conversation and this is an example of something that clearly comes like oh by the way this is optional it doesn't always come it only comes if you if it's the new version uh at the minimum okay so that's the basic fits object right now what else do you have here probably you have like a ITD state or status how do you call it ITD state pass weak pass fail right pending as well no that was there in the enum Yeah, depending on...\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T08:44:05.626Z)\nThese three make sense, actually. Why would anybody want to go through a...\n\n[Dragos Nuta] (2025-10-27T08:44:09.848Z)\nBecause if you return an application that, if at some point you return an application that did not take the BFQ, what will you return? So I think you still return not started and started. I don't know what to say about pending.\n\n[Anirudh Bhardwaj] (2025-10-27T08:44:24.815Z)\nYeah, it is, I think... Not pending.\n\n[Dragos Nuta] (2025-10-27T08:44:30.008Z)\nYou do have a few. You mean like when the AI is running or something like that, it's waiting for grading is probably just a better name for that. OK, so maybe it takes a lot of space. I don't know if you can model it somewhere. In a simpler way, but that's all. I don't know if they need anything else more than that. Real work and uh assessments rwa I mean no I don't sure of course I mean like for the basic fit for the basic the basic fixed screening is basically is a collection is one or more of this So then you do have an assessment.\n\n What do you have on an assessment?\n\n[Anirudh Bhardwaj] (2025-10-27T08:45:56.158Z)\nWe have.\n\n[Dragos Nuta] (2025-10-27T08:45:56.578Z)\nI don't know if we should call this AI screening or not. I think it would add an important part to the risk of clarity. Okay, so assessment. You do have an assessment ref, definitely. You do want to reference them. And that's ITD, name, vendor. That's not in the assessment. This is the assessment result, right? So this is assessment ref, the reference of it. And then you will have the, not stats, state, or status, whatever.\n\n We call it status probably. Status, just like above, let me just put a note like that and copy them. Status assessment. Status enum.\n\n[Anirudh Bhardwaj] (2025-10-27T08:47:36.289Z)\nnot keep the scores right because the threshold and scores are different for every assessment.\n\n[Dragos Nuta] (2025-10-27T08:47:42.474Z)\nThe score is the same, the threshold is different.\n\n[Anirudh Bhardwaj] (2025-10-27T08:47:45.237Z)\nThreshold is different. Scoring mechanism is different. Code signal does it Percentage is same but the number would be...\n\n[Dragos Nuta] (2025-10-27T08:47:54.284Z)\nYou'd always include percentage. There's no reason to include the raw score.\n\n[Anirudh Bhardwaj] (2025-10-27T08:47:57.266Z)\nRaw score.\n\n[Anirudh Bhardwaj] (2025-10-27T08:47:57.746Z)\nRaw score is different.\n\n[Dragos Nuta] (2025-10-27T08:48:00.608Z)\nI don't see a reason to include the raw score to be honest. Would you add the scores right now?\n\n[Anirudh Bhardwaj] (2025-10-27T08:48:10.864Z)\nI'm not sure, because LLMs mostly are not that good with mathematics anyways. So what would we benefit if we add the score?\n\n[Dragos Nuta] (2025-10-27T08:48:22.551Z)\nUser decision making. Sort a candidate by something. I have doubts. We can also add them right after. Nothing stops us. But if we ever add score, we need to add both thresholds and extract the element and tell it about the gray area.\n\n[Anirudh Bhardwaj] (2025-10-27T08:48:44.930Z)\nYeah, it makes sense.\n\n[Dragos Nuta] (2025-10-27T08:48:48.873Z)\nDo you need a completion date? I don't know. I'm not very sure.\n\n[Anirudh Bhardwaj] (2025-10-27T08:48:53.937Z)\nScheduled date or something like that, for instance.\n\n[Dragos Nuta] (2025-10-27T08:48:57.208Z)\nWe will get to the interviews just yet, right? Interviews have a very different data structure than this one. So now we get the interview, I guess, unless we got something else. Now we have interview, right? Human hiring interview, maybe hiring interview or something. Maybe it's interview.\n\n[Anirudh Bhardwaj] (2025-10-27T08:49:22.772Z)\nwe have here we have interviewer human interviewer say that a human interview or better we are at systematic assessments right both the basic fit and as assessments not sure will that give some additional information to LNM?\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:49:55.196Z)\nI don't know.\n\n[Anirudh Bhardwaj] (2025-10-27T08:49:55.816Z)\nI do not know.\n\n[Dragos Nuta] (2025-10-27T08:49:59.537Z)\nI don't know. Maybe, but the name is awkward, I think. And I don't know. I think we'll just have to try it out. OK, so we have an interview, and then we have a status. The status is It's very different. I guess we can even put it here. The status is really, well, it's not very different. It's actually the same status.\n\n[UNKNOWN_SPEAKER] (2025-10-27T08:50:28.940Z)\nWeak pass won't be there, I think.\n\n[Dragos Nuta] (2025-10-27T08:50:31.161Z)\nYeah, except for the weak pass, everything is the same. But you do have something in the interviews, which is that summary you get from the AI grading bot.\n\n[Anirudh Bhardwaj] (2025-10-27T08:50:52.684Z)\nSo actually, should we keep both their status as well? Status and if we have to do comparison.\n\n[Dragos Nuta] (2025-10-27T08:51:08.749Z)\nSo we have a decision, a reason, and the gaps in requirements. I'll keep this. Decision in status. And then gaps in requirements, right? And definitely you have a transcript. OK, it's a bit hard, but that's the direction. And then you can look at it and decide what do you return. So when you return an application, What do you return? Will you include all these basic fit and assessment results and whatnot, or only sometimes?\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T08:52:28.389Z)\nI think I'll just skim through the questions that we had as well.\n\n[Dragos Nuta] (2025-10-27T08:52:32.070Z)\nYou know what? I'll just put transcript here. I'll call separate API call. It's too noisy to always just add a line there for no good reason. Same goes here. I don't know if there's anything else you can add to the basic fit that is always there. That's a good question. I don't have the answer to it. So from your data model, what else did you add or remove? Or sorry, what else did you add? The data model for analytics is not here.\n\n I think you should. Actually, this is the analytics data model. Maybe you can figure out if this is up to date. If you think about it, this is very close to what we have currently, right? Because there are stats.\n\n[Anirudh Bhardwaj] (2025-10-27T08:53:32.421Z)\nSure, sure.\n\n[Dragos Nuta] (2025-10-27T08:53:42.069Z)\nThese are stats. Call stats. I don't remember if that's how we implemented them or we changed something.\n\n[Anirudh Bhardwaj] (2025-10-27T08:53:51.724Z)\nI'll go through the opening specs as well on whatever is there on MCB. I actually thought the document is when I forgot you you told me but I referred to the document only.\n\n[Dragos Nuta] (2025-10-27T08:54:03.813Z)\nIt's fine. We have interview stats. It might it that diagram can definitely be out of date. I would not be confused at all. If that's the case, I wouldn't be surprised at all. Okay, so we have analytics. These are the analytics. And these are very distinct from come on I'm a bit of a control for no OCD there is an application data probably this is a node for this one and if she starts compute based on s are created well I don't know what was control set for a sec so and then I'll control so it was each stage starts was based on application dating this one was based on the other ones the stage starts okay so stage starts was based on this and this one is for that okay there was a good feedback from Andrew on the stats thing, weekly stage level statistics.\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T08:55:34.160Z)\nI think he figured out. He said that we are, because we are fetching it from applications step results, we are not getting any numbers for the onboarding and hired candidates. So it is not returning data for onboarding and hired. Because it is getting fetched from applications.\n\n[Dragos Nuta] (2025-10-27T08:55:52.393Z)\nThat's a big problem. But yeah, it's good to see that. Here's another question, Anirudh. In a diagram like this, how should we expose APIs? The fact that a pipeline has more than one application, what are the endpoints? How do you model endpoints in a diagram? I honestly never did that.\n\n[Anirudh Bhardwaj] (2025-10-27T08:56:20.905Z)\nI've never thought about that.\n\n[Dragos Nuta] (2025-10-27T08:56:24.756Z)\nMaybe it's just a note on it. Maybe it's, I don't like it. Yeah, sure. But we should, we should model that as well. But I think it's getting closer and clearer to what we want to return. And now if I also put like a big box, this is probably there some way. Oh, sorry. So if you, if you query applications, if you're saying, give me all applications, give me all late-stage applications, what does it return?\n\n This whole thing or this is the give me one application data model?\n\n[Anirudh Bhardwaj] (2025-10-27T08:57:00.190Z)\nI think, I should not hypothesize, but if we say late-stage applications, right? So for late-stage applications, what would a user want to analyze?\n\n[Dragos Nuta] (2025-10-27T08:57:16.798Z)\nThey might not want to analyze the basic fit interviews right for let's say the interview I think anything is good because that's where they provide the information that's that's that clarifies whether they meet the requirements or not application detailed info so this is one object in itself now I think that what we are missing here is an application ref what will an application application ref contain?\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T08:57:49.507Z)\nApplication ref for application to the...\n\n[Dragos Nuta] (2025-10-27T08:57:52.950Z)\nWhen a pipeline... I think that when you return a... Do you ever... Okay, let me refine the question. I think I got my answer, but let me refine the question. When you return object as part of a reference collection, you cannot afford to return all the attributes that are relevant. It's just too big. So sometimes you return a ref object, and you allow the LLM to get more information by calling another API.\n\n So do you need a thin application object for queries, such as, who are the late-stage applicants? Just assume for a question such as, for a pipeline, give me certain applications. Like, tell me who are all the people and did something and they've done something short not everything so they can then then oh look at the application details of John and see what returns so I think then I think ITD name and candidate your candidate and stage and because these things will help us would we need a thing is like really last last stage last active stage it's also important Will a profile 360 link make sense here?\n\n Could be.\n\n[Anirudh Bhardwaj] (2025-10-27T08:59:34.408Z)\nand will be so because we are talking to LLM we would not be sending profile 360 link right we would be we would have to actually share why not because it might not have access to the profile 360 link even if they get a profile 360 link as a response what will what will the user may not be able to access that link or what user will be able to access but LLM LLM will not be able to do anything on that.\n\n\n\n[Dragos Nuta] (2025-10-27T09:00:04.539Z)\nNo, but LLM can return that, can put in a description, in a summary, it's for the user. It's not an attribute for the LLM to make decisions on, but it's an attribute to expose to a user to kind of like let them browse through the data, right?\n\n[Anirudh Bhardwaj] (2025-10-27T09:00:24.387Z)\nand this makes it more simple.\n\n[Dragos Nuta] (2025-10-27T09:00:34.451Z)\nSomething tells me that, I mean, I think that this model is fine for the application detailed info. And I think that at some point we might realize that we want to offer a way to return an application and only one or two of these three things, not all of them. But I would not do that now. I can imagine at some point having a list of people saying, oh, get me the hiring interviews, or the interview data.\n\n And it will return only the application and the interview data, instead of interview and basic fit and whatnot. But right now, I mean, do not populate certain objects, such as basic fit screening or assessments. But in the first version, I'll populate everything, not let it filter that.\n\n[Anirudh Bhardwaj] (2025-10-27T09:01:15.477Z)\nGot it. So this object that we have created application detailed info, we should, should we, or should we not create APIs on top of, actually it doesn't make sense. I've got my answer.\n\n[Dragos Nuta] (2025-10-27T09:01:40.201Z)\nYou mean what for each of these objects? I don't think so. Not now. Not required. Maybe at some point we'll create an assessment API and And that one returns assessment ref. And that will be different, but not now. I mean, that's why you have analytics. If you aggregate level batch or assessment level things, this is really for candidate level information. Yeah, detailed analysis. So poke some holes at it.\n\n Oh, and we also have the...\n\n[Anirudh Bhardwaj] (2025-10-27T09:02:20.752Z)\nOr builder nodes, where would that come? Or builder nodes? Oh, yeah.\n\n[Dragos Nuta] (2025-10-27T09:02:25.475Z)\nLet's put it in Salesforce, in the pipeline logic. Call it pipeline manager nodes. Now, what you don't have here is the AAPs. Again, I'm curious how to model. I never thought about this, how to model AAPs on a diagram, or should there be a different diagram?\n\n[Anirudh Bhardwaj] (2025-10-27T09:02:56.782Z)\nI don't know.\n\n[Dragos Nuta] (2025-10-27T09:02:59.202Z)\nThe pipeline definitely will have methods such as get late stage applications, and it will take a time, or it will get like just get applications with different filters. And what will that I think it will return application ref objects. And then another one can say, oh, I have these five applications. Let me get the details of them.\n\n[Anirudh Bhardwaj] (2025-10-27T09:03:25.226Z)\nThat is how I think in that case, pipeline would get connected to application ref.\n\n[Dragos Nuta] (2025-10-27T09:03:30.329Z)\nAnd in general, in general, in general, everything returns a ref. When it's, it's a, yeah. How do you represent on API? I'm just asking a new big question. How do you represent the API calls in the ERP? Why do you have to think so hard? It's like it's not an obvious question, OK? At least I'm not stupid for asking myself. Reality filter. What reality filter? Yeah, maybe I'll find a better answer. Meanwhile, let's do something.\n\n Let's do... So how about if we just add them as rows, but color code them differently for now? So you get late.\n\n[Anirudh Bhardwaj] (2025-10-27T09:05:41.140Z)\nPut it as a note as well that you were suggesting, like a note on top of Because some of them might be a combination of\n\n[UNKNOWN_SPEAKER] (2025-10-27T09:05:48.943Z)\nWhat do you mean, like a note?\n\n[Anirudh Bhardwaj] (2025-10-27T09:05:52.024Z)\nYeah, just on the comment.\n\n[Dragos Nuta] (2025-10-27T09:05:53.321Z)\nComment yellow comment similar to that on each of the okay so late stage applications this is an example and I think I can how can I color code this there should be a way to color code this line color Oh, fill color. That's like too much. Fine. Late-stage applications.\n\n[Anirudh Bhardwaj] (2025-10-27T09:06:34.790Z)\nSo will we have an API late-stage application, or will we have one single API or pipeline that has filters? Late-stage, open-date, closed-date?\n\n[Dragos Nuta] (2025-10-27T09:06:43.314Z)\nI think it boils down to, again, how do you model semantics? Late stage applications implies certain things. Implies that it can be rejected, but it should have been rejected in the last. I think I would, but I don't have a very strong position on that. I mean, a Git application would probably take filters such as current stage, right?\n\n[Dragos Nuta] (2025-10-27T09:07:15.417Z)\nLast stage.\n\n[Anirudh Bhardwaj] (2025-10-27T09:07:18.048Z)\num apply date range um pipeline manager or hiring manager why you not get the pipelines right this is if I have to say fetch me my pipelines only oh then it means that these these things should have been here in the applications right if I have if because I think as I as kevin or Tivian or Heather they would be.\n\n[Dragos Nuta] (2025-10-27T09:07:49.045Z)\nI agree, I'm not saying that I'm saying that I I was I was listing here the applications API, but application applications is. Is on the application is on the pipeline.\n\n[Anirudh Bhardwaj] (2025-10-27T09:08:09.411Z)\nIt will be on the pipeline, right? For this pipeline we would say, Okay, so this is cross reference from application to pipeline as well. Should we have the object of pipeline ITD and pipeline name in the application there?\n\n[Dragos Nuta] (2025-10-27T09:08:31.092Z)\nFor a second, name, owner name. This is what you're saying, get pipelines, right? Is this something like that?\n\n[Anirudh Bhardwaj] (2025-10-27T09:08:56.020Z)\nYeah, exactly.\n\n[Dragos Nuta] (2025-10-27T09:09:01.761Z)\nSo I guess there are some instance APIs and some, I mean, like for a specific pipeline, and there are some type APIs. Like for all, for getting into pipelines. Maybe you want to color code them separately. Blue can be static APIs, like these are for pipe, give me pipelines of a certain type, right? And this is a instance API. For a given pipeline, give me the applications. Now, and should you have a late stage applications endpoint?\n\n I don't know, I think I would add it, but it's really about whether you can ask an LLM what are, give me the late stage applications, which is a very, I think it's a very common query, and whether it will always be able to generate it, because it's also this secures and whatnot, it's a weird one.\n\n[Anirudh Bhardwaj] (2025-10-27T09:09:59.277Z)\nIt's like current stages and late stage are Now, how I thought of solving this in the current schema was using the LLM data context model.\n\n[Dragos Nuta] (2025-10-27T09:10:15.318Z)\nYeah, but it's not going to always work. And I don't know why we would do it when we could just put an API. Makes sense. I would add this too. This is reject date range. And then this is get list of applications is non-rejected ones. If you do this, I think you have a good coverage. What, what is this doing? Oh, I did something else. I did the lines. Not the filling. Oh, get late.\n\n[Anirudh Bhardwaj] (2025-10-27T09:11:23.135Z)\nage rejected and we would want to filter the pipelines by stage as well in get pipelines give me all pipe all application that are and above one get pipelines not no that is One second, output. Application ref.\n\n[Dragos Nuta] (2025-10-27T09:11:56.911Z)\nI think this is super clear if we do it like that.\n\n[Anirudh Bhardwaj] (2025-10-27T09:12:04.094Z)\nYeah, that makes sense.\n\n[Dragos Nuta] (2025-10-27T09:12:10.356Z)\nFor example, this one has No input, right?\n\n[Anirudh Bhardwaj] (2025-10-27T09:12:16.828Z)\nYeah, input, no input. Application ref with list h pass up.\n\n[Dragos Nuta] (2025-10-27T09:12:30.979Z)\nThis is a good visual way to align on the design, right? For us, for Reno, for engineers, for anybody else.\n\n[Anirudh Bhardwaj] (2025-10-27T09:12:39.346Z)\nYeah, I think it's much more simpler for an R8 pick it now.\n\n[Dragos Nuta] (2025-10-27T09:12:50.520Z)\nYou're saying it's not only simpler for us to review and the line is also simpler for us to implement.\n\n[Anirudh Bhardwaj] (2025-10-27T09:12:55.762Z)\nThat is for sure, for you to review it is much more simpler.\n\n[Dragos Nuta] (2025-10-27T09:13:00.664Z)\nBut more than that, it's simpler for you to figure out if you missed anything. It makes sense, right? Input is Reject that date range and then output is application ref array. And this one is... Now, I don't know how output is pipeline array. It's really pipeline, as we said here. Need to make it more complicated than that. There's no pipeline ref object. Another important question would be, oh, are these fuzzy matched?\n\n\n\n[Anirudh Bhardwaj] (2025-10-27T09:13:51.909Z)\nYeah, right now I applied fuzzy matching only.\n\n[Dragos Nuta] (2025-10-27T09:13:56.191Z)\nI don't think they can do fuzzy matching on Salesforce. Just figure out, right? I mean, like, I, um, Don't make it more complicated than it should be. I mean, like if they can't do fuzzy mesh, start with contains. Got it. And then just take from there.\n\n[UNKNOWN_SPEAKER] (2025-10-27T09:14:16.500Z)\nGot it. Got it.\n\n[Dragos Nuta] (2025-10-27T09:14:17.960Z)\nBuild a filter such that it allows for even different words to not be in the same place. So now we have applications. And then this one will probably have something like,\n\n[Anirudh Bhardwaj] (2025-10-27T09:14:30.463Z)\nShould we merge getLateStageApplication and getLateStageRejectedApplication and provide stage as a filter in input?\n\n[Dragos Nuta] (2025-10-27T09:14:41.477Z)\nThat was not my first take. My take was that having this is relevant because if you're focusing on current people in the pipeline and who you should interview next, then you don't care about rejections. In my mind, it's very possible that you'll get You have a lot of use cases for the other ones, yes. So the input here is, input is IDs, I guess, right? Or ITD array. And the output is the entire application detail info.\n\n And this is probably at some point you can get, then what do you want? Oh, I just want the interview date. I want what do you want from that application to start to make sense, right? To add a filter and to process that, okay? So stats are stats. These are already part of that. I think we can also...\n\n[Anirudh Bhardwaj] (2025-10-27T09:15:49.055Z)\nI will map them in the current one and map them. How would we use requirements now? Because we had kept it.\n\n[Dragos Nuta] (2025-10-27T09:15:57.981Z)\nOne second, now you also have... Do you return R2 always or not? Based on this diagram, it's not always because that's a reference and we don't really... How do you define an inclusion? I feel like there are questions I never thought about finding an answer in the old world. I need an answer. I'll put this on a different feeling. The meaning is the following. They are encapsulated. Actually, in a sense, they are encapsulated because it's, yeah, I want to show encapsulation with this.\n\n Definitely, this is going to be a different API. So you'll want, on the green one, You'll want requirements for a particular R2.\n\n[Anirudh Bhardwaj] (2025-10-27T09:17:06.319Z)\nShould we have separate APIs for R2 and JD or one single API for?\n\n[Dragos Nuta] (2025-10-27T09:17:10.440Z)\nI think there should be separate. Get job description. Because there's a lot of redundancy in between the two. And I don't think that you'll always need both. And it does add to the context significantly.\n\n[Anirudh Bhardwaj] (2025-10-27T09:17:26.072Z)\nGot it. I got confused because when I was going through the framework, it said that try developing coarse grained APIs which solve one business outcome. So that's why I was not focusing on fine grained APIs.\n\n[Dragos Nuta] (2025-10-27T09:17:40.583Z)\nYou also have a context problem there. If you look at it, this is coarse grained. Look at it.\n\n[Anirudh Bhardwaj] (2025-10-27T09:17:46.167Z)\nIt is coarse grained.\n\n[Anirudh Bhardwaj] (2025-10-27T09:17:47.628Z)\nYeah, I missed the context. No, I understood your point.\n\n[Dragos Nuta] (2025-10-27T09:17:50.170Z)\nI was thinking whether- What do you do with the transcripts? Can't throw all those transcripts. At some point, you'll get confused on which one has what, right?\n\n[Anirudh Bhardwaj] (2025-10-27T09:17:57.559Z)\nNo, no, that is why I made one API of requirements. No, I got your point. Makes sense.\n\n[Dragos Nuta] (2025-10-27T09:18:05.884Z)\nI'm not claiming these are the perfect decisions. Anyway, I think you have to write ITD. I think that after you do this, you'll have to start. I'll ask you to start writing some ITD on what were our learnings in terms of decisions or practices in building APIs if they work, right? If we do this, I think we cover everything.\n\n[Anirudh Bhardwaj] (2025-10-27T09:18:38.485Z)\nMost of them, yeah.\n\n[Dragos Nuta] (2025-10-27T09:18:42.046Z)\nWhat would they be missing from the new things you wanted to add?\n\n[Anirudh Bhardwaj] (2025-10-27T09:18:46.567Z)\nNot in this version. I think one thing which we deliberately kept out of scope is cross this fencing of applications for a particular candidate.\n\n[Dragos Nuta] (2025-10-27T09:18:55.268Z)\nSo at some point, we'll model the candidate object, then we'll probably build a search on it. Like, get me candidates that, and then it's something. Like, they have this badge. But we're not there yet. You see, you don't even know what to model. You're going to put a requirement, but when you go to implementers, they'll be like, so we'll need to build an API that does what? Because I have no idea.\n\n Take a pass on it. Just figure out if these are all good. Perhaps define the APIs for those that are missing. And maybe the spec is just like, let's implement. Enough for you to continue?\n\n[Anirudh Bhardwaj] (2025-10-27T09:19:40.321Z)\nThank you. Thank you. Thank you, Dragos. One more thing."}